[NoCoverage] BlockStatement
controllers/Management/login.controller.js:6:35
 const jwt = require('jsonwebtoken');
 
 
-const Login = async (req, res) => {
-  const { email, password } = req.body;
-
-  try {
-    const user = await User.findOne({ email });
-    if (!user)
-      return res.status(400).json({ msg: "User Doesn't Exist!" });
-
-    const isMatch = await bcrypt.compare(password, user.password);
-    if (!isMatch || user.role !== "management_admin")
-      return res.status(400).json({ msg: 'Credentials Not Matched!' });
-
-    const payload = { userId: user.id };
-    const token = jwt.sign(payload, process.env.JWT_SECRET, { expiresIn: '1h' });
-
-    user.token = token;
-    await user.save();
-    
-    return res.json({ token });
-  } catch (error) {
-    console.log("student.login.controller.js => ", error);
-    return res.status(500).json({ msg: "Internal Server Error!" });
-  }
-}
+const Login = async (req, res) => {}
 
 module.exports = Login;

[NoCoverage] BlockStatement
controllers/Management/login.controller.js:9:7
 const Login = async (req, res) => {
   const { email, password } = req.body;
 
-  try {
-    const user = await User.findOne({ email });
-    if (!user)
-      return res.status(400).json({ msg: "User Doesn't Exist!" });
-
-    const isMatch = await bcrypt.compare(password, user.password);
-    if (!isMatch || user.role !== "management_admin")
-      return res.status(400).json({ msg: 'Credentials Not Matched!' });
-
-    const payload = { userId: user.id };
-    const token = jwt.sign(payload, process.env.JWT_SECRET, { expiresIn: '1h' });
-
-    user.token = token;
-    await user.save();
-    
-    return res.json({ token });
-  } catch (error) {
+  try {} catch (error) {
     console.log("student.login.controller.js => ", error);
     return res.status(500).json({ msg: "Internal Server Error!" });

[NoCoverage] ObjectLiteral
controllers/Management/login.controller.js:10:37
   const { email, password } = req.body;
 
   try {
-    const user = await User.findOne({ email });
+    const user = await User.findOne({});
     if (!user)
       return res.status(400).json({ msg: "User Doesn't Exist!" });

[NoCoverage] ConditionalExpression
controllers/Management/login.controller.js:11:9
 
   try {
     const user = await User.findOne({ email });
-    if (!user)
+    if (true)
       return res.status(400).json({ msg: "User Doesn't Exist!" });
 

[NoCoverage] BooleanLiteral
controllers/Management/login.controller.js:11:9
 
   try {
     const user = await User.findOne({ email });
-    if (!user)
+    if (user)
       return res.status(400).json({ msg: "User Doesn't Exist!" });
 

[NoCoverage] StringLiteral
controllers/Management/login.controller.js:12:42
   try {
     const user = await User.findOne({ email });
     if (!user)
-      return res.status(400).json({ msg: "User Doesn't Exist!" });
+      return res.status(400).json({ msg: "" });
 
     const isMatch = await bcrypt.compare(password, user.password);

[NoCoverage] ConditionalExpression
controllers/Management/login.controller.js:15:9
       return res.status(400).json({ msg: "User Doesn't Exist!" });
 
     const isMatch = await bcrypt.compare(password, user.password);
-    if (!isMatch || user.role !== "management_admin")
+    if (false)
       return res.status(400).json({ msg: 'Credentials Not Matched!' });
 

[NoCoverage] ConditionalExpression
controllers/Management/login.controller.js:15:21
       return res.status(400).json({ msg: "User Doesn't Exist!" });
 
     const isMatch = await bcrypt.compare(password, user.password);
-    if (!isMatch || user.role !== "management_admin")
+    if (!isMatch || false)
       return res.status(400).json({ msg: 'Credentials Not Matched!' });
 

[NoCoverage] StringLiteral
controllers/Management/login.controller.js:16:42
 
     const isMatch = await bcrypt.compare(password, user.password);
     if (!isMatch || user.role !== "management_admin")
-      return res.status(400).json({ msg: 'Credentials Not Matched!' });
+      return res.status(400).json({ msg: "" });
 
     const payload = { userId: user.id };

[NoCoverage] ObjectLiteral
controllers/Management/login.controller.js:19:61
       return res.status(400).json({ msg: 'Credentials Not Matched!' });
 
     const payload = { userId: user.id };
-    const token = jwt.sign(payload, process.env.JWT_SECRET, { expiresIn: '1h' });
+    const token = jwt.sign(payload, process.env.JWT_SECRET, {});
 
     user.token = token;

[NoCoverage] BlockStatement
controllers/Management/login.controller.js:25:19
     await user.save();
     
     return res.json({ token });
-  } catch (error) {
-    console.log("student.login.controller.js => ", error);
-    return res.status(500).json({ msg: "Internal Server Error!" });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
controllers/Management/login.controller.js:26:17
     
     return res.json({ token });
   } catch (error) {
-    console.log("student.login.controller.js => ", error);
+    console.log("", error);
     return res.status(500).json({ msg: "Internal Server Error!" });
   }
