[NoCoverage] BlockStatement
controllers/Company/company.all-company.controller.js:5:7
 
 
 const AddCompany = async (req, res) => {
-  try {
-    const companyName = req.body.companyName;
-    const companyDescription = req.body.companyDescription;
-    const companyWebsite = req.body.companyWebsite;
-    const companyLocation = req.body.companyLocation;
-    const companyDifficulty = req.body.companyDifficulty;
-
-    if (await CompanySchema.findOne({ companyName: companyName })) {
-      return res.status(400).json({ msg: "Company Name Already Exist!" })
-    }
-
-    const newcmp = new CompanySchema({
-      companyName,
-      companyDescription,
-      companyWebsite,
-      companyLocation,
-      companyDifficulty
-    });
-
-    await newcmp.save();
-
-    return res.status(201).json({ msg: "Company Created Successfully!", });
-  } catch (error) {
+  try {} catch (error) {
     console.log("company.all-company.controller.js = AddCompany => ", error);
     return res.status(500).json({ msg: 'Server Error' });

[NoCoverage] ConditionalExpression
controllers/Company/company.all-company.controller.js:12:9
     const companyLocation = req.body.companyLocation;
     const companyDifficulty = req.body.companyDifficulty;
 
-    if (await CompanySchema.findOne({ companyName: companyName })) {
+    if (true) {
       return res.status(400).json({ msg: "Company Name Already Exist!" })
     }

[NoCoverage] BlockStatement
controllers/Company/company.all-company.controller.js:12:68
     const companyLocation = req.body.companyLocation;
     const companyDifficulty = req.body.companyDifficulty;
 
-    if (await CompanySchema.findOne({ companyName: companyName })) {
-      return res.status(400).json({ msg: "Company Name Already Exist!" })
-    }
+    if (await CompanySchema.findOne({ companyName: companyName })) {}
 
     const newcmp = new CompanySchema({

[NoCoverage] StringLiteral
controllers/Company/company.all-company.controller.js:13:42
     const companyDifficulty = req.body.companyDifficulty;
 
     if (await CompanySchema.findOne({ companyName: companyName })) {
-      return res.status(400).json({ msg: "Company Name Already Exist!" })
+      return res.status(400).json({ msg: "" })
     }
 

[NoCoverage] ObjectLiteral
controllers/Company/company.all-company.controller.js:16:38
       return res.status(400).json({ msg: "Company Name Already Exist!" })
     }
 
-    const newcmp = new CompanySchema({
-      companyName,
-      companyDescription,
-      companyWebsite,
-      companyLocation,
-      companyDifficulty
-    });
+    const newcmp = new CompanySchema({});
 
     await newcmp.save();

[NoCoverage] BlockStatement
controllers/Company/company.all-company.controller.js:27:19
     await newcmp.save();
 
     return res.status(201).json({ msg: "Company Created Successfully!", });
-  } catch (error) {
-    console.log("company.all-company.controller.js = AddCompany => ", error);
-    return res.status(500).json({ msg: 'Server Error' });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
controllers/Company/company.all-company.controller.js:28:17
 
     return res.status(201).json({ msg: "Company Created Successfully!", });
   } catch (error) {
-    console.log("company.all-company.controller.js = AddCompany => ", error);
+    console.log("", error);
     return res.status(500).json({ msg: 'Server Error' });
   }

[NoCoverage] StringLiteral
controllers/Company/company.all-company.controller.js:29:40
     return res.status(201).json({ msg: "Company Created Successfully!", });
   } catch (error) {
     console.log("company.all-company.controller.js = AddCompany => ", error);
-    return res.status(500).json({ msg: 'Server Error' });
+    return res.status(500).json({ msg: "" });
   }
 }

[NoCoverage] ObjectLiteral
controllers/Company/company.all-company.controller.js:29:33
     return res.status(201).json({ msg: "Company Created Successfully!", });
   } catch (error) {
     console.log("company.all-company.controller.js = AddCompany => ", error);
-    return res.status(500).json({ msg: 'Server Error' });
+    return res.status(500).json({});
   }
 }

[NoCoverage] BlockStatement
controllers/Company/company.all-company.controller.js:33:43
   }
 }
 
-const UpdateCompany = async (req, res) => {
-  try {
-    const companyId = req.query.companyId;
-    if (!companyId) return res.status(404).json({ msg: "Company Not Found!" });
-
-    const { companyName, companyDescription, companyWebsite, companyLocation, companyDifficulty } = req.body;
-
-    const company = await CompanySchema.findById(companyId);
-
-    // Update only the fields that are provided in the request body
-    company.companyName = companyName || company.companyName;
-    company.companyDescription = companyDescription || company.companyDescription;
-    company.companyWebsite = companyWebsite || company.companyWebsite;
-    company.companyLocation = companyLocation || company.companyLocation;
-    company.companyDifficulty = companyDifficulty || company.companyDifficulty;
-
-    await company.save();
-
-    return res.status(201).json({ msg: "Company Details Updated!", });
-  } catch (error) {
-    console.log("company.all-company.controller.js = AddCompany => ", error);
-    return res.status(500).json({ msg: 'Server Error' });
-  }
-}
+const UpdateCompany = async (req, res) => {}
 
 

[NoCoverage] BlockStatement
controllers/Company/company.all-company.controller.js:34:7
 }
 
 const UpdateCompany = async (req, res) => {
-  try {
-    const companyId = req.query.companyId;
-    if (!companyId) return res.status(404).json({ msg: "Company Not Found!" });
-
-    const { companyName, companyDescription, companyWebsite, companyLocation, companyDifficulty } = req.body;
-
-    const company = await CompanySchema.findById(companyId);
-
-    // Update only the fields that are provided in the request body
-    company.companyName = companyName || company.companyName;
-    company.companyDescription = companyDescription || company.companyDescription;
-    company.companyWebsite = companyWebsite || company.companyWebsite;
-    company.companyLocation = companyLocation || company.companyLocation;
-    company.companyDifficulty = companyDifficulty || company.companyDifficulty;
-
-    await company.save();
-
-    return res.status(201).json({ msg: "Company Details Updated!", });
-  } catch (error) {
+  try {} catch (error) {
     console.log("company.all-company.controller.js = AddCompany => ", error);
     return res.status(500).json({ msg: 'Server Error' });

[NoCoverage] ConditionalExpression
controllers/Company/company.all-company.controller.js:36:9
 const UpdateCompany = async (req, res) => {
   try {
     const companyId = req.query.companyId;
-    if (!companyId) return res.status(404).json({ msg: "Company Not Found!" });
+    if (true) return res.status(404).json({ msg: "Company Not Found!" });
 
     const { companyName, companyDescription, companyWebsite, companyLocation, companyDifficulty } = req.body;

[NoCoverage] ConditionalExpression
controllers/Company/company.all-company.controller.js:36:9
 const UpdateCompany = async (req, res) => {
   try {
     const companyId = req.query.companyId;
-    if (!companyId) return res.status(404).json({ msg: "Company Not Found!" });
+    if (false) return res.status(404).json({ msg: "Company Not Found!" });
 
     const { companyName, companyDescription, companyWebsite, companyLocation, companyDifficulty } = req.body;

[NoCoverage] LogicalOperator
controllers/Company/company.all-company.controller.js:43:27
     const company = await CompanySchema.findById(companyId);
 
     // Update only the fields that are provided in the request body
-    company.companyName = companyName || company.companyName;
+    company.companyName = companyName && company.companyName;
     company.companyDescription = companyDescription || company.companyDescription;
     company.companyWebsite = companyWebsite || company.companyWebsite;

[NoCoverage] ConditionalExpression
controllers/Company/company.all-company.controller.js:43:27
     const company = await CompanySchema.findById(companyId);
 
     // Update only the fields that are provided in the request body
-    company.companyName = companyName || company.companyName;
+    company.companyName = true;
     company.companyDescription = companyDescription || company.companyDescription;
     company.companyWebsite = companyWebsite || company.companyWebsite;

[NoCoverage] LogicalOperator
controllers/Company/company.all-company.controller.js:44:34
 
     // Update only the fields that are provided in the request body
     company.companyName = companyName || company.companyName;
-    company.companyDescription = companyDescription || company.companyDescription;
+    company.companyDescription = companyDescription && company.companyDescription;
     company.companyWebsite = companyWebsite || company.companyWebsite;
     company.companyLocation = companyLocation || company.companyLocation;

[NoCoverage] ConditionalExpression
controllers/Company/company.all-company.controller.js:44:34
 
     // Update only the fields that are provided in the request body
     company.companyName = companyName || company.companyName;
-    company.companyDescription = companyDescription || company.companyDescription;
+    company.companyDescription = false;
     company.companyWebsite = companyWebsite || company.companyWebsite;
     company.companyLocation = companyLocation || company.companyLocation;

[NoCoverage] ConditionalExpression
controllers/Company/company.all-company.controller.js:45:30
     // Update only the fields that are provided in the request body
     company.companyName = companyName || company.companyName;
     company.companyDescription = companyDescription || company.companyDescription;
-    company.companyWebsite = companyWebsite || company.companyWebsite;
+    company.companyWebsite = false;
     company.companyLocation = companyLocation || company.companyLocation;
     company.companyDifficulty = companyDifficulty || company.companyDifficulty;

[NoCoverage] LogicalOperator
controllers/Company/company.all-company.controller.js:45:30
     // Update only the fields that are provided in the request body
     company.companyName = companyName || company.companyName;
     company.companyDescription = companyDescription || company.companyDescription;
-    company.companyWebsite = companyWebsite || company.companyWebsite;
+    company.companyWebsite = companyWebsite && company.companyWebsite;
     company.companyLocation = companyLocation || company.companyLocation;
     company.companyDifficulty = companyDifficulty || company.companyDifficulty;

[NoCoverage] LogicalOperator
controllers/Company/company.all-company.controller.js:46:31
     company.companyName = companyName || company.companyName;
     company.companyDescription = companyDescription || company.companyDescription;
     company.companyWebsite = companyWebsite || company.companyWebsite;
-    company.companyLocation = companyLocation || company.companyLocation;
+    company.companyLocation = companyLocation && company.companyLocation;
     company.companyDifficulty = companyDifficulty || company.companyDifficulty;
 

[NoCoverage] ConditionalExpression
controllers/Company/company.all-company.controller.js:46:31
     company.companyName = companyName || company.companyName;
     company.companyDescription = companyDescription || company.companyDescription;
     company.companyWebsite = companyWebsite || company.companyWebsite;
-    company.companyLocation = companyLocation || company.companyLocation;
+    company.companyLocation = true;
     company.companyDifficulty = companyDifficulty || company.companyDifficulty;
 

[NoCoverage] ConditionalExpression
controllers/Company/company.all-company.controller.js:47:33
     company.companyDescription = companyDescription || company.companyDescription;
     company.companyWebsite = companyWebsite || company.companyWebsite;
     company.companyLocation = companyLocation || company.companyLocation;
-    company.companyDifficulty = companyDifficulty || company.companyDifficulty;
+    company.companyDifficulty = true;
 
     await company.save();

[NoCoverage] LogicalOperator
controllers/Company/company.all-company.controller.js:47:33
     company.companyDescription = companyDescription || company.companyDescription;
     company.companyWebsite = companyWebsite || company.companyWebsite;
     company.companyLocation = companyLocation || company.companyLocation;
-    company.companyDifficulty = companyDifficulty || company.companyDifficulty;
+    company.companyDifficulty = companyDifficulty && company.companyDifficulty;
 
     await company.save();

[NoCoverage] ObjectLiteral
controllers/Company/company.all-company.controller.js:51:33
 
     await company.save();
 
-    return res.status(201).json({ msg: "Company Details Updated!", });
+    return res.status(201).json({});
   } catch (error) {
     console.log("company.all-company.controller.js = AddCompany => ", error);

[NoCoverage] StringLiteral
controllers/Company/company.all-company.controller.js:51:40
 
     await company.save();
 
-    return res.status(201).json({ msg: "Company Details Updated!", });
+    return res.status(201).json({ msg: "", });
   } catch (error) {
     console.log("company.all-company.controller.js = AddCompany => ", error);

[NoCoverage] BlockStatement
controllers/Company/company.all-company.controller.js:52:19
     await company.save();
 
     return res.status(201).json({ msg: "Company Details Updated!", });
-  } catch (error) {
-    console.log("company.all-company.controller.js = AddCompany => ", error);
-    return res.status(500).json({ msg: 'Server Error' });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
controllers/Company/company.all-company.controller.js:59:43
 }
 
 
-const CompanyDetail = async (req, res) => {
-  try {
-    if (req.query.companyId) {
-      const company = await CompanySchema.findById(req.query.companyId);
-      return res.json({ company });
-    }
-  } catch (error) {
-    console.log("company.all-company.controller.js = CompanyDetail => ", error);
-    return res.status(500).json({ msg: 'Server Error' });
-  }
-}
+const CompanyDetail = async (req, res) => {}
 
 const AllCompanyDetail = async (req, res) => {

[NoCoverage] BlockStatement
controllers/Company/company.all-company.controller.js:60:7
 
 
 const CompanyDetail = async (req, res) => {
-  try {
-    if (req.query.companyId) {
-      const company = await CompanySchema.findById(req.query.companyId);
-      return res.json({ company });
-    }
-  } catch (error) {
+  try {} catch (error) {
     console.log("company.all-company.controller.js = CompanyDetail => ", error);
     return res.status(500).json({ msg: 'Server Error' });

[NoCoverage] ConditionalExpression
controllers/Company/company.all-company.controller.js:61:9
 
 const CompanyDetail = async (req, res) => {
   try {
-    if (req.query.companyId) {
+    if (true) {
       const company = await CompanySchema.findById(req.query.companyId);
       return res.json({ company });

[NoCoverage] BlockStatement
controllers/Company/company.all-company.controller.js:61:30
 
 const CompanyDetail = async (req, res) => {
   try {
-    if (req.query.companyId) {
-      const company = await CompanySchema.findById(req.query.companyId);
-      return res.json({ company });
-    }
+    if (req.query.companyId) {}
   } catch (error) {
     console.log("company.all-company.controller.js = CompanyDetail => ", error);

[NoCoverage] BlockStatement
controllers/Company/company.all-company.controller.js:65:19
       const company = await CompanySchema.findById(req.query.companyId);
       return res.json({ company });
     }
-  } catch (error) {
-    console.log("company.all-company.controller.js = CompanyDetail => ", error);
-    return res.status(500).json({ msg: 'Server Error' });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] ObjectLiteral
controllers/Company/company.all-company.controller.js:67:33
     }
   } catch (error) {
     console.log("company.all-company.controller.js = CompanyDetail => ", error);
-    return res.status(500).json({ msg: 'Server Error' });
+    return res.status(500).json({});
   }
 }

[NoCoverage] BlockStatement
controllers/Company/company.all-company.controller.js:71:46
   }
 }
 
-const AllCompanyDetail = async (req, res) => {
-  try {
-    const companys = await CompanySchema.find();
-    // console.log(companys)
-    return res.json({ companys });
-  } catch (error) {
-    console.log("company.all-company.controller.js = AllCompanyDetail => ", error);
-    return res.status(500).json({ msg: 'Server Error' });
-  }
-}
+const AllCompanyDetail = async (req, res) => {}
 
 const DeleteCompany = async (req, res) => {

[NoCoverage] BlockStatement
controllers/Company/company.all-company.controller.js:72:7
 }
 
 const AllCompanyDetail = async (req, res) => {
-  try {
-    const companys = await CompanySchema.find();
-    // console.log(companys)
-    return res.json({ companys });
-  } catch (error) {
+  try {} catch (error) {
     console.log("company.all-company.controller.js = AllCompanyDetail => ", error);
     return res.status(500).json({ msg: 'Server Error' });

[NoCoverage] BlockStatement
controllers/Company/company.all-company.controller.js:76:19
     const companys = await CompanySchema.find();
     // console.log(companys)
     return res.json({ companys });
-  } catch (error) {
-    console.log("company.all-company.controller.js = AllCompanyDetail => ", error);
-    return res.status(500).json({ msg: 'Server Error' });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
controllers/Company/company.all-company.controller.js:77:17
     // console.log(companys)
     return res.json({ companys });
   } catch (error) {
-    console.log("company.all-company.controller.js = AllCompanyDetail => ", error);
+    console.log("", error);
     return res.status(500).json({ msg: 'Server Error' });
   }

[NoCoverage] BlockStatement
controllers/Company/company.all-company.controller.js:82:43
   }
 }
 
-const DeleteCompany = async (req, res) => {
-  try {
-    // await CompanySchema.findByIdAndDelete(req.body.companyId);
-    const company = await CompanySchema.findById(req.body.companyId);
-    // company and related jobs removed
-    await company.deleteOne();
-    return res.json({ msg: "Company Deleted Successfully!" });
-  } catch (error) {
-    console.log("company.all-company.controller.js = DeleteCompany => ", error);
-    return res.status(500).json({ msg: 'Server Error' });
-  }
-}
+const DeleteCompany = async (req, res) => {}
 
 

[NoCoverage] BlockStatement
controllers/Company/company.all-company.controller.js:83:7
 }
 
 const DeleteCompany = async (req, res) => {
-  try {
-    // await CompanySchema.findByIdAndDelete(req.body.companyId);
-    const company = await CompanySchema.findById(req.body.companyId);
-    // company and related jobs removed
-    await company.deleteOne();
-    return res.json({ msg: "Company Deleted Successfully!" });
-  } catch (error) {
+  try {} catch (error) {
     console.log("company.all-company.controller.js = DeleteCompany => ", error);
     return res.status(500).json({ msg: 'Server Error' });

[NoCoverage] StringLiteral
controllers/Company/company.all-company.controller.js:88:28
     const company = await CompanySchema.findById(req.body.companyId);
     // company and related jobs removed
     await company.deleteOne();
-    return res.json({ msg: "Company Deleted Successfully!" });
+    return res.json({ msg: "" });
   } catch (error) {
     console.log("company.all-company.controller.js = DeleteCompany => ", error);

[NoCoverage] BlockStatement
controllers/Company/company.all-company.controller.js:89:19
     // company and related jobs removed
     await company.deleteOne();
     return res.json({ msg: "Company Deleted Successfully!" });
-  } catch (error) {
-    console.log("company.all-company.controller.js = DeleteCompany => ", error);
-    return res.status(500).json({ msg: 'Server Error' });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
controllers/Company/company.all-company.controller.js:91:40
     return res.json({ msg: "Company Deleted Successfully!" });
   } catch (error) {
     console.log("company.all-company.controller.js = DeleteCompany => ", error);
-    return res.status(500).json({ msg: 'Server Error' });
+    return res.status(500).json({ msg: "" });
   }
 }
