[NoCoverage] BlockStatement
controllers/Management/add-user.controller.js:10:7
 const AddTPO = async (req, res) => {
   const { email, first_name, number } = req.body;
 
-  try {
-    if (await Users.findOne({ email }))
-      return res.json({ msg: "User Already Exists!" });
-
-    const password = generatePassword();
-
-    const hashPassword = await bcrypt.hash(password, 10);
-
-    Users.create({ first_name, email, number, password: hashPassword, role: "tpo_admin" });
-
-    const html = emailTemplate({
-      role: "TPO",
-      name: first_name,
-      email: email,
-      password: password
-    });
-    const subject = "Welcome to CPMS | Your Login Credentials as a TPO";
-
-    await sendMail(email, subject, html);
-
-    return res.json({ msg: "User Created!" });
-  } catch (error) {
+  try {} catch (error) {
     console.log("management-user-add-tpo => ", error);
     return res.json({ msg: "Internal Server Error!" });

[NoCoverage] ConditionalExpression
controllers/Management/add-user.controller.js:11:9
   const { email, first_name, number } = req.body;
 
   try {
-    if (await Users.findOne({ email }))
+    if (false)
       return res.json({ msg: "User Already Exists!" });
 

[NoCoverage] ConditionalExpression
controllers/Management/add-user.controller.js:11:9
   const { email, first_name, number } = req.body;
 
   try {
-    if (await Users.findOne({ email }))
+    if (true)
       return res.json({ msg: "User Already Exists!" });
 

[NoCoverage] StringLiteral
controllers/Management/add-user.controller.js:18:77
 
     const hashPassword = await bcrypt.hash(password, 10);
 
-    Users.create({ first_name, email, number, password: hashPassword, role: "tpo_admin" });
+    Users.create({ first_name, email, number, password: hashPassword, role: "" });
 
     const html = emailTemplate({

[NoCoverage] StringLiteral
controllers/Management/add-user.controller.js:26:21
       email: email,
       password: password
     });
-    const subject = "Welcome to CPMS | Your Login Credentials as a TPO";
+    const subject = "";
 
     await sendMail(email, subject, html);

[NoCoverage] BlockStatement
controllers/Management/add-user.controller.js:31:19
     await sendMail(email, subject, html);
 
     return res.json({ msg: "User Created!" });
-  } catch (error) {
-    console.log("management-user-add-tpo => ", error);
-    return res.json({ msg: "Internal Server Error!" });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] ObjectLiteral
controllers/Management/add-user.controller.js:33:21
     return res.json({ msg: "User Created!" });
   } catch (error) {
     console.log("management-user-add-tpo => ", error);
-    return res.json({ msg: "Internal Server Error!" });
+    return res.json({});
   }
 }

[NoCoverage] BlockStatement
controllers/Management/add-user.controller.js:40:7
 const AddManagement = async (req, res) => {
   const { email, first_name, number } = req.body;
 
-  try {
-    if (await Users.findOne({ email }))
-      return res.json({ msg: "User Already Exists!" });
-
-    const password = generatePassword();
-
-    const hashPassword = await bcrypt.hash(password, 10);
-
-    Users.create({ first_name, email, number, password: hashPassword, role: "management_admin" });
-
-    const html = emailTemplate({
-      role: "Management",
-      name: first_name,
-      email: email,
-      password: password
-    });
-    const subject = "Welcome to CPMS | Your Login Credentials as a Management";
-
-    await sendMail(email, subject, html);
-    return res.json({ msg: "User Created!" });
-  } catch (error) {
+  try {} catch (error) {
     console.log("management-user-add-management => ", error);
     return res.json({ msg: "Internal Server Error!" });

[NoCoverage] ObjectLiteral
controllers/Management/add-user.controller.js:48:18
 
     const hashPassword = await bcrypt.hash(password, 10);
 
-    Users.create({ first_name, email, number, password: hashPassword, role: "management_admin" });
+    Users.create({});
 
     const html = emailTemplate({

[NoCoverage] StringLiteral
controllers/Management/add-user.controller.js:59:28
     const subject = "Welcome to CPMS | Your Login Credentials as a Management";
 
     await sendMail(email, subject, html);
-    return res.json({ msg: "User Created!" });
+    return res.json({ msg: "" });
   } catch (error) {
     console.log("management-user-add-management => ", error);

[NoCoverage] BlockStatement
controllers/Management/add-user.controller.js:60:19
 
     await sendMail(email, subject, html);
     return res.json({ msg: "User Created!" });
-  } catch (error) {
-    console.log("management-user-add-management => ", error);
-    return res.json({ msg: "Internal Server Error!" });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
controllers/Management/add-user.controller.js:62:28
     return res.json({ msg: "User Created!" });
   } catch (error) {
     console.log("management-user-add-management => ", error);
-    return res.json({ msg: "Internal Server Error!" });
+    return res.json({ msg: "" });
   }
 }

[NoCoverage] BlockStatement
controllers/Management/add-user.controller.js:69:7
 const AddStudent = async (req, res) => {
   const { email, first_name, number } = req.body;
 
-  try {
-    if (await Users.findOne({ email }))
-      return res.json({ msg: "User Already Exists!" });
-
-    const password = generatePassword();
-
-    const hashPassword = await bcrypt.hash(password, 10);
-
-    Users.create({ first_name, email, number, password: hashPassword, role: "student", "studentProfile.isApproved": true });
-
-    const html = emailTemplate({
-      role: "Student",
-      name: first_name,
-      email: email,
-      password: password
-    });
-    const subject = "Welcome to CPMS | Your Login Credentials as a Student";
-
-    await sendMail(email, subject, html);
-
-    return res.json({ msg: "User Created!" });
-  } catch (error) {
+  try {} catch (error) {
     console.log("management-user-add-management => ", error);
     return res.json({ msg: "Internal Server Error!" });

[NoCoverage] BooleanLiteral
controllers/Management/add-user.controller.js:77:117
 
     const hashPassword = await bcrypt.hash(password, 10);
 
-    Users.create({ first_name, email, number, password: hashPassword, role: "student", "studentProfile.isApproved": true });
+    Users.create({ first_name, email, number, password: hashPassword, role: "student", "studentProfile.isApproved": false });
 
     const html = emailTemplate({

[NoCoverage] ObjectLiteral
controllers/Management/add-user.controller.js:77:18
 
     const hashPassword = await bcrypt.hash(password, 10);
 
-    Users.create({ first_name, email, number, password: hashPassword, role: "student", "studentProfile.isApproved": true });
+    Users.create({});
 
     const html = emailTemplate({

[NoCoverage] ObjectLiteral
controllers/Management/add-user.controller.js:79:32
 
     Users.create({ first_name, email, number, password: hashPassword, role: "student", "studentProfile.isApproved": true });
 
-    const html = emailTemplate({
-      role: "Student",
-      name: first_name,
-      email: email,
-      password: password
-    });
+    const html = emailTemplate({});
     const subject = "Welcome to CPMS | Your Login Credentials as a Student";
 
