[NoCoverage] BlockStatement
controllers/Student/login.controller.js:9:7
 const Login = async (req, res) => {
   const { email, password } = req.body;
 
-  try {
-    const user = await StudentUser.findOne({ email });
-    if (!user)
-      return res.status(400).json({ msg: "User Doesn't Exist!" });
-
-    // password match 
-    const isMatch = await bcrypt.compare(password, user.password);
-    if (!isMatch || user.role !== "student")
-      return res.status(400).json({ msg: 'Credentials Not Matched!' });
-
-    // check if tpo has approved student
-    // if (!user.studentProfile.isApproved) 
-    //   return res.status(400).json({ msg: 'TPO has not approved you application, please try after some time!' });
-
-    const payload = { userId: user.id };
-    const token = jwt.sign(payload, process.env.JWT_SECRET, { expiresIn: '1h' });
-
-    user.token = token;
-    await user.save();
-
-    return res.json({ token });
-  } catch (error) {
+  try {} catch (error) {
     console.log("student.login.controller.js => ", error);
     return res.status(500).json({ msg: "Internal Server Error!" });

[NoCoverage] ObjectLiteral
controllers/Student/login.controller.js:10:44
   const { email, password } = req.body;
 
   try {
-    const user = await StudentUser.findOne({ email });
+    const user = await StudentUser.findOne({});
     if (!user)
       return res.status(400).json({ msg: "User Doesn't Exist!" });

[NoCoverage] ConditionalExpression
controllers/Student/login.controller.js:11:9
 
   try {
     const user = await StudentUser.findOne({ email });
-    if (!user)
+    if (true)
       return res.status(400).json({ msg: "User Doesn't Exist!" });
 

[NoCoverage] BooleanLiteral
controllers/Student/login.controller.js:11:9
 
   try {
     const user = await StudentUser.findOne({ email });
-    if (!user)
+    if (user)
       return res.status(400).json({ msg: "User Doesn't Exist!" });
 

[NoCoverage] ObjectLiteral
controllers/Student/login.controller.js:12:35
   try {
     const user = await StudentUser.findOne({ email });
     if (!user)
-      return res.status(400).json({ msg: "User Doesn't Exist!" });
+      return res.status(400).json({});
 
     // password match 

[NoCoverage] ConditionalExpression
controllers/Student/login.controller.js:16:9
 
     // password match 
     const isMatch = await bcrypt.compare(password, user.password);
-    if (!isMatch || user.role !== "student")
+    if (false)
       return res.status(400).json({ msg: 'Credentials Not Matched!' });
 

[NoCoverage] LogicalOperator
controllers/Student/login.controller.js:16:9
 
     // password match 
     const isMatch = await bcrypt.compare(password, user.password);
-    if (!isMatch || user.role !== "student")
+    if (!isMatch && user.role !== "student")
       return res.status(400).json({ msg: 'Credentials Not Matched!' });
 

[NoCoverage] ObjectLiteral
controllers/Student/login.controller.js:23:21
     // if (!user.studentProfile.isApproved) 
     //   return res.status(400).json({ msg: 'TPO has not approved you application, please try after some time!' });
 
-    const payload = { userId: user.id };
+    const payload = {};
     const token = jwt.sign(payload, process.env.JWT_SECRET, { expiresIn: '1h' });
 

[NoCoverage] ObjectLiteral
controllers/Student/login.controller.js:32:33
     return res.json({ token });
   } catch (error) {
     console.log("student.login.controller.js => ", error);
-    return res.status(500).json({ msg: "Internal Server Error!" });
+    return res.status(500).json({});
   }
 }
