[NoCoverage] StringLiteral
controllers/Student/student-data-for-admin.controller.js:8:95
 const StudentDataYearBranchWise = async (req, res) => {
   try {
     // first year 
-    const firstYearComputer = await User.find({ role: "student", "studentProfile.department": "Computer", "studentProfile.year": 1 });
+    const firstYearComputer = await User.find({ role: "student", "studentProfile.department": "", "studentProfile.year": 1 });
     const firstYearCivil = await User.find({ role: "student", "studentProfile.department": "Civil", "studentProfile.year": 1 });
     const firstYearECS = await User.find({ role: "student", "studentProfile.department": "ECS", "studentProfile.year": 1 });

[NoCoverage] ObjectLiteral
controllers/Student/student-data-for-admin.controller.js:8:47
 const StudentDataYearBranchWise = async (req, res) => {
   try {
     // first year 
-    const firstYearComputer = await User.find({ role: "student", "studentProfile.department": "Computer", "studentProfile.year": 1 });
+    const firstYearComputer = await User.find({});
     const firstYearCivil = await User.find({ role: "student", "studentProfile.department": "Civil", "studentProfile.year": 1 });
     const firstYearECS = await User.find({ role: "student", "studentProfile.department": "ECS", "studentProfile.year": 1 });

[NoCoverage] StringLiteral
controllers/Student/student-data-for-admin.controller.js:9:92
   try {
     // first year 
     const firstYearComputer = await User.find({ role: "student", "studentProfile.department": "Computer", "studentProfile.year": 1 });
-    const firstYearCivil = await User.find({ role: "student", "studentProfile.department": "Civil", "studentProfile.year": 1 });
+    const firstYearCivil = await User.find({ role: "student", "studentProfile.department": "", "studentProfile.year": 1 });
     const firstYearECS = await User.find({ role: "student", "studentProfile.department": "ECS", "studentProfile.year": 1 });
     const firstYearAIDS = await User.find({ role: "student", "studentProfile.department": "AIDS", "studentProfile.year": 1 });

[NoCoverage] StringLiteral
controllers/Student/student-data-for-admin.controller.js:10:90
     // first year 
     const firstYearComputer = await User.find({ role: "student", "studentProfile.department": "Computer", "studentProfile.year": 1 });
     const firstYearCivil = await User.find({ role: "student", "studentProfile.department": "Civil", "studentProfile.year": 1 });
-    const firstYearECS = await User.find({ role: "student", "studentProfile.department": "ECS", "studentProfile.year": 1 });
+    const firstYearECS = await User.find({ role: "student", "studentProfile.department": "", "studentProfile.year": 1 });
     const firstYearAIDS = await User.find({ role: "student", "studentProfile.department": "AIDS", "studentProfile.year": 1 });
     const firstYearMechanical = await User.find({ role: "student", "studentProfile.department": "Mechanical", "studentProfile.year": 1 });

[NoCoverage] ObjectLiteral
controllers/Student/student-data-for-admin.controller.js:10:42
     // first year 
     const firstYearComputer = await User.find({ role: "student", "studentProfile.department": "Computer", "studentProfile.year": 1 });
     const firstYearCivil = await User.find({ role: "student", "studentProfile.department": "Civil", "studentProfile.year": 1 });
-    const firstYearECS = await User.find({ role: "student", "studentProfile.department": "ECS", "studentProfile.year": 1 });
+    const firstYearECS = await User.find({});
     const firstYearAIDS = await User.find({ role: "student", "studentProfile.department": "AIDS", "studentProfile.year": 1 });
     const firstYearMechanical = await User.find({ role: "student", "studentProfile.department": "Mechanical", "studentProfile.year": 1 });

[NoCoverage] StringLiteral
controllers/Student/student-data-for-admin.controller.js:11:51
     const firstYearComputer = await User.find({ role: "student", "studentProfile.department": "Computer", "studentProfile.year": 1 });
     const firstYearCivil = await User.find({ role: "student", "studentProfile.department": "Civil", "studentProfile.year": 1 });
     const firstYearECS = await User.find({ role: "student", "studentProfile.department": "ECS", "studentProfile.year": 1 });
-    const firstYearAIDS = await User.find({ role: "student", "studentProfile.department": "AIDS", "studentProfile.year": 1 });
+    const firstYearAIDS = await User.find({ role: "", "studentProfile.department": "AIDS", "studentProfile.year": 1 });
     const firstYearMechanical = await User.find({ role: "student", "studentProfile.department": "Mechanical", "studentProfile.year": 1 });
 

[NoCoverage] StringLiteral
controllers/Student/student-data-for-admin.controller.js:15:96
     const firstYearMechanical = await User.find({ role: "student", "studentProfile.department": "Mechanical", "studentProfile.year": 1 });
 
     // second year 
-    const secondYearComputer = await User.find({ role: "student", "studentProfile.department": "Computer", "studentProfile.year": 2 });
+    const secondYearComputer = await User.find({ role: "student", "studentProfile.department": "", "studentProfile.year": 2 });
     const secondYearCivil = await User.find({ role: "student", "studentProfile.department": "Civil", "studentProfile.year": 2 });
     const secondYearECS = await User.find({ role: "student", "studentProfile.department": "ECS", "studentProfile.year": 2 });

[NoCoverage] ObjectLiteral
controllers/Student/student-data-for-admin.controller.js:17:43
     // second year 
     const secondYearComputer = await User.find({ role: "student", "studentProfile.department": "Computer", "studentProfile.year": 2 });
     const secondYearCivil = await User.find({ role: "student", "studentProfile.department": "Civil", "studentProfile.year": 2 });
-    const secondYearECS = await User.find({ role: "student", "studentProfile.department": "ECS", "studentProfile.year": 2 });
+    const secondYearECS = await User.find({});
     const secondYearAIDS = await User.find({ role: "student", "studentProfile.department": "AIDS", "studentProfile.year": 2 });
     const secondYearMechanical = await User.find({ role: "student", "studentProfile.department": "Mechanical", "studentProfile.year": 2 });

[NoCoverage] StringLiteral
controllers/Student/student-data-for-admin.controller.js:18:92
     const secondYearComputer = await User.find({ role: "student", "studentProfile.department": "Computer", "studentProfile.year": 2 });
     const secondYearCivil = await User.find({ role: "student", "studentProfile.department": "Civil", "studentProfile.year": 2 });
     const secondYearECS = await User.find({ role: "student", "studentProfile.department": "ECS", "studentProfile.year": 2 });
-    const secondYearAIDS = await User.find({ role: "student", "studentProfile.department": "AIDS", "studentProfile.year": 2 });
+    const secondYearAIDS = await User.find({ role: "student", "studentProfile.department": "", "studentProfile.year": 2 });
     const secondYearMechanical = await User.find({ role: "student", "studentProfile.department": "Mechanical", "studentProfile.year": 2 });
 

[NoCoverage] StringLiteral
controllers/Student/student-data-for-admin.controller.js:19:98
     const secondYearCivil = await User.find({ role: "student", "studentProfile.department": "Civil", "studentProfile.year": 2 });
     const secondYearECS = await User.find({ role: "student", "studentProfile.department": "ECS", "studentProfile.year": 2 });
     const secondYearAIDS = await User.find({ role: "student", "studentProfile.department": "AIDS", "studentProfile.year": 2 });
-    const secondYearMechanical = await User.find({ role: "student", "studentProfile.department": "Mechanical", "studentProfile.year": 2 });
+    const secondYearMechanical = await User.find({ role: "student", "studentProfile.department": "", "studentProfile.year": 2 });
 
     // third year 

[NoCoverage] ObjectLiteral
controllers/Student/student-data-for-admin.controller.js:19:50
     const secondYearCivil = await User.find({ role: "student", "studentProfile.department": "Civil", "studentProfile.year": 2 });
     const secondYearECS = await User.find({ role: "student", "studentProfile.department": "ECS", "studentProfile.year": 2 });
     const secondYearAIDS = await User.find({ role: "student", "studentProfile.department": "AIDS", "studentProfile.year": 2 });
-    const secondYearMechanical = await User.find({ role: "student", "studentProfile.department": "Mechanical", "studentProfile.year": 2 });
+    const secondYearMechanical = await User.find({});
 
     // third year 

[NoCoverage] ObjectLiteral
controllers/Student/student-data-for-admin.controller.js:24:42
     // third year 
     const thirdYearComputer = await User.find({ role: "student", "studentProfile.department": "Computer", "studentProfile.year": 3 });
     const thirdYearCivil = await User.find({ role: "student", "studentProfile.department": "Civil", "studentProfile.year": 3 });
-    const thirdYearECS = await User.find({ role: "student", "studentProfile.department": "ECS", "studentProfile.year": 3 });
+    const thirdYearECS = await User.find({});
     const thirdYearAIDS = await User.find({ role: "student", "studentProfile.department": "AIDS", "studentProfile.year": 3 });
     const thirdYearMechanical = await User.find({ role: "student", "studentProfile.department": "Mechanical", "studentProfile.year": 3 });

[NoCoverage] StringLiteral
controllers/Student/student-data-for-admin.controller.js:24:50
     // third year 
     const thirdYearComputer = await User.find({ role: "student", "studentProfile.department": "Computer", "studentProfile.year": 3 });
     const thirdYearCivil = await User.find({ role: "student", "studentProfile.department": "Civil", "studentProfile.year": 3 });
-    const thirdYearECS = await User.find({ role: "student", "studentProfile.department": "ECS", "studentProfile.year": 3 });
+    const thirdYearECS = await User.find({ role: "", "studentProfile.department": "ECS", "studentProfile.year": 3 });
     const thirdYearAIDS = await User.find({ role: "student", "studentProfile.department": "AIDS", "studentProfile.year": 3 });
     const thirdYearMechanical = await User.find({ role: "student", "studentProfile.department": "Mechanical", "studentProfile.year": 3 });

[NoCoverage] StringLiteral
controllers/Student/student-data-for-admin.controller.js:26:97
     const thirdYearCivil = await User.find({ role: "student", "studentProfile.department": "Civil", "studentProfile.year": 3 });
     const thirdYearECS = await User.find({ role: "student", "studentProfile.department": "ECS", "studentProfile.year": 3 });
     const thirdYearAIDS = await User.find({ role: "student", "studentProfile.department": "AIDS", "studentProfile.year": 3 });
-    const thirdYearMechanical = await User.find({ role: "student", "studentProfile.department": "Mechanical", "studentProfile.year": 3 });
+    const thirdYearMechanical = await User.find({ role: "student", "studentProfile.department": "", "studentProfile.year": 3 });
 
     // fourth year 

[NoCoverage] StringLiteral
controllers/Student/student-data-for-admin.controller.js:31:51
     // fourth year 
     const fourthYearComputer = await User.find({ role: "student", "studentProfile.department": "Computer", "studentProfile.year": 4 });
     const fourthYearCivil = await User.find({ role: "student", "studentProfile.department": "Civil", "studentProfile.year": 4 });
-    const fourthYearECS = await User.find({ role: "student", "studentProfile.department": "ECS", "studentProfile.year": 4 });
+    const fourthYearECS = await User.find({ role: "", "studentProfile.department": "ECS", "studentProfile.year": 4 });
     const fourthYearAIDS = await User.find({ role: "student", "studentProfile.department": "AIDS", "studentProfile.year": 4 });
     const fourthYearMechanical = await User.find({ role: "student", "studentProfile.department": "Mechanical", "studentProfile.year": 4 });

[NoCoverage] StringLiteral
controllers/Student/student-data-for-admin.controller.js:32:52
     const fourthYearComputer = await User.find({ role: "student", "studentProfile.department": "Computer", "studentProfile.year": 4 });
     const fourthYearCivil = await User.find({ role: "student", "studentProfile.department": "Civil", "studentProfile.year": 4 });
     const fourthYearECS = await User.find({ role: "student", "studentProfile.department": "ECS", "studentProfile.year": 4 });
-    const fourthYearAIDS = await User.find({ role: "student", "studentProfile.department": "AIDS", "studentProfile.year": 4 });
+    const fourthYearAIDS = await User.find({ role: "", "studentProfile.department": "AIDS", "studentProfile.year": 4 });
     const fourthYearMechanical = await User.find({ role: "student", "studentProfile.department": "Mechanical", "studentProfile.year": 4 });
 

[NoCoverage] BlockStatement
controllers/Student/student-data-for-admin.controller.js:36:19
     const fourthYearMechanical = await User.find({ role: "student", "studentProfile.department": "Mechanical", "studentProfile.year": 4 });
 
-  } catch (error) {
-    console.log("student-data-for-admin.controller.js => ", error);
-    return res.status(500).json({ msg: "Internal Server Error!" });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] ArrayDeclaration
controllers/Student/student-data-for-admin.controller.js:46:51
   try {
     const filteredStudents = await User.find({
       role: 'student',
-      'studentProfile.appliedJobs.status': { $in: ['interview', 'hired'] }
+      'studentProfile.appliedJobs.status': { $in: [] }
     })
       .select('_id first_name last_name studentProfile.year studentProfile.department studentProfile.appliedJobs')

[NoCoverage] StringLiteral
controllers/Student/student-data-for-admin.controller.js:46:65
   try {
     const filteredStudents = await User.find({
       role: 'student',
-      'studentProfile.appliedJobs.status': { $in: ['interview', 'hired'] }
+      'studentProfile.appliedJobs.status': { $in: ['interview', ""] }
     })
       .select('_id first_name last_name studentProfile.year studentProfile.department studentProfile.appliedJobs')

[NoCoverage] MethodExpression
controllers/Student/student-data-for-admin.controller.js:55:27
 
     for (const student of filteredStudents) {
       // Filter applied jobs with status 'interview' or 'hired'
-      const appliedJobs = student.studentProfile.appliedJobs.filter(job => ['interview', 'hired'].includes(job.status));
+      const appliedJobs = student.studentProfile.appliedJobs;
 
       // Fetch job details for each jobId in the applied jobs

[NoCoverage] ArrowFunction
controllers/Student/student-data-for-admin.controller.js:55:69
 
     for (const student of filteredStudents) {
       // Filter applied jobs with status 'interview' or 'hired'
-      const appliedJobs = student.studentProfile.appliedJobs.filter(job => ['interview', 'hired'].includes(job.status));
+      const appliedJobs = student.studentProfile.appliedJobs.filter(() => undefined);
 
       // Fetch job details for each jobId in the applied jobs

[NoCoverage] ObjectLiteral
controllers/Student/student-data-for-admin.controller.js:58:41
       const appliedJobs = student.studentProfile.appliedJobs.filter(job => ['interview', 'hired'].includes(job.status));
 
       // Fetch job details for each jobId in the applied jobs
-      const jobDetails = await Job.find({
-        _id: { $in: appliedJobs.map(job => job.jobId) } // Match the job IDs
-      })
+      const jobDetails = await Job.find({})
         .populate('company', 'companyName')
         .select('company jobTitle _id') // Select company name and job title

[NoCoverage] ArrowFunction
controllers/Student/student-data-for-admin.controller.js:59:37
 
       // Fetch job details for each jobId in the applied jobs
       const jobDetails = await Job.find({
-        _id: { $in: appliedJobs.map(job => job.jobId) } // Match the job IDs
+        _id: { $in: appliedJobs.map(() => undefined) } // Match the job IDs
       })
         .populate('company', 'companyName')

[NoCoverage] StringLiteral
controllers/Student/student-data-for-admin.controller.js:61:19
       const jobDetails = await Job.find({
         _id: { $in: appliedJobs.map(job => job.jobId) } // Match the job IDs
       })
-        .populate('company', 'companyName')
+        .populate("", 'companyName')
         .select('company jobTitle _id') // Select company name and job title
         .lean();

[NoCoverage] StringLiteral
controllers/Student/student-data-for-admin.controller.js:61:30
       const jobDetails = await Job.find({
         _id: { $in: appliedJobs.map(job => job.jobId) } // Match the job IDs
       })
-        .populate('company', 'companyName')
+        .populate('company', "")
         .select('company jobTitle _id') // Select company name and job title
         .lean();

[NoCoverage] BlockStatement
controllers/Student/student-data-for-admin.controller.js:66:54
         .lean();
 
       // Map through filtered applied jobs and add the job details (company and title)
-      const jobsWithDetails = appliedJobs.map(job => {
-        const jobDetail = jobDetails.find(jd => String(jd._id) === String(job.jobId)); // Match jobId
-        return {
-          status: job.status,
-          companyName: jobDetail?.company?.companyName || 'Unknown Company',
-          jobId: jobDetail?._id || 'Unknown JobId',
-          jobTitle: jobDetail?.jobTitle || 'Unknown Job Title'
-        };
-      });
+      const jobsWithDetails = appliedJobs.map(job => {});
 
       // Push the student info along with only the filtered job details into the final array

[NoCoverage] ArrowFunction
controllers/Student/student-data-for-admin.controller.js:67:43
 
       // Map through filtered applied jobs and add the job details (company and title)
       const jobsWithDetails = appliedJobs.map(job => {
-        const jobDetail = jobDetails.find(jd => String(jd._id) === String(job.jobId)); // Match jobId
+        const jobDetail = jobDetails.find(() => undefined); // Match jobId
         return {
           status: job.status,

[NoCoverage] EqualityOperator
controllers/Student/student-data-for-admin.controller.js:67:49
 
       // Map through filtered applied jobs and add the job details (company and title)
       const jobsWithDetails = appliedJobs.map(job => {
-        const jobDetail = jobDetails.find(jd => String(jd._id) === String(job.jobId)); // Match jobId
+        const jobDetail = jobDetails.find(jd => String(jd._id) !== String(job.jobId)); // Match jobId
         return {
           status: job.status,

[NoCoverage] OptionalChaining
controllers/Student/student-data-for-admin.controller.js:70:24
         const jobDetail = jobDetails.find(jd => String(jd._id) === String(job.jobId)); // Match jobId
         return {
           status: job.status,
-          companyName: jobDetail?.company?.companyName || 'Unknown Company',
+          companyName: jobDetail?.company.companyName || 'Unknown Company',
           jobId: jobDetail?._id || 'Unknown JobId',
           jobTitle: jobDetail?.jobTitle || 'Unknown Job Title'

[NoCoverage] ConditionalExpression
controllers/Student/student-data-for-admin.controller.js:70:24
         const jobDetail = jobDetails.find(jd => String(jd._id) === String(job.jobId)); // Match jobId
         return {
           status: job.status,
-          companyName: jobDetail?.company?.companyName || 'Unknown Company',
+          companyName: false,
           jobId: jobDetail?._id || 'Unknown JobId',
           jobTitle: jobDetail?.jobTitle || 'Unknown Job Title'

[NoCoverage] LogicalOperator
controllers/Student/student-data-for-admin.controller.js:71:18
         return {
           status: job.status,
           companyName: jobDetail?.company?.companyName || 'Unknown Company',
-          jobId: jobDetail?._id || 'Unknown JobId',
+          jobId: jobDetail?._id && 'Unknown JobId',
           jobTitle: jobDetail?.jobTitle || 'Unknown Job Title'
         };

[NoCoverage] OptionalChaining
controllers/Student/student-data-for-admin.controller.js:71:18
         return {
           status: job.status,
           companyName: jobDetail?.company?.companyName || 'Unknown Company',
-          jobId: jobDetail?._id || 'Unknown JobId',
+          jobId: jobDetail._id || 'Unknown JobId',
           jobTitle: jobDetail?.jobTitle || 'Unknown Job Title'
         };

[NoCoverage] ConditionalExpression
controllers/Student/student-data-for-admin.controller.js:72:21
           status: job.status,
           companyName: jobDetail?.company?.companyName || 'Unknown Company',
           jobId: jobDetail?._id || 'Unknown JobId',
-          jobTitle: jobDetail?.jobTitle || 'Unknown Job Title'
+          jobTitle: true
         };
       });

[NoCoverage] LogicalOperator
controllers/Student/student-data-for-admin.controller.js:72:21
           status: job.status,
           companyName: jobDetail?.company?.companyName || 'Unknown Company',
           jobId: jobDetail?._id || 'Unknown JobId',
-          jobTitle: jobDetail?.jobTitle || 'Unknown Job Title'
+          jobTitle: jobDetail?.jobTitle && 'Unknown Job Title'
         };
       });

[NoCoverage] ObjectLiteral
controllers/Student/student-data-for-admin.controller.js:77:35
       });
 
       // Push the student info along with only the filtered job details into the final array
-      studentsWithJobDetails.push({
-        _id: student._id,
-        name: `${student.first_name} ${student.last_name}`,
-        year: student.studentProfile.year,
-        department: student.studentProfile.department,
-        jobs: jobsWithDetails // Only the filtered jobs with status 'interview' or 'hired'
-      });
+      studentsWithJobDetails.push({});
     }
 

[NoCoverage] ObjectLiteral
controllers/Student/student-data-for-admin.controller.js:86:33
       });
     }
 
-    return res.status(200).json({ studentsWithJobDetails });
+    return res.status(200).json({});
   } catch (error) {
     console.log("student-data-for-admin.controller.js => ", error);

[NoCoverage] BlockStatement
controllers/Student/student-data-for-admin.controller.js:87:19
     }
 
     return res.status(200).json({ studentsWithJobDetails });
-  } catch (error) {
-    console.log("student-data-for-admin.controller.js => ", error);
-    return res.status(500).json({ msg: "Internal Server Error!" });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
controllers/Student/student-data-for-admin.controller.js:88:17
 
     return res.status(200).json({ studentsWithJobDetails });
   } catch (error) {
-    console.log("student-data-for-admin.controller.js => ", error);
+    console.log("", error);
     return res.status(500).json({ msg: "Internal Server Error!" });
   }

[NoCoverage] ObjectLiteral
controllers/Student/student-data-for-admin.controller.js:89:33
     return res.status(200).json({ studentsWithJobDetails });
   } catch (error) {
     console.log("student-data-for-admin.controller.js => ", error);
-    return res.status(500).json({ msg: "Internal Server Error!" });
+    return res.status(500).json({});
   }
 }
