[NoCoverage] BlockStatement
controllers/Management/delete-tpo.controller.js:3:39
 const Users = require('../../models/user.model');
 
-const DeleteTPO = async (req, res) => {
-  // const user = await Users.find({email: req.body.email});
-  const ress = await Users.deleteOne({ email: req.body.email });
-  if (ress.acknowledged) {
-    return res.json({ msg: "User Deleted Successfully!" });
-  } else {
-    return res.json({ msg: "Error While Deleting User!" });
-  }
-}
+const DeleteTPO = async (req, res) => {}
 
 module.exports = DeleteTPO;

[NoCoverage] ObjectLiteral
controllers/Management/delete-tpo.controller.js:5:38
 
 const DeleteTPO = async (req, res) => {
   // const user = await Users.find({email: req.body.email});
-  const ress = await Users.deleteOne({ email: req.body.email });
+  const ress = await Users.deleteOne({});
   if (ress.acknowledged) {
     return res.json({ msg: "User Deleted Successfully!" });

[NoCoverage] ConditionalExpression
controllers/Management/delete-tpo.controller.js:6:7
 const DeleteTPO = async (req, res) => {
   // const user = await Users.find({email: req.body.email});
   const ress = await Users.deleteOne({ email: req.body.email });
-  if (ress.acknowledged) {
+  if (false) {
     return res.json({ msg: "User Deleted Successfully!" });
   } else {

[NoCoverage] ConditionalExpression
controllers/Management/delete-tpo.controller.js:6:7
 const DeleteTPO = async (req, res) => {
   // const user = await Users.find({email: req.body.email});
   const ress = await Users.deleteOne({ email: req.body.email });
-  if (ress.acknowledged) {
+  if (true) {
     return res.json({ msg: "User Deleted Successfully!" });
   } else {

[NoCoverage] ObjectLiteral
controllers/Management/delete-tpo.controller.js:7:21
   // const user = await Users.find({email: req.body.email});
   const ress = await Users.deleteOne({ email: req.body.email });
   if (ress.acknowledged) {
-    return res.json({ msg: "User Deleted Successfully!" });
+    return res.json({});
   } else {
     return res.json({ msg: "Error While Deleting User!" });

[NoCoverage] BlockStatement
controllers/Management/delete-tpo.controller.js:8:10
   const ress = await Users.deleteOne({ email: req.body.email });
   if (ress.acknowledged) {
     return res.json({ msg: "User Deleted Successfully!" });
-  } else {
-    return res.json({ msg: "Error While Deleting User!" });
-  }
+  } else {}
 }
 

[NoCoverage] StringLiteral
controllers/Management/delete-tpo.controller.js:9:28
   if (ress.acknowledged) {
     return res.json({ msg: "User Deleted Successfully!" });
   } else {
-    return res.json({ msg: "Error While Deleting User!" });
+    return res.json({ msg: "" });
   }
 }

[NoCoverage] ObjectLiteral
controllers/Management/delete-tpo.controller.js:9:21
   if (ress.acknowledged) {
     return res.json({ msg: "User Deleted Successfully!" });
   } else {
-    return res.json({ msg: "Error While Deleting User!" });
+    return res.json({});
   }
 }
