[NoCoverage] BlockStatement
controllers/Management/notice.controller.js:4:40
 const mongoose = require('mongoose');
 const Notice = require('../../models/notice.model');
 
-const SendNotice = async (req, res) => {
-  try {
-    if (!req.body.receiver_role) var receiver_role = "student";
-    else var receiver_role = req.body.receiver_role;
-
-    const sender_role = req.body.sender_role;
-    const title = req.body.title;
-    const message = req.body.message;
-    const sender = new mongoose.Types.ObjectId(req.body.sender);
-
-    await Notice.create({ sender, sender_role, receiver_role, title, message });
-    return res.json({ msg: "Notice Sended Successfully!" });
-  } catch (error) {
-    console.log('error in notice.controller.js => ', error);
-    return res.json({ msg: "Internal Server Error!" });
-  }
-}
+const SendNotice = async (req, res) => {}
 
 const GetAllNotice = async (req, res) => {

[NoCoverage] BlockStatement
controllers/Management/notice.controller.js:5:7
 const Notice = require('../../models/notice.model');
 
 const SendNotice = async (req, res) => {
-  try {
-    if (!req.body.receiver_role) var receiver_role = "student";
-    else var receiver_role = req.body.receiver_role;
-
-    const sender_role = req.body.sender_role;
-    const title = req.body.title;
-    const message = req.body.message;
-    const sender = new mongoose.Types.ObjectId(req.body.sender);
-
-    await Notice.create({ sender, sender_role, receiver_role, title, message });
-    return res.json({ msg: "Notice Sended Successfully!" });
-  } catch (error) {
+  try {} catch (error) {
     console.log('error in notice.controller.js => ', error);
     return res.json({ msg: "Internal Server Error!" });

[NoCoverage] ConditionalExpression
controllers/Management/notice.controller.js:6:9
 
 const SendNotice = async (req, res) => {
   try {
-    if (!req.body.receiver_role) var receiver_role = "student";
+    if (false) var receiver_role = "student";
     else var receiver_role = req.body.receiver_role;
 

[NoCoverage] BooleanLiteral
controllers/Management/notice.controller.js:6:9
 
 const SendNotice = async (req, res) => {
   try {
-    if (!req.body.receiver_role) var receiver_role = "student";
+    if (req.body.receiver_role) var receiver_role = "student";
     else var receiver_role = req.body.receiver_role;
 

[NoCoverage] StringLiteral
controllers/Management/notice.controller.js:15:28
     const sender = new mongoose.Types.ObjectId(req.body.sender);
 
     await Notice.create({ sender, sender_role, receiver_role, title, message });
-    return res.json({ msg: "Notice Sended Successfully!" });
+    return res.json({ msg: "" });
   } catch (error) {
     console.log('error in notice.controller.js => ', error);

[NoCoverage] BlockStatement
controllers/Management/notice.controller.js:16:19
 
     await Notice.create({ sender, sender_role, receiver_role, title, message });
     return res.json({ msg: "Notice Sended Successfully!" });
-  } catch (error) {
-    console.log('error in notice.controller.js => ', error);
-    return res.json({ msg: "Internal Server Error!" });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
controllers/Management/notice.controller.js:18:28
     return res.json({ msg: "Notice Sended Successfully!" });
   } catch (error) {
     console.log('error in notice.controller.js => ', error);
-    return res.json({ msg: "Internal Server Error!" });
+    return res.json({ msg: "" });
   }
 }

[NoCoverage] BlockStatement
controllers/Management/notice.controller.js:22:42
   }
 }
 
-const GetAllNotice = async (req, res) => {
-  try {
-    const notices = await Notice.find();
-    return res.json(notices);
-  } catch (error) {
-    console.log('error in notice.controller.js => ', error);
-    return res.json({ msg: "Internal Server Error!" });
-  }
-}
+const GetAllNotice = async (req, res) => {}
 
 const GetNotice = async (req, res) => {

[NoCoverage] BlockStatement
controllers/Management/notice.controller.js:23:7
 }
 
 const GetAllNotice = async (req, res) => {
-  try {
-    const notices = await Notice.find();
-    return res.json(notices);
-  } catch (error) {
+  try {} catch (error) {
     console.log('error in notice.controller.js => ', error);
     return res.json({ msg: "Internal Server Error!" });

[NoCoverage] BlockStatement
controllers/Management/notice.controller.js:26:19
   try {
     const notices = await Notice.find();
     return res.json(notices);
-  } catch (error) {
-    console.log('error in notice.controller.js => ', error);
-    return res.json({ msg: "Internal Server Error!" });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
controllers/Management/notice.controller.js:32:39
   }
 }
 
-const GetNotice = async (req, res) => {
-  try {
-    // console.log(req.query.noticeId)
-    const notice = await Notice.findById(req.query.noticeId);
-    // console.log(notice)
-    return res.json(notice);
-  } catch (error) {
-    console.log('error in notice.controller.js => ', error);
-    return res.json({ msg: "Internal Server Error!" });
-  }
-}
+const GetNotice = async (req, res) => {}
 
 const DeleteNotice = async (req, res) => {

[NoCoverage] BlockStatement
controllers/Management/notice.controller.js:33:7
 }
 
 const GetNotice = async (req, res) => {
-  try {
-    // console.log(req.query.noticeId)
-    const notice = await Notice.findById(req.query.noticeId);
-    // console.log(notice)
-    return res.json(notice);
-  } catch (error) {
+  try {} catch (error) {
     console.log('error in notice.controller.js => ', error);
     return res.json({ msg: "Internal Server Error!" });

[NoCoverage] BlockStatement
controllers/Management/notice.controller.js:38:19
     const notice = await Notice.findById(req.query.noticeId);
     // console.log(notice)
     return res.json(notice);
-  } catch (error) {
-    console.log('error in notice.controller.js => ', error);
-    return res.json({ msg: "Internal Server Error!" });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] ObjectLiteral
controllers/Management/notice.controller.js:40:21
     return res.json(notice);
   } catch (error) {
     console.log('error in notice.controller.js => ', error);
-    return res.json({ msg: "Internal Server Error!" });
+    return res.json({});
   }
 }

[NoCoverage] BlockStatement
controllers/Management/notice.controller.js:44:42
   }
 }
 
-const DeleteNotice = async (req, res) => {
-  try {
-    if (!req.query.noticeId) return res.json({ msg: "Error while deleting notice!" });
-    await Notice.findByIdAndDelete(req?.query?.noticeId);
-    return res.json({ msg: "Notice Deleted Successfully!" });
-  } catch (error) {
-    console.log('error in notice.controller.js => ', error);
-    return res.json({ msg: "Internal Server Error!" });
-  }
-}
+const DeleteNotice = async (req, res) => {}
 
 module.exports = {

[NoCoverage] BlockStatement
controllers/Management/notice.controller.js:45:7
 }
 
 const DeleteNotice = async (req, res) => {
-  try {
-    if (!req.query.noticeId) return res.json({ msg: "Error while deleting notice!" });
-    await Notice.findByIdAndDelete(req?.query?.noticeId);
-    return res.json({ msg: "Notice Deleted Successfully!" });
-  } catch (error) {
+  try {} catch (error) {
     console.log('error in notice.controller.js => ', error);
     return res.json({ msg: "Internal Server Error!" });

[NoCoverage] BooleanLiteral
controllers/Management/notice.controller.js:46:9
 
 const DeleteNotice = async (req, res) => {
   try {
-    if (!req.query.noticeId) return res.json({ msg: "Error while deleting notice!" });
+    if (req.query.noticeId) return res.json({ msg: "Error while deleting notice!" });
     await Notice.findByIdAndDelete(req?.query?.noticeId);
     return res.json({ msg: "Notice Deleted Successfully!" });

[NoCoverage] ConditionalExpression
controllers/Management/notice.controller.js:46:9
 
 const DeleteNotice = async (req, res) => {
   try {
-    if (!req.query.noticeId) return res.json({ msg: "Error while deleting notice!" });
+    if (true) return res.json({ msg: "Error while deleting notice!" });
     await Notice.findByIdAndDelete(req?.query?.noticeId);
     return res.json({ msg: "Notice Deleted Successfully!" });

[NoCoverage] OptionalChaining
controllers/Management/notice.controller.js:47:36
 const DeleteNotice = async (req, res) => {
   try {
     if (!req.query.noticeId) return res.json({ msg: "Error while deleting notice!" });
-    await Notice.findByIdAndDelete(req?.query?.noticeId);
+    await Notice.findByIdAndDelete(req.query?.noticeId);
     return res.json({ msg: "Notice Deleted Successfully!" });
   } catch (error) {

[NoCoverage] OptionalChaining
controllers/Management/notice.controller.js:47:36
 const DeleteNotice = async (req, res) => {
   try {
     if (!req.query.noticeId) return res.json({ msg: "Error while deleting notice!" });
-    await Notice.findByIdAndDelete(req?.query?.noticeId);
+    await Notice.findByIdAndDelete(req?.query.noticeId);
     return res.json({ msg: "Notice Deleted Successfully!" });
   } catch (error) {

[NoCoverage] ObjectLiteral
controllers/Management/notice.controller.js:48:21
   try {
     if (!req.query.noticeId) return res.json({ msg: "Error while deleting notice!" });
     await Notice.findByIdAndDelete(req?.query?.noticeId);
-    return res.json({ msg: "Notice Deleted Successfully!" });
+    return res.json({});
   } catch (error) {
     console.log('error in notice.controller.js => ', error);

[NoCoverage] BlockStatement
controllers/Management/notice.controller.js:49:19
     if (!req.query.noticeId) return res.json({ msg: "Error while deleting notice!" });
     await Notice.findByIdAndDelete(req?.query?.noticeId);
     return res.json({ msg: "Notice Deleted Successfully!" });
-  } catch (error) {
-    console.log('error in notice.controller.js => ', error);
-    return res.json({ msg: "Internal Server Error!" });
-  }
+  } catch (error) {}
 }
 
