[NoCoverage] BlockStatement
controllers/SuperUser/login.controller.js:8:7
 const Login = async (req, res) => {
   const { email, password } = req.body;
 
-  try {
-    const user = await StudentUser.findOne({ email });
-    if (!user)
-      return res.status(400).json({ msg: "User Doesn't Exist!" });
-
-    const isMatch = await bcrypt.compare(password, user.password);
-    
-    
-    if (!isMatch || user.role !== "superuser")
-      return res.status(400).json({ msg: 'Credentials Not Matched!' });
-
-    const payload = { userId: user.id };
-    const token = jwt.sign(payload, process.env.JWT_SECRET, { expiresIn: '1h' });
-
-    user.token = token;
-    await user.save();
-
-    return res.json({ token });
-  } catch (error) {
+  try {} catch (error) {
     console.log("admin.login.js => ", error);
     return res.status(500).json({ msg: "Internal Server Error!" });

[NoCoverage] ConditionalExpression
controllers/SuperUser/login.controller.js:10:9
 
   try {
     const user = await StudentUser.findOne({ email });
-    if (!user)
+    if (false)
       return res.status(400).json({ msg: "User Doesn't Exist!" });
 

[NoCoverage] ConditionalExpression
controllers/SuperUser/login.controller.js:16:9
     const isMatch = await bcrypt.compare(password, user.password);
     
     
-    if (!isMatch || user.role !== "superuser")
+    if (true)
       return res.status(400).json({ msg: 'Credentials Not Matched!' });
 

[NoCoverage] BooleanLiteral
controllers/SuperUser/login.controller.js:16:9
     const isMatch = await bcrypt.compare(password, user.password);
     
     
-    if (!isMatch || user.role !== "superuser")
+    if (isMatch || user.role !== "superuser")
       return res.status(400).json({ msg: 'Credentials Not Matched!' });
 

[NoCoverage] ObjectLiteral
controllers/SuperUser/login.controller.js:25:21
     user.token = token;
     await user.save();
 
-    return res.json({ token });
+    return res.json({});
   } catch (error) {
     console.log("admin.login.js => ", error);

[NoCoverage] BlockStatement
controllers/SuperUser/login.controller.js:26:19
     await user.save();
 
     return res.json({ token });
-  } catch (error) {
-    console.log("admin.login.js => ", error);
-    return res.status(500).json({ msg: "Internal Server Error!" });
-  }
+  } catch (error) {}
 }
 
