[NoCoverage] BlockStatement
controllers/Management/tpo-users.controller.js:3:38
 const Users = require('../../models/user.model');
 
-const UsersTPO = async (req, res) => {
-  const tpoUsers = await Users.find({ role: "tpo_admin" });
-  return res.json({ tpoUsers })
-}
+const UsersTPO = async (req, res) => {}
 
 module.exports = UsersTPO;

[NoCoverage] ObjectLiteral
controllers/Management/tpo-users.controller.js:4:37
 const Users = require('../../models/user.model');
 
 const UsersTPO = async (req, res) => {
-  const tpoUsers = await Users.find({ role: "tpo_admin" });
+  const tpoUsers = await Users.find({});
   return res.json({ tpoUsers })
 }

[NoCoverage] ObjectLiteral
controllers/Management/tpo-users.controller.js:5:19
 
 const UsersTPO = async (req, res) => {
   const tpoUsers = await Users.find({ role: "tpo_admin" });
-  return res.json({ tpoUsers })
+  return res.json({})
 }
 
