[NoCoverage] BlockStatement
controllers/TPO/tpo.login.controller.js:6:35
 const jwt = require('jsonwebtoken');
 
 
-const Login = async (req, res) => {
-  const { email, password } = req.body;
-
-  try {
-    const user = await User.findOne({ email });
-    if (!user)
-      return res.status(400).json({ msg: "User Doesn't Exist!" });
-
-    const isMatch = await bcrypt.compare(password, user.password);
-    if (!isMatch || user.role !== "tpo_admin")
-      return res.status(400).json({ msg: 'Credentials Not Matched!' });
-
-    const payload = { userId: user.id };
-    const token = jwt.sign(payload, process.env.JWT_SECRET, { expiresIn: '1h' });
-
-    user.token = token;
-    await user.save();
-    
-    return res.json({ token });
-  } catch (error) {
-    console.log("student.login.controller.js => ", error);
-    return res.status(500).json({ msg: "Internal Server Error!" });
-  }
-}
+const Login = async (req, res) => {}
 
 module.exports = Login;

[NoCoverage] BlockStatement
controllers/TPO/tpo.login.controller.js:9:7
 const Login = async (req, res) => {
   const { email, password } = req.body;
 
-  try {
-    const user = await User.findOne({ email });
-    if (!user)
-      return res.status(400).json({ msg: "User Doesn't Exist!" });
-
-    const isMatch = await bcrypt.compare(password, user.password);
-    if (!isMatch || user.role !== "tpo_admin")
-      return res.status(400).json({ msg: 'Credentials Not Matched!' });
-
-    const payload = { userId: user.id };
-    const token = jwt.sign(payload, process.env.JWT_SECRET, { expiresIn: '1h' });
-
-    user.token = token;
-    await user.save();
-    
-    return res.json({ token });
-  } catch (error) {
+  try {} catch (error) {
     console.log("student.login.controller.js => ", error);
     return res.status(500).json({ msg: "Internal Server Error!" });

[NoCoverage] ConditionalExpression
controllers/TPO/tpo.login.controller.js:11:9
 
   try {
     const user = await User.findOne({ email });
-    if (!user)
+    if (false)
       return res.status(400).json({ msg: "User Doesn't Exist!" });
 

[NoCoverage] BooleanLiteral
controllers/TPO/tpo.login.controller.js:15:9
       return res.status(400).json({ msg: "User Doesn't Exist!" });
 
     const isMatch = await bcrypt.compare(password, user.password);
-    if (!isMatch || user.role !== "tpo_admin")
+    if (isMatch || user.role !== "tpo_admin")
       return res.status(400).json({ msg: 'Credentials Not Matched!' });
 

[NoCoverage] LogicalOperator
controllers/TPO/tpo.login.controller.js:15:9
       return res.status(400).json({ msg: "User Doesn't Exist!" });
 
     const isMatch = await bcrypt.compare(password, user.password);
-    if (!isMatch || user.role !== "tpo_admin")
+    if (!isMatch && user.role !== "tpo_admin")
       return res.status(400).json({ msg: 'Credentials Not Matched!' });
 

[NoCoverage] ObjectLiteral
controllers/TPO/tpo.login.controller.js:16:35
 
     const isMatch = await bcrypt.compare(password, user.password);
     if (!isMatch || user.role !== "tpo_admin")
-      return res.status(400).json({ msg: 'Credentials Not Matched!' });
+      return res.status(400).json({});
 
     const payload = { userId: user.id };
