[NoCoverage] BlockStatement
controllers/Student/apply-job.controller.js:6:7
 
 
 const AppliedToJob = async (req, res) => {
-  try {
-    // console.log(req.params);
-    // if studentId is not defined return
-    if (req.params.studentId === "undefined") return;
-    if (req.params.jobId === "undefined") return;
-
-    const user = await User.findById(req.params.studentId);
-    const job = await jobSchema.findById(req.params.jobId);
-
-    // retune if already applied
-    if (user?.studentProfile?.appliedJobs?.some(job => job.jobId == req.params.jobId)) return res.json({ msg: "Already Applied!" });
-
-    if (!user?.studentProfile?.resume) return res.json({ msg: 'Please Upload Resume First, Under "Placements" > "Placement Profile"' });
-
-    user?.studentProfile?.appliedJobs?.push({ jobId: req.params.jobId, status: "applied" });
-    job?.applicants?.push({ studentId: user._id });
-    await user.save();
-    await job.save();
-
-    return res.status(201).json({ msg: "Applied Successfully!" });
-  } catch (error) {
+  try {} catch (error) {
     console.log("apply-job.controller.js => ", error);
     return res.status(500).json({ msg: "Internal Server Error!" });

[NoCoverage] EqualityOperator
controllers/Student/apply-job.controller.js:9:9
   try {
     // console.log(req.params);
     // if studentId is not defined return
-    if (req.params.studentId === "undefined") return;
+    if (req.params.studentId !== "undefined") return;
     if (req.params.jobId === "undefined") return;
 

[NoCoverage] ConditionalExpression
controllers/Student/apply-job.controller.js:9:9
   try {
     // console.log(req.params);
     // if studentId is not defined return
-    if (req.params.studentId === "undefined") return;
+    if (false) return;
     if (req.params.jobId === "undefined") return;
 

[NoCoverage] ConditionalExpression
controllers/Student/apply-job.controller.js:10:9
     // console.log(req.params);
     // if studentId is not defined return
     if (req.params.studentId === "undefined") return;
-    if (req.params.jobId === "undefined") return;
+    if (true) return;
 
     const user = await User.findById(req.params.studentId);

[NoCoverage] EqualityOperator
controllers/Student/apply-job.controller.js:10:9
     // console.log(req.params);
     // if studentId is not defined return
     if (req.params.studentId === "undefined") return;
-    if (req.params.jobId === "undefined") return;
+    if (req.params.jobId !== "undefined") return;
 
     const user = await User.findById(req.params.studentId);

[NoCoverage] OptionalChaining
controllers/Student/apply-job.controller.js:16:9
     const job = await jobSchema.findById(req.params.jobId);
 
     // retune if already applied
-    if (user?.studentProfile?.appliedJobs?.some(job => job.jobId == req.params.jobId)) return res.json({ msg: "Already Applied!" });
+    if (user?.studentProfile?.appliedJobs.some(job => job.jobId == req.params.jobId)) return res.json({ msg: "Already Applied!" });
 
     if (!user?.studentProfile?.resume) return res.json({ msg: 'Please Upload Resume First, Under "Placements" > "Placement Profile"' });

[NoCoverage] MethodExpression
controllers/Student/apply-job.controller.js:16:9
     const job = await jobSchema.findById(req.params.jobId);
 
     // retune if already applied
-    if (user?.studentProfile?.appliedJobs?.some(job => job.jobId == req.params.jobId)) return res.json({ msg: "Already Applied!" });
+    if (user?.studentProfile?.appliedJobs?.every(job => job.jobId == req.params.jobId)) return res.json({ msg: "Already Applied!" });
 
     if (!user?.studentProfile?.resume) return res.json({ msg: 'Please Upload Resume First, Under "Placements" > "Placement Profile"' });

[NoCoverage] ConditionalExpression
controllers/Student/apply-job.controller.js:18:9
     // retune if already applied
     if (user?.studentProfile?.appliedJobs?.some(job => job.jobId == req.params.jobId)) return res.json({ msg: "Already Applied!" });
 
-    if (!user?.studentProfile?.resume) return res.json({ msg: 'Please Upload Resume First, Under "Placements" > "Placement Profile"' });
+    if (false) return res.json({ msg: 'Please Upload Resume First, Under "Placements" > "Placement Profile"' });
 
     user?.studentProfile?.appliedJobs?.push({ jobId: req.params.jobId, status: "applied" });

[NoCoverage] OptionalChaining
controllers/Student/apply-job.controller.js:18:10
     // retune if already applied
     if (user?.studentProfile?.appliedJobs?.some(job => job.jobId == req.params.jobId)) return res.json({ msg: "Already Applied!" });
 
-    if (!user?.studentProfile?.resume) return res.json({ msg: 'Please Upload Resume First, Under "Placements" > "Placement Profile"' });
+    if (!user.studentProfile?.resume) return res.json({ msg: 'Please Upload Resume First, Under "Placements" > "Placement Profile"' });
 
     user?.studentProfile?.appliedJobs?.push({ jobId: req.params.jobId, status: "applied" });

[NoCoverage] OptionalChaining
controllers/Student/apply-job.controller.js:20:5
 
     if (!user?.studentProfile?.resume) return res.json({ msg: 'Please Upload Resume First, Under "Placements" > "Placement Profile"' });
 
-    user?.studentProfile?.appliedJobs?.push({ jobId: req.params.jobId, status: "applied" });
+    user?.studentProfile?.appliedJobs.push({ jobId: req.params.jobId, status: "applied" });
     job?.applicants?.push({ studentId: user._id });
     await user.save();

[NoCoverage] OptionalChaining
controllers/Student/apply-job.controller.js:20:5
 
     if (!user?.studentProfile?.resume) return res.json({ msg: 'Please Upload Resume First, Under "Placements" > "Placement Profile"' });
 
-    user?.studentProfile?.appliedJobs?.push({ jobId: req.params.jobId, status: "applied" });
+    user?.studentProfile.appliedJobs?.push({ jobId: req.params.jobId, status: "applied" });
     job?.applicants?.push({ studentId: user._id });
     await user.save();

[NoCoverage] OptionalChaining
controllers/Student/apply-job.controller.js:21:5
     if (!user?.studentProfile?.resume) return res.json({ msg: 'Please Upload Resume First, Under "Placements" > "Placement Profile"' });
 
     user?.studentProfile?.appliedJobs?.push({ jobId: req.params.jobId, status: "applied" });
-    job?.applicants?.push({ studentId: user._id });
+    job.applicants?.push({ studentId: user._id });
     await user.save();
     await job.save();

[NoCoverage] OptionalChaining
controllers/Student/apply-job.controller.js:21:5
     if (!user?.studentProfile?.resume) return res.json({ msg: 'Please Upload Resume First, Under "Placements" > "Placement Profile"' });
 
     user?.studentProfile?.appliedJobs?.push({ jobId: req.params.jobId, status: "applied" });
-    job?.applicants?.push({ studentId: user._id });
+    job?.applicants.push({ studentId: user._id });
     await user.save();
     await job.save();

[NoCoverage] StringLiteral
controllers/Student/apply-job.controller.js:25:40
     await user.save();
     await job.save();
 
-    return res.status(201).json({ msg: "Applied Successfully!" });
+    return res.status(201).json({ msg: "" });
   } catch (error) {
     console.log("apply-job.controller.js => ", error);

[NoCoverage] BlockStatement
controllers/Student/apply-job.controller.js:26:19
     await job.save();
 
     return res.status(201).json({ msg: "Applied Successfully!" });
-  } catch (error) {
-    console.log("apply-job.controller.js => ", error);
-    return res.status(500).json({ msg: "Internal Server Error!" });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
controllers/Student/apply-job.controller.js:28:40
     return res.status(201).json({ msg: "Applied Successfully!" });
   } catch (error) {
     console.log("apply-job.controller.js => ", error);
-    return res.status(500).json({ msg: "Internal Server Error!" });
+    return res.status(500).json({ msg: "" });
   }
 }

[NoCoverage] BlockStatement
controllers/Student/apply-job.controller.js:32:49
   }
 }
 
-const CheckAlreadyApplied = async (req, res) => {
-  try {
-    // if studentId is not defined return
-    if (req.params.studentId === "undefined") return;
-    if (req.params.jobId === "undefined") return;
-
-    const user = await User.findById(req.params.studentId);
-
-    // retune if already applied
-    if (user?.studentProfile?.appliedJobs?.some(job => job.jobId == req.params.jobId)) return res.json({ applied: true });
-    else return res.json({ applied: false });
-
-  } catch (error) {
-    console.log("apply-job.controller.js => ", error);
-    return res.status(500).json({ msg: "Internal Server Error!" });
-  }
-}
+const CheckAlreadyApplied = async (req, res) => {}
 
 module.exports = {

[NoCoverage] BlockStatement
controllers/Student/apply-job.controller.js:33:7
 }
 
 const CheckAlreadyApplied = async (req, res) => {
-  try {
-    // if studentId is not defined return
-    if (req.params.studentId === "undefined") return;
-    if (req.params.jobId === "undefined") return;
-
-    const user = await User.findById(req.params.studentId);
-
-    // retune if already applied
-    if (user?.studentProfile?.appliedJobs?.some(job => job.jobId == req.params.jobId)) return res.json({ applied: true });
-    else return res.json({ applied: false });
-
-  } catch (error) {
+  try {} catch (error) {
     console.log("apply-job.controller.js => ", error);
     return res.status(500).json({ msg: "Internal Server Error!" });

[NoCoverage] ConditionalExpression
controllers/Student/apply-job.controller.js:35:9
 const CheckAlreadyApplied = async (req, res) => {
   try {
     // if studentId is not defined return
-    if (req.params.studentId === "undefined") return;
+    if (true) return;
     if (req.params.jobId === "undefined") return;
 

[NoCoverage] ConditionalExpression
controllers/Student/apply-job.controller.js:36:9
   try {
     // if studentId is not defined return
     if (req.params.studentId === "undefined") return;
-    if (req.params.jobId === "undefined") return;
+    if (false) return;
 
     const user = await User.findById(req.params.studentId);

[NoCoverage] OptionalChaining
controllers/Student/apply-job.controller.js:41:9
     const user = await User.findById(req.params.studentId);
 
     // retune if already applied
-    if (user?.studentProfile?.appliedJobs?.some(job => job.jobId == req.params.jobId)) return res.json({ applied: true });
+    if (user?.studentProfile?.appliedJobs.some(job => job.jobId == req.params.jobId)) return res.json({ applied: true });
     else return res.json({ applied: false });
 

[NoCoverage] ArrowFunction
controllers/Student/apply-job.controller.js:41:49
     const user = await User.findById(req.params.studentId);
 
     // retune if already applied
-    if (user?.studentProfile?.appliedJobs?.some(job => job.jobId == req.params.jobId)) return res.json({ applied: true });
+    if (user?.studentProfile?.appliedJobs?.some(() => undefined)) return res.json({ applied: true });
     else return res.json({ applied: false });
 

[NoCoverage] BooleanLiteral
controllers/Student/apply-job.controller.js:42:37
 
     // retune if already applied
     if (user?.studentProfile?.appliedJobs?.some(job => job.jobId == req.params.jobId)) return res.json({ applied: true });
-    else return res.json({ applied: false });
+    else return res.json({ applied: true });
 
   } catch (error) {

[NoCoverage] BlockStatement
controllers/Student/apply-job.controller.js:44:19
     if (user?.studentProfile?.appliedJobs?.some(job => job.jobId == req.params.jobId)) return res.json({ applied: true });
     else return res.json({ applied: false });
 
-  } catch (error) {
-    console.log("apply-job.controller.js => ", error);
-    return res.status(500).json({ msg: "Internal Server Error!" });
-  }
+  } catch (error) {}
 }
 
