[NoCoverage] BlockStatement
controllers/user/user.update-password.js:4:44
 const User = require('../../models/user.model');
 const bcrypt = require('bcrypt');
 
-const UpdatePassword = async (req, res) => {
-  const { oldpass, newpass } = req.body;
-  try {
-    const user = await User.findById(req.user.id);
-
-    if (!user) return res.send("User Not Found!");
-
-    const isMatch = await bcrypt.compare(oldpass, user.password);
-
-    if (isMatch) {
-      const hashPassword = await bcrypt.hash(newpass, 10);
-      user.password = hashPassword;
-      await user.save();
-
-      return res.send("Password Updated Successfully!");
-
-    } else return res.send("Password Did Not Matched!");
-
-  } catch (error) {
-    console.log("UpdatePassword.js => ", error)
-    return res.status(500).send('Server error');
-  }
-}
+const UpdatePassword = async (req, res) => {}
 
 module.exports = UpdatePassword;

[NoCoverage] BlockStatement
controllers/user/user.update-password.js:6:7
 
 const UpdatePassword = async (req, res) => {
   const { oldpass, newpass } = req.body;
-  try {
-    const user = await User.findById(req.user.id);
-
-    if (!user) return res.send("User Not Found!");
-
-    const isMatch = await bcrypt.compare(oldpass, user.password);
-
-    if (isMatch) {
-      const hashPassword = await bcrypt.hash(newpass, 10);
-      user.password = hashPassword;
-      await user.save();
-
-      return res.send("Password Updated Successfully!");
-
-    } else return res.send("Password Did Not Matched!");
-
-  } catch (error) {
+  try {} catch (error) {
     console.log("UpdatePassword.js => ", error)
     return res.status(500).send('Server error');

[NoCoverage] ConditionalExpression
controllers/user/user.update-password.js:9:9
   try {
     const user = await User.findById(req.user.id);
 
-    if (!user) return res.send("User Not Found!");
+    if (false) return res.send("User Not Found!");
 
     const isMatch = await bcrypt.compare(oldpass, user.password);

[NoCoverage] BooleanLiteral
controllers/user/user.update-password.js:9:9
   try {
     const user = await User.findById(req.user.id);
 
-    if (!user) return res.send("User Not Found!");
+    if (user) return res.send("User Not Found!");
 
     const isMatch = await bcrypt.compare(oldpass, user.password);

[NoCoverage] BlockStatement
controllers/user/user.update-password.js:13:18
 
     const isMatch = await bcrypt.compare(oldpass, user.password);
 
-    if (isMatch) {
-      const hashPassword = await bcrypt.hash(newpass, 10);
-      user.password = hashPassword;
-      await user.save();
-
-      return res.send("Password Updated Successfully!");
-
-    } else return res.send("Password Did Not Matched!");
+    if (isMatch) {} else return res.send("Password Did Not Matched!");
 
   } catch (error) {

[NoCoverage] StringLiteral
controllers/user/user.update-password.js:18:23
       user.password = hashPassword;
       await user.save();
 
-      return res.send("Password Updated Successfully!");
+      return res.send("");
 
     } else return res.send("Password Did Not Matched!");

[NoCoverage] StringLiteral
controllers/user/user.update-password.js:20:28
 
       return res.send("Password Updated Successfully!");
 
-    } else return res.send("Password Did Not Matched!");
+    } else return res.send("");
 
   } catch (error) {

[NoCoverage] BlockStatement
controllers/user/user.update-password.js:22:19
 
     } else return res.send("Password Did Not Matched!");
 
-  } catch (error) {
-    console.log("UpdatePassword.js => ", error)
-    return res.status(500).send('Server error');
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
controllers/user/user.update-password.js:24:33
 
   } catch (error) {
     console.log("UpdatePassword.js => ", error)
-    return res.status(500).send('Server error');
+    return res.status(500).send("");
   }
 }
