[NoCoverage] BlockStatement
controllers/Student/internship.controller.js:4:44
 const User = require("../../models/user.model");
 
 
-const GetInternships = async (req, res) => {
-  // console.log(req.query);
-  try {
-    const student = await User.findById(req.query.studentId);
-    if (!student) return res.json({ msg: "Student Not Found!" });
-
-    if (!student?.studentProfile?.internships || student?.studentProfile?.internships?.length === 0) return res.json({ msg: "No Internship Found!" });
-
-    const internship = student?.studentProfile?.internships?.find(intern => { if (intern._id == req.query.internshipId) return intern });
-
-    // console.log(internship);
-
-    return res.json({ internships: student?.studentProfile?.internships, internship: internship });
-  } catch (error) {
-    console.log("internship.controller.js => ", error);
-    return res.status(500).json({ msg: "Internal Server Error!" });
-  }
-}
+const GetInternships = async (req, res) => {}
 
 const UpdateInternship = async (req, res) => {

[NoCoverage] BlockStatement
controllers/Student/internship.controller.js:6:7
 
 const GetInternships = async (req, res) => {
   // console.log(req.query);
-  try {
-    const student = await User.findById(req.query.studentId);
-    if (!student) return res.json({ msg: "Student Not Found!" });
-
-    if (!student?.studentProfile?.internships || student?.studentProfile?.internships?.length === 0) return res.json({ msg: "No Internship Found!" });
-
-    const internship = student?.studentProfile?.internships?.find(intern => { if (intern._id == req.query.internshipId) return intern });
-
-    // console.log(internship);
-
-    return res.json({ internships: student?.studentProfile?.internships, internship: internship });
-  } catch (error) {
+  try {} catch (error) {
     console.log("internship.controller.js => ", error);
     return res.status(500).json({ msg: "Internal Server Error!" });

[NoCoverage] BooleanLiteral
controllers/Student/internship.controller.js:8:9
   // console.log(req.query);
   try {
     const student = await User.findById(req.query.studentId);
-    if (!student) return res.json({ msg: "Student Not Found!" });
+    if (student) return res.json({ msg: "Student Not Found!" });
 
     if (!student?.studentProfile?.internships || student?.studentProfile?.internships?.length === 0) return res.json({ msg: "No Internship Found!" });

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:8:9
   // console.log(req.query);
   try {
     const student = await User.findById(req.query.studentId);
-    if (!student) return res.json({ msg: "Student Not Found!" });
+    if (true) return res.json({ msg: "Student Not Found!" });
 
     if (!student?.studentProfile?.internships || student?.studentProfile?.internships?.length === 0) return res.json({ msg: "No Internship Found!" });

[NoCoverage] EqualityOperator
controllers/Student/internship.controller.js:10:50
     const student = await User.findById(req.query.studentId);
     if (!student) return res.json({ msg: "Student Not Found!" });
 
-    if (!student?.studentProfile?.internships || student?.studentProfile?.internships?.length === 0) return res.json({ msg: "No Internship Found!" });
+    if (!student?.studentProfile?.internships || student?.studentProfile?.internships?.length !== 0) return res.json({ msg: "No Internship Found!" });
 
     const internship = student?.studentProfile?.internships?.find(intern => { if (intern._id == req.query.internshipId) return intern });

[NoCoverage] BooleanLiteral
controllers/Student/internship.controller.js:10:9
     const student = await User.findById(req.query.studentId);
     if (!student) return res.json({ msg: "Student Not Found!" });
 
-    if (!student?.studentProfile?.internships || student?.studentProfile?.internships?.length === 0) return res.json({ msg: "No Internship Found!" });
+    if (student?.studentProfile?.internships || student?.studentProfile?.internships?.length === 0) return res.json({ msg: "No Internship Found!" });
 
     const internship = student?.studentProfile?.internships?.find(intern => { if (intern._id == req.query.internshipId) return intern });

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:12:83
 
     if (!student?.studentProfile?.internships || student?.studentProfile?.internships?.length === 0) return res.json({ msg: "No Internship Found!" });
 
-    const internship = student?.studentProfile?.internships?.find(intern => { if (intern._id == req.query.internshipId) return intern });
+    const internship = student?.studentProfile?.internships?.find(intern => { if (false) return intern });
 
     // console.log(internship);

[NoCoverage] OptionalChaining
controllers/Student/internship.controller.js:12:24
 
     if (!student?.studentProfile?.internships || student?.studentProfile?.internships?.length === 0) return res.json({ msg: "No Internship Found!" });
 
-    const internship = student?.studentProfile?.internships?.find(intern => { if (intern._id == req.query.internshipId) return intern });
+    const internship = student.studentProfile?.internships?.find(intern => { if (intern._id == req.query.internshipId) return intern });
 
     // console.log(internship);

[NoCoverage] OptionalChaining
controllers/Student/internship.controller.js:16:36
 
     // console.log(internship);
 
-    return res.json({ internships: student?.studentProfile?.internships, internship: internship });
+    return res.json({ internships: student.studentProfile?.internships, internship: internship });
   } catch (error) {
     console.log("internship.controller.js => ", error);

[NoCoverage] OptionalChaining
controllers/Student/internship.controller.js:16:36
 
     // console.log(internship);
 
-    return res.json({ internships: student?.studentProfile?.internships, internship: internship });
+    return res.json({ internships: student?.studentProfile.internships, internship: internship });
   } catch (error) {
     console.log("internship.controller.js => ", error);

[NoCoverage] BlockStatement
controllers/Student/internship.controller.js:17:19
     // console.log(internship);
 
     return res.json({ internships: student?.studentProfile?.internships, internship: internship });
-  } catch (error) {
-    console.log("internship.controller.js => ", error);
-    return res.status(500).json({ msg: "Internal Server Error!" });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
controllers/Student/internship.controller.js:18:17
 
     return res.json({ internships: student?.studentProfile?.internships, internship: internship });
   } catch (error) {
-    console.log("internship.controller.js => ", error);
+    console.log("", error);
     return res.status(500).json({ msg: "Internal Server Error!" });
   }

[NoCoverage] StringLiteral
controllers/Student/internship.controller.js:19:40
     return res.json({ internships: student?.studentProfile?.internships, internship: internship });
   } catch (error) {
     console.log("internship.controller.js => ", error);
-    return res.status(500).json({ msg: "Internal Server Error!" });
+    return res.status(500).json({ msg: "" });
   }
 }

[NoCoverage] BooleanLiteral
controllers/Student/internship.controller.js:27:9
   try {
     const student = await User.findById(req.query.studentId);
     // console.log(student);
-    if (!req.body.internship) return res.json({ msg: "No Data received to update!" });
+    if (req.body.internship) return res.json({ msg: "No Data received to update!" });
     if (!student) return res.json({ msg: "Student Not Found!" });
 

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:27:9
   try {
     const student = await User.findById(req.query.studentId);
     // console.log(student);
-    if (!req.body.internship) return res.json({ msg: "No Data received to update!" });
+    if (true) return res.json({ msg: "No Data received to update!" });
     if (!student) return res.json({ msg: "Student Not Found!" });
 

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:28:9
     const student = await User.findById(req.query.studentId);
     // console.log(student);
     if (!req.body.internship) return res.json({ msg: "No Data received to update!" });
-    if (!student) return res.json({ msg: "Student Not Found!" });
+    if (true) return res.json({ msg: "Student Not Found!" });
 
 

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:28:9
     const student = await User.findById(req.query.studentId);
     // console.log(student);
     if (!req.body.internship) return res.json({ msg: "No Data received to update!" });
-    if (!student) return res.json({ msg: "Student Not Found!" });
+    if (false) return res.json({ msg: "Student Not Found!" });
 
 

[NoCoverage] LogicalOperator
controllers/Student/internship.controller.js:45:9
     } = req.body.internship;
 
 
-    if (!companyName || !internshipDuration || !startDate || !type) return res.json({ msg: "Star marked are mandatory to fill!" });
+    if (!companyName && !internshipDuration || !startDate || !type) return res.json({ msg: "Star marked are mandatory to fill!" });
 
     // new internship to push

[NoCoverage] LogicalOperator
controllers/Student/internship.controller.js:45:9
     } = req.body.internship;
 
 
-    if (!companyName || !internshipDuration || !startDate || !type) return res.json({ msg: "Star marked are mandatory to fill!" });
+    if ((!companyName || !internshipDuration) && !startDate || !type) return res.json({ msg: "Star marked are mandatory to fill!" });
 
     // new internship to push

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:54:9
     // if new internship to save or else update existing internship
 
 
-    if (req.query.internshipId === "undefined") {
+    if (false) {
       // Push the new internship object to the student's internships array
       student.studentProfile.internships.push(newInternship);

[NoCoverage] BlockStatement
controllers/Student/internship.controller.js:54:49
     // if new internship to save or else update existing internship
 
 
-    if (req.query.internshipId === "undefined") {
-      // Push the new internship object to the student's internships array
-      student.studentProfile.internships.push(newInternship);
-    } else {
+    if (req.query.internshipId === "undefined") {} else {
       // if user is updating existing data 
 

[NoCoverage] BlockStatement
controllers/Student/internship.controller.js:57:12
     if (req.query.internshipId === "undefined") {
       // Push the new internship object to the student's internships array
       student.studentProfile.internships.push(newInternship);
-    } else {
-      // if user is updating existing data 
-
-      const internship = student.studentProfile.internships.find(intern => { if (intern._id == req.query.internshipId) return intern })
-
-      if (companyName) internship.companyName = companyName;
-      if (companyAddress) internship.companyAddress = companyAddress;
-      if (companyWebsite) internship.companyWebsite = companyWebsite;
-      if (internshipDuration) internship.internshipDuration = internshipDuration;
-      if (startDate) internship.startDate = startDate;
-      if (endDate) internship.endDate = endDate;
-      if (monthlyStipend) internship.monthlyStipend = monthlyStipend;
-      if (description) internship.description = description;
-      if (type) internship.type = type;
-    }
+    } else {}
 
     // Save the updated student document

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:60:82
     } else {
       // if user is updating existing data 
 
-      const internship = student.studentProfile.internships.find(intern => { if (intern._id == req.query.internshipId) return intern })
+      const internship = student.studentProfile.internships.find(intern => { if (true) return intern })
 
       if (companyName) internship.companyName = companyName;

[NoCoverage] BlockStatement
controllers/Student/internship.controller.js:60:76
     } else {
       // if user is updating existing data 
 
-      const internship = student.studentProfile.internships.find(intern => { if (intern._id == req.query.internshipId) return intern })
+      const internship = student.studentProfile.internships.find(intern => {})
 
       if (companyName) internship.companyName = companyName;

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:62:11
 
       const internship = student.studentProfile.internships.find(intern => { if (intern._id == req.query.internshipId) return intern })
 
-      if (companyName) internship.companyName = companyName;
+      if (true) internship.companyName = companyName;
       if (companyAddress) internship.companyAddress = companyAddress;
       if (companyWebsite) internship.companyWebsite = companyWebsite;

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:62:11
 
       const internship = student.studentProfile.internships.find(intern => { if (intern._id == req.query.internshipId) return intern })
 
-      if (companyName) internship.companyName = companyName;
+      if (false) internship.companyName = companyName;
       if (companyAddress) internship.companyAddress = companyAddress;
       if (companyWebsite) internship.companyWebsite = companyWebsite;

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:63:11
       const internship = student.studentProfile.internships.find(intern => { if (intern._id == req.query.internshipId) return intern })
 
       if (companyName) internship.companyName = companyName;
-      if (companyAddress) internship.companyAddress = companyAddress;
+      if (false) internship.companyAddress = companyAddress;
       if (companyWebsite) internship.companyWebsite = companyWebsite;
       if (internshipDuration) internship.internshipDuration = internshipDuration;

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:63:11
       const internship = student.studentProfile.internships.find(intern => { if (intern._id == req.query.internshipId) return intern })
 
       if (companyName) internship.companyName = companyName;
-      if (companyAddress) internship.companyAddress = companyAddress;
+      if (true) internship.companyAddress = companyAddress;
       if (companyWebsite) internship.companyWebsite = companyWebsite;
       if (internshipDuration) internship.internshipDuration = internshipDuration;

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:64:11
 
       if (companyName) internship.companyName = companyName;
       if (companyAddress) internship.companyAddress = companyAddress;
-      if (companyWebsite) internship.companyWebsite = companyWebsite;
+      if (true) internship.companyWebsite = companyWebsite;
       if (internshipDuration) internship.internshipDuration = internshipDuration;
       if (startDate) internship.startDate = startDate;

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:64:11
 
       if (companyName) internship.companyName = companyName;
       if (companyAddress) internship.companyAddress = companyAddress;
-      if (companyWebsite) internship.companyWebsite = companyWebsite;
+      if (false) internship.companyWebsite = companyWebsite;
       if (internshipDuration) internship.internshipDuration = internshipDuration;
       if (startDate) internship.startDate = startDate;

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:65:11
       if (companyName) internship.companyName = companyName;
       if (companyAddress) internship.companyAddress = companyAddress;
       if (companyWebsite) internship.companyWebsite = companyWebsite;
-      if (internshipDuration) internship.internshipDuration = internshipDuration;
+      if (false) internship.internshipDuration = internshipDuration;
       if (startDate) internship.startDate = startDate;
       if (endDate) internship.endDate = endDate;

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:65:11
       if (companyName) internship.companyName = companyName;
       if (companyAddress) internship.companyAddress = companyAddress;
       if (companyWebsite) internship.companyWebsite = companyWebsite;
-      if (internshipDuration) internship.internshipDuration = internshipDuration;
+      if (true) internship.internshipDuration = internshipDuration;
       if (startDate) internship.startDate = startDate;
       if (endDate) internship.endDate = endDate;

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:66:11
       if (companyAddress) internship.companyAddress = companyAddress;
       if (companyWebsite) internship.companyWebsite = companyWebsite;
       if (internshipDuration) internship.internshipDuration = internshipDuration;
-      if (startDate) internship.startDate = startDate;
+      if (true) internship.startDate = startDate;
       if (endDate) internship.endDate = endDate;
       if (monthlyStipend) internship.monthlyStipend = monthlyStipend;

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:66:11
       if (companyAddress) internship.companyAddress = companyAddress;
       if (companyWebsite) internship.companyWebsite = companyWebsite;
       if (internshipDuration) internship.internshipDuration = internshipDuration;
-      if (startDate) internship.startDate = startDate;
+      if (false) internship.startDate = startDate;
       if (endDate) internship.endDate = endDate;
       if (monthlyStipend) internship.monthlyStipend = monthlyStipend;

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:67:11
       if (companyWebsite) internship.companyWebsite = companyWebsite;
       if (internshipDuration) internship.internshipDuration = internshipDuration;
       if (startDate) internship.startDate = startDate;
-      if (endDate) internship.endDate = endDate;
+      if (false) internship.endDate = endDate;
       if (monthlyStipend) internship.monthlyStipend = monthlyStipend;
       if (description) internship.description = description;

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:67:11
       if (companyWebsite) internship.companyWebsite = companyWebsite;
       if (internshipDuration) internship.internshipDuration = internshipDuration;
       if (startDate) internship.startDate = startDate;
-      if (endDate) internship.endDate = endDate;
+      if (true) internship.endDate = endDate;
       if (monthlyStipend) internship.monthlyStipend = monthlyStipend;
       if (description) internship.description = description;

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:68:11
       if (internshipDuration) internship.internshipDuration = internshipDuration;
       if (startDate) internship.startDate = startDate;
       if (endDate) internship.endDate = endDate;
-      if (monthlyStipend) internship.monthlyStipend = monthlyStipend;
+      if (true) internship.monthlyStipend = monthlyStipend;
       if (description) internship.description = description;
       if (type) internship.type = type;

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:68:11
       if (internshipDuration) internship.internshipDuration = internshipDuration;
       if (startDate) internship.startDate = startDate;
       if (endDate) internship.endDate = endDate;
-      if (monthlyStipend) internship.monthlyStipend = monthlyStipend;
+      if (false) internship.monthlyStipend = monthlyStipend;
       if (description) internship.description = description;
       if (type) internship.type = type;

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:69:11
       if (startDate) internship.startDate = startDate;
       if (endDate) internship.endDate = endDate;
       if (monthlyStipend) internship.monthlyStipend = monthlyStipend;
-      if (description) internship.description = description;
+      if (true) internship.description = description;
       if (type) internship.type = type;
     }

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:69:11
       if (startDate) internship.startDate = startDate;
       if (endDate) internship.endDate = endDate;
       if (monthlyStipend) internship.monthlyStipend = monthlyStipend;
-      if (description) internship.description = description;
+      if (false) internship.description = description;
       if (type) internship.type = type;
     }

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:70:11
       if (endDate) internship.endDate = endDate;
       if (monthlyStipend) internship.monthlyStipend = monthlyStipend;
       if (description) internship.description = description;
-      if (type) internship.type = type;
+      if (false) internship.type = type;
     }
 

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:70:11
       if (endDate) internship.endDate = endDate;
       if (monthlyStipend) internship.monthlyStipend = monthlyStipend;
       if (description) internship.description = description;
-      if (type) internship.type = type;
+      if (true) internship.type = type;
     }
 

[NoCoverage] BlockStatement
controllers/Student/internship.controller.js:77:19
     await student.save();
     // Return a success message
     return res.json({ msg: "Internship Updated Successfully!" });
-  } catch (error) {
-    console.log("internship.controller.js => ", error);
-    return res.status(500).json({ msg: "Internal Server Error!" });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
controllers/Student/internship.controller.js:83:46
   }
 }
 
-const DeleteInternship = async (req, res) => {
-  // console.log(req.query);
-  try {
-    const student = await User.findById(req.body.studentId);
-    // console.log(req.body);
-    if (!student) return res.json({ msg: "Student Not Found!" });
-
-    // Find the internship index
-    const internshipIndex = student.studentProfile.internships.findIndex(intern => intern._id.toString() === req.body.internshipId);
-    if (internshipIndex === -1) return res.json({ msg: "No Internship Found!" });
-
-    // Remove the internship from the array
-    student.studentProfile.internships.splice(internshipIndex, 1);
-
-    // Save the updated student document
-    await student.save();
-
-    return res.json({ msg: "Internship deleted successfully!" });
-  } catch (error) {
-    console.log("internship.controller.js => ", error);
-    return res.status(500).json({ msg: "Internal Server Error!" });
-  }
-}
+const DeleteInternship = async (req, res) => {}
 
 

[NoCoverage] BlockStatement
controllers/Student/internship.controller.js:85:7
 
 const DeleteInternship = async (req, res) => {
   // console.log(req.query);
-  try {
-    const student = await User.findById(req.body.studentId);
-    // console.log(req.body);
-    if (!student) return res.json({ msg: "Student Not Found!" });
-
-    // Find the internship index
-    const internshipIndex = student.studentProfile.internships.findIndex(intern => intern._id.toString() === req.body.internshipId);
-    if (internshipIndex === -1) return res.json({ msg: "No Internship Found!" });
-
-    // Remove the internship from the array
-    student.studentProfile.internships.splice(internshipIndex, 1);
-
-    // Save the updated student document
-    await student.save();
-
-    return res.json({ msg: "Internship deleted successfully!" });
-  } catch (error) {
+  try {} catch (error) {
     console.log("internship.controller.js => ", error);
     return res.status(500).json({ msg: "Internal Server Error!" });

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:88:9
   try {
     const student = await User.findById(req.body.studentId);
     // console.log(req.body);
-    if (!student) return res.json({ msg: "Student Not Found!" });
+    if (false) return res.json({ msg: "Student Not Found!" });
 
     // Find the internship index

[NoCoverage] BooleanLiteral
controllers/Student/internship.controller.js:88:9
   try {
     const student = await User.findById(req.body.studentId);
     // console.log(req.body);
-    if (!student) return res.json({ msg: "Student Not Found!" });
+    if (student) return res.json({ msg: "Student Not Found!" });
 
     // Find the internship index

[NoCoverage] EqualityOperator
controllers/Student/internship.controller.js:91:84
     if (!student) return res.json({ msg: "Student Not Found!" });
 
     // Find the internship index
-    const internshipIndex = student.studentProfile.internships.findIndex(intern => intern._id.toString() === req.body.internshipId);
+    const internshipIndex = student.studentProfile.internships.findIndex(intern => intern._id.toString() !== req.body.internshipId);
     if (internshipIndex === -1) return res.json({ msg: "No Internship Found!" });
 

[NoCoverage] ArrowFunction
controllers/Student/internship.controller.js:91:74
     if (!student) return res.json({ msg: "Student Not Found!" });
 
     // Find the internship index
-    const internshipIndex = student.studentProfile.internships.findIndex(intern => intern._id.toString() === req.body.internshipId);
+    const internshipIndex = student.studentProfile.internships.findIndex(() => undefined);
     if (internshipIndex === -1) return res.json({ msg: "No Internship Found!" });
 

[NoCoverage] UnaryOperator
controllers/Student/internship.controller.js:92:29
 
     // Find the internship index
     const internshipIndex = student.studentProfile.internships.findIndex(intern => intern._id.toString() === req.body.internshipId);
-    if (internshipIndex === -1) return res.json({ msg: "No Internship Found!" });
+    if (internshipIndex === +1) return res.json({ msg: "No Internship Found!" });
 
     // Remove the internship from the array

[NoCoverage] ConditionalExpression
controllers/Student/internship.controller.js:92:9
 
     // Find the internship index
     const internshipIndex = student.studentProfile.internships.findIndex(intern => intern._id.toString() === req.body.internshipId);
-    if (internshipIndex === -1) return res.json({ msg: "No Internship Found!" });
+    if (true) return res.json({ msg: "No Internship Found!" });
 
     // Remove the internship from the array

[NoCoverage] StringLiteral
controllers/Student/internship.controller.js:100:28
     // Save the updated student document
     await student.save();
 
-    return res.json({ msg: "Internship deleted successfully!" });
+    return res.json({ msg: "" });
   } catch (error) {
     console.log("internship.controller.js => ", error);

[NoCoverage] BlockStatement
controllers/Student/internship.controller.js:101:19
     await student.save();
 
     return res.json({ msg: "Internship deleted successfully!" });
-  } catch (error) {
-    console.log("internship.controller.js => ", error);
-    return res.status(500).json({ msg: "Internal Server Error!" });
-  }
+  } catch (error) {}
 }
 
