[NoCoverage] BlockStatement
controllers/Student/offer-letter.controller.js:7:7
 
 // Upload Offer Letter to Cloudinary
 const UploadOfferLetter = async (req, res) => {
-  try {
-    if (!req.file) return res.status(400).json({ msg: "No offer letter uploaded" });
-
-    const job = await JobSchema.findById(req.body.jobId);
-    if (!job) return res.status(404).json({ msg: "Job not found!" });
-
-    // Finding the applicant
-    const applicant = job.applicants.find((app) => app.studentId == req.body.studentId);
-    if (!applicant) return res.status(400).json({ msg: "Student has not applied to this job!" });
-
-    // Upload offer letter to Cloudinary
-    const cloudinaryResponse = await cloudinary.uploader.upload(req.file.path, {
-      folder: "CPMS/Offer Letter",
-    });
-
-    // Update offer letter path in MongoDB
-    applicant.offerLetter = cloudinaryResponse.secure_url;
-
-    await job.save();
-    return res.json({ msg: "Offer Letter Uploaded Successfully!", url: cloudinaryResponse.secure_url });
-  } catch (error) {
+  try {} catch (error) {
     console.error(error);
     return res.status(500).json({ msg: "Server error", error });

[NoCoverage] ConditionalExpression
controllers/Student/offer-letter.controller.js:8:9
 // Upload Offer Letter to Cloudinary
 const UploadOfferLetter = async (req, res) => {
   try {
-    if (!req.file) return res.status(400).json({ msg: "No offer letter uploaded" });
+    if (true) return res.status(400).json({ msg: "No offer letter uploaded" });
 
     const job = await JobSchema.findById(req.body.jobId);

[NoCoverage] BooleanLiteral
controllers/Student/offer-letter.controller.js:8:9
 // Upload Offer Letter to Cloudinary
 const UploadOfferLetter = async (req, res) => {
   try {
-    if (!req.file) return res.status(400).json({ msg: "No offer letter uploaded" });
+    if (req.file) return res.status(400).json({ msg: "No offer letter uploaded" });
 
     const job = await JobSchema.findById(req.body.jobId);

[NoCoverage] ConditionalExpression
controllers/Student/offer-letter.controller.js:11:9
     if (!req.file) return res.status(400).json({ msg: "No offer letter uploaded" });
 
     const job = await JobSchema.findById(req.body.jobId);
-    if (!job) return res.status(404).json({ msg: "Job not found!" });
+    if (false) return res.status(404).json({ msg: "Job not found!" });
 
     // Finding the applicant

[NoCoverage] ConditionalExpression
controllers/Student/offer-letter.controller.js:11:9
     if (!req.file) return res.status(400).json({ msg: "No offer letter uploaded" });
 
     const job = await JobSchema.findById(req.body.jobId);
-    if (!job) return res.status(404).json({ msg: "Job not found!" });
+    if (true) return res.status(404).json({ msg: "Job not found!" });
 
     // Finding the applicant

[NoCoverage] ArrowFunction
controllers/Student/offer-letter.controller.js:14:43
     if (!job) return res.status(404).json({ msg: "Job not found!" });
 
     // Finding the applicant
-    const applicant = job.applicants.find((app) => app.studentId == req.body.studentId);
+    const applicant = job.applicants.find(() => undefined);
     if (!applicant) return res.status(400).json({ msg: "Student has not applied to this job!" });
 

[NoCoverage] EqualityOperator
controllers/Student/offer-letter.controller.js:14:52
     if (!job) return res.status(404).json({ msg: "Job not found!" });
 
     // Finding the applicant
-    const applicant = job.applicants.find((app) => app.studentId == req.body.studentId);
+    const applicant = job.applicants.find((app) => app.studentId != req.body.studentId);
     if (!applicant) return res.status(400).json({ msg: "Student has not applied to this job!" });
 

[NoCoverage] ConditionalExpression
controllers/Student/offer-letter.controller.js:15:9
 
     // Finding the applicant
     const applicant = job.applicants.find((app) => app.studentId == req.body.studentId);
-    if (!applicant) return res.status(400).json({ msg: "Student has not applied to this job!" });
+    if (false) return res.status(400).json({ msg: "Student has not applied to this job!" });
 
     // Upload offer letter to Cloudinary

[NoCoverage] ConditionalExpression
controllers/Student/offer-letter.controller.js:15:9
 
     // Finding the applicant
     const applicant = job.applicants.find((app) => app.studentId == req.body.studentId);
-    if (!applicant) return res.status(400).json({ msg: "Student has not applied to this job!" });
+    if (true) return res.status(400).json({ msg: "Student has not applied to this job!" });
 
     // Upload offer letter to Cloudinary

[NoCoverage] StringLiteral
controllers/Student/offer-letter.controller.js:26:28
     applicant.offerLetter = cloudinaryResponse.secure_url;
 
     await job.save();
-    return res.json({ msg: "Offer Letter Uploaded Successfully!", url: cloudinaryResponse.secure_url });
+    return res.json({ msg: "", url: cloudinaryResponse.secure_url });
   } catch (error) {
     console.error(error);

[NoCoverage] BlockStatement
controllers/Student/offer-letter.controller.js:27:19
 
     await job.save();
     return res.json({ msg: "Offer Letter Uploaded Successfully!", url: cloudinaryResponse.secure_url });
-  } catch (error) {
-    console.error(error);
-    return res.status(500).json({ msg: "Server error", error });
-  }
+  } catch (error) {}
 };
 

[NoCoverage] StringLiteral
controllers/Student/offer-letter.controller.js:29:40
     return res.json({ msg: "Offer Letter Uploaded Successfully!", url: cloudinaryResponse.secure_url });
   } catch (error) {
     console.error(error);
-    return res.status(500).json({ msg: "Server error", error });
+    return res.status(500).json({ msg: "", error });
   }
 };

[NoCoverage] ObjectLiteral
controllers/Student/offer-letter.controller.js:29:33
     return res.json({ msg: "Offer Letter Uploaded Successfully!", url: cloudinaryResponse.secure_url });
   } catch (error) {
     console.error(error);
-    return res.status(500).json({ msg: "Server error", error });
+    return res.status(500).json({});
   }
 };

[NoCoverage] BlockStatement
controllers/Student/offer-letter.controller.js:34:47
 };
 
 // Delete Offer Letter from Cloudinary & MongoDB
-const DeleteOfferLetter = async (req, res) => {
-  try {
-    if (!req.params) return res.status(400).json({ msg: "Error while receiving data!" });
-
-    const job = await JobSchema.findById(req.params.jobId);
-    if (!job) return res.status(404).json({ msg: "Job not found!" });
-
-    const applicant = job.applicants.find((app) => app.studentId == req.params.studentId);
-    if (!applicant || !applicant.offerLetter) return res.status(400).json({ msg: "No offer letter found for this student!" });
-
-    // Extract public_id from Cloudinary URL
-    const publicId = applicant.offerLetter.split("/").pop().split(".")[0]; // Extract public ID
-    await cloudinary.uploader.destroy(`CPMS/Offer Letter/${publicId}`, { resource_type: "raw" });
-
-    // Remove offer letter from MongoDB
-    applicant.offerLetter = null;
-    await job.save();
-
-    return res.json({ msg: "Offer Letter Deleted Successfully!" });
-  } catch (error) {
-    console.error(error);
-    return res.status(500).json({ msg: "Server error", error });
-  }
-};
+const DeleteOfferLetter = async (req, res) => {};
 
 module.exports = {

[NoCoverage] BlockStatement
controllers/Student/offer-letter.controller.js:35:7
 
 // Delete Offer Letter from Cloudinary & MongoDB
 const DeleteOfferLetter = async (req, res) => {
-  try {
-    if (!req.params) return res.status(400).json({ msg: "Error while receiving data!" });
-
-    const job = await JobSchema.findById(req.params.jobId);
-    if (!job) return res.status(404).json({ msg: "Job not found!" });
-
-    const applicant = job.applicants.find((app) => app.studentId == req.params.studentId);
-    if (!applicant || !applicant.offerLetter) return res.status(400).json({ msg: "No offer letter found for this student!" });
-
-    // Extract public_id from Cloudinary URL
-    const publicId = applicant.offerLetter.split("/").pop().split(".")[0]; // Extract public ID
-    await cloudinary.uploader.destroy(`CPMS/Offer Letter/${publicId}`, { resource_type: "raw" });
-
-    // Remove offer letter from MongoDB
-    applicant.offerLetter = null;
-    await job.save();
-
-    return res.json({ msg: "Offer Letter Deleted Successfully!" });
-  } catch (error) {
+  try {} catch (error) {
     console.error(error);
     return res.status(500).json({ msg: "Server error", error });

[NoCoverage] ConditionalExpression
controllers/Student/offer-letter.controller.js:36:9
 // Delete Offer Letter from Cloudinary & MongoDB
 const DeleteOfferLetter = async (req, res) => {
   try {
-    if (!req.params) return res.status(400).json({ msg: "Error while receiving data!" });
+    if (false) return res.status(400).json({ msg: "Error while receiving data!" });
 
     const job = await JobSchema.findById(req.params.jobId);

[NoCoverage] ConditionalExpression
controllers/Student/offer-letter.controller.js:36:9
 // Delete Offer Letter from Cloudinary & MongoDB
 const DeleteOfferLetter = async (req, res) => {
   try {
-    if (!req.params) return res.status(400).json({ msg: "Error while receiving data!" });
+    if (true) return res.status(400).json({ msg: "Error while receiving data!" });
 
     const job = await JobSchema.findById(req.params.jobId);

[NoCoverage] ConditionalExpression
controllers/Student/offer-letter.controller.js:39:9
     if (!req.params) return res.status(400).json({ msg: "Error while receiving data!" });
 
     const job = await JobSchema.findById(req.params.jobId);
-    if (!job) return res.status(404).json({ msg: "Job not found!" });
+    if (true) return res.status(404).json({ msg: "Job not found!" });
 
     const applicant = job.applicants.find((app) => app.studentId == req.params.studentId);

[NoCoverage] BooleanLiteral
controllers/Student/offer-letter.controller.js:39:9
     if (!req.params) return res.status(400).json({ msg: "Error while receiving data!" });
 
     const job = await JobSchema.findById(req.params.jobId);
-    if (!job) return res.status(404).json({ msg: "Job not found!" });
+    if (job) return res.status(404).json({ msg: "Job not found!" });
 
     const applicant = job.applicants.find((app) => app.studentId == req.params.studentId);

[NoCoverage] EqualityOperator
controllers/Student/offer-letter.controller.js:41:52
     const job = await JobSchema.findById(req.params.jobId);
     if (!job) return res.status(404).json({ msg: "Job not found!" });
 
-    const applicant = job.applicants.find((app) => app.studentId == req.params.studentId);
+    const applicant = job.applicants.find((app) => app.studentId != req.params.studentId);
     if (!applicant || !applicant.offerLetter) return res.status(400).json({ msg: "No offer letter found for this student!" });
 

[NoCoverage] ConditionalExpression
controllers/Student/offer-letter.controller.js:41:52
     const job = await JobSchema.findById(req.params.jobId);
     if (!job) return res.status(404).json({ msg: "Job not found!" });
 
-    const applicant = job.applicants.find((app) => app.studentId == req.params.studentId);
+    const applicant = job.applicants.find((app) => false);
     if (!applicant || !applicant.offerLetter) return res.status(400).json({ msg: "No offer letter found for this student!" });
 

[NoCoverage] ConditionalExpression
controllers/Student/offer-letter.controller.js:42:9
     if (!job) return res.status(404).json({ msg: "Job not found!" });
 
     const applicant = job.applicants.find((app) => app.studentId == req.params.studentId);
-    if (!applicant || !applicant.offerLetter) return res.status(400).json({ msg: "No offer letter found for this student!" });
+    if (false) return res.status(400).json({ msg: "No offer letter found for this student!" });
 
     // Extract public_id from Cloudinary URL

[NoCoverage] BooleanLiteral
controllers/Student/offer-letter.controller.js:42:9
     if (!job) return res.status(404).json({ msg: "Job not found!" });
 
     const applicant = job.applicants.find((app) => app.studentId == req.params.studentId);
-    if (!applicant || !applicant.offerLetter) return res.status(400).json({ msg: "No offer letter found for this student!" });
+    if (applicant || !applicant.offerLetter) return res.status(400).json({ msg: "No offer letter found for this student!" });
 
     // Extract public_id from Cloudinary URL

[NoCoverage] StringLiteral
controllers/Student/offer-letter.controller.js:45:50
     if (!applicant || !applicant.offerLetter) return res.status(400).json({ msg: "No offer letter found for this student!" });
 
     // Extract public_id from Cloudinary URL
-    const publicId = applicant.offerLetter.split("/").pop().split(".")[0]; // Extract public ID
+    const publicId = applicant.offerLetter.split("").pop().split(".")[0]; // Extract public ID
     await cloudinary.uploader.destroy(`CPMS/Offer Letter/${publicId}`, { resource_type: "raw" });
 

[NoCoverage] StringLiteral
controllers/Student/offer-letter.controller.js:45:67
     if (!applicant || !applicant.offerLetter) return res.status(400).json({ msg: "No offer letter found for this student!" });
 
     // Extract public_id from Cloudinary URL
-    const publicId = applicant.offerLetter.split("/").pop().split(".")[0]; // Extract public ID
+    const publicId = applicant.offerLetter.split("/").pop().split("")[0]; // Extract public ID
     await cloudinary.uploader.destroy(`CPMS/Offer Letter/${publicId}`, { resource_type: "raw" });
 

[NoCoverage] ObjectLiteral
controllers/Student/offer-letter.controller.js:46:72
 
     // Extract public_id from Cloudinary URL
     const publicId = applicant.offerLetter.split("/").pop().split(".")[0]; // Extract public ID
-    await cloudinary.uploader.destroy(`CPMS/Offer Letter/${publicId}`, { resource_type: "raw" });
+    await cloudinary.uploader.destroy(`CPMS/Offer Letter/${publicId}`, {});
 
     // Remove offer letter from MongoDB

[NoCoverage] StringLiteral
controllers/Student/offer-letter.controller.js:46:39
 
     // Extract public_id from Cloudinary URL
     const publicId = applicant.offerLetter.split("/").pop().split(".")[0]; // Extract public ID
-    await cloudinary.uploader.destroy(`CPMS/Offer Letter/${publicId}`, { resource_type: "raw" });
+    await cloudinary.uploader.destroy(``, { resource_type: "raw" });
 
     // Remove offer letter from MongoDB

[NoCoverage] BlockStatement
controllers/Student/offer-letter.controller.js:53:19
     await job.save();
 
     return res.json({ msg: "Offer Letter Deleted Successfully!" });
-  } catch (error) {
-    console.error(error);
-    return res.status(500).json({ msg: "Server error", error });
-  }
+  } catch (error) {}
 };
 
