[NoCoverage] ConditionalExpression
controllers/Student/resume.controller.js:7:9
 
 const UploadResume = async (req, res) => {
   try {
-    if (!req.file) {
+    if (true) {
       return res.status(400).json({ msg: "No resume uploaded" });
     }

[NoCoverage] BlockStatement
controllers/Student/resume.controller.js:7:20
 
 const UploadResume = async (req, res) => {
   try {
-    if (!req.file) {
-      return res.status(400).json({ msg: "No resume uploaded" });
-    }
+    if (!req.file) {}
 
     // Check for PDF MIME type

[NoCoverage] ObjectLiteral
controllers/Student/resume.controller.js:8:35
 const UploadResume = async (req, res) => {
   try {
     if (!req.file) {
-      return res.status(400).json({ msg: "No resume uploaded" });
+      return res.status(400).json({});
     }
 

[NoCoverage] StringLiteral
controllers/Student/resume.controller.js:8:42
 const UploadResume = async (req, res) => {
   try {
     if (!req.file) {
-      return res.status(400).json({ msg: "No resume uploaded" });
+      return res.status(400).json({ msg: "" });
     }
 

[NoCoverage] BlockStatement
controllers/Student/resume.controller.js:12:50
     }
 
     // Check for PDF MIME type
-    if (req.file.mimetype !== "application/pdf") {
-      return res.status(400).json({ msg: "Only PDF files are allowed" });
-    }
+    if (req.file.mimetype !== "application/pdf") {}
 
     const user = await User.findById(req.body.userId);

[NoCoverage] EqualityOperator
controllers/Student/resume.controller.js:12:9
     }
 
     // Check for PDF MIME type
-    if (req.file.mimetype !== "application/pdf") {
+    if (req.file.mimetype === "application/pdf") {
       return res.status(400).json({ msg: "Only PDF files are allowed" });
     }

[NoCoverage] ObjectLiteral
controllers/Student/resume.controller.js:13:35
 
     // Check for PDF MIME type
     if (req.file.mimetype !== "application/pdf") {
-      return res.status(400).json({ msg: "Only PDF files are allowed" });
+      return res.status(400).json({});
     }
 

[NoCoverage] ConditionalExpression
controllers/Student/resume.controller.js:17:9
     }
 
     const user = await User.findById(req.body.userId);
-    if (!user) {
+    if (true) {
       return res.status(404).json({ msg: "Student not found!" });
     }

[NoCoverage] BooleanLiteral
controllers/Student/resume.controller.js:17:9
     }
 
     const user = await User.findById(req.body.userId);
-    if (!user) {
+    if (user) {
       return res.status(404).json({ msg: "Student not found!" });
     }

[NoCoverage] ConditionalExpression
controllers/Student/resume.controller.js:22:9
     }
 
     // Delete old resume from Cloudinary if it exists
-    if (user.studentProfile.resume) {
+    if (false) {
       const oldResumeUrl = user.studentProfile.resume;
       const oldResumeFileName = oldResumeUrl.substring(oldResumeUrl.lastIndexOf("/") + 1).split(".")[0];

[NoCoverage] ConditionalExpression
controllers/Student/resume.controller.js:22:9
     }
 
     // Delete old resume from Cloudinary if it exists
-    if (user.studentProfile.resume) {
+    if (true) {
       const oldResumeUrl = user.studentProfile.resume;
       const oldResumeFileName = oldResumeUrl.substring(oldResumeUrl.lastIndexOf("/") + 1).split(".")[0];

[NoCoverage] MethodExpression
controllers/Student/resume.controller.js:24:33
     // Delete old resume from Cloudinary if it exists
     if (user.studentProfile.resume) {
       const oldResumeUrl = user.studentProfile.resume;
-      const oldResumeFileName = oldResumeUrl.substring(oldResumeUrl.lastIndexOf("/") + 1).split(".")[0];
+      const oldResumeFileName = oldResumeUrl.split(".")[0];
       const oldResumePublicId = `CPMS/Resume/${oldResumeFileName}`;
 

[NoCoverage] ArithmeticOperator
controllers/Student/resume.controller.js:24:56
     // Delete old resume from Cloudinary if it exists
     if (user.studentProfile.resume) {
       const oldResumeUrl = user.studentProfile.resume;
-      const oldResumeFileName = oldResumeUrl.substring(oldResumeUrl.lastIndexOf("/") + 1).split(".")[0];
+      const oldResumeFileName = oldResumeUrl.substring(oldResumeUrl.lastIndexOf("/") - 1).split(".")[0];
       const oldResumePublicId = `CPMS/Resume/${oldResumeFileName}`;
 

[NoCoverage] ObjectLiteral
controllers/Student/resume.controller.js:27:60
       const oldResumeFileName = oldResumeUrl.substring(oldResumeUrl.lastIndexOf("/") + 1).split(".")[0];
       const oldResumePublicId = `CPMS/Resume/${oldResumeFileName}`;
 
-      await cloudinary.uploader.destroy(oldResumePublicId, { resource_type: "raw" });
+      await cloudinary.uploader.destroy(oldResumePublicId, {});
     }
 

[NoCoverage] StringLiteral
controllers/Student/resume.controller.js:27:77
       const oldResumeFileName = oldResumeUrl.substring(oldResumeUrl.lastIndexOf("/") + 1).split(".")[0];
       const oldResumePublicId = `CPMS/Resume/${oldResumeFileName}`;
 
-      await cloudinary.uploader.destroy(oldResumePublicId, { resource_type: "raw" });
+      await cloudinary.uploader.destroy(oldResumePublicId, { resource_type: "" });
     }
 

[NoCoverage] ObjectLiteral
controllers/Student/resume.controller.js:35:80
     const uniqueFilename = `${originalName}_${Date.now()}_${req.body.userId}`;
 
     // Upload the new resume
-    const cloudinaryResponse = await cloudinary.uploader.upload(req.file.path, {
-      folder: "CPMS/Resume",
-      public_id: uniqueFilename,
-    });
+    const cloudinaryResponse = await cloudinary.uploader.upload(req.file.path, {});
 
     // Update resume path in MongoDB

[NoCoverage] StringLiteral
controllers/Student/resume.controller.js:36:15
 
     // Upload the new resume
     const cloudinaryResponse = await cloudinary.uploader.upload(req.file.path, {
-      folder: "CPMS/Resume",
+      folder: "",
       public_id: uniqueFilename,
     });

[NoCoverage] StringLiteral
controllers/Student/resume.controller.js:44:40
     user.studentProfile.resume = cloudinaryResponse.secure_url;
     await user.save();
 
-    return res.status(200).json({ msg: "Resume uploaded successfully!", url: cloudinaryResponse.secure_url });
+    return res.status(200).json({ msg: "", url: cloudinaryResponse.secure_url });
   } catch (error) {
     console.error(error);

[NoCoverage] BlockStatement
controllers/Student/resume.controller.js:45:19
     await user.save();
 
     return res.status(200).json({ msg: "Resume uploaded successfully!", url: cloudinaryResponse.secure_url });
-  } catch (error) {
-    console.error(error);
-    return res.status(500).json({ msg: "Server error", error });
-  }
+  } catch (error) {}
 };
 
