[NoCoverage] BlockStatement
controllers/Student/signup.controller.js:8:7
 const Signup = async (req, res) => {
   const { first_name, email, number, password } = req.body;
 
-  try {
-    if (await User.findOne({ email }))
-      return res.status(400).json({ msg: "User Already Exists!" });
-
-    const hashPassword = await bcrypt.hash(password, 10);
-
-    const newUser = new User({
-      first_name: first_name,
-      email: email,
-      number: number,
-      password: hashPassword,
-      role: "student",
-      studentProfile: {
-        isApproved: false
-      }
-    });
-    await newUser.save();
-    return res.json({ msg: "User Created!" });
-  } catch (error) {
+  try {} catch (error) {
     console.log("student.signup.controller.js => ", error);
     return res.status(500).json({ msg: "Internal Server Error!" });

[NoCoverage] ConditionalExpression
controllers/Student/signup.controller.js:9:9
   const { first_name, email, number, password } = req.body;
 
   try {
-    if (await User.findOne({ email }))
+    if (false)
       return res.status(400).json({ msg: "User Already Exists!" });
 

[NoCoverage] ConditionalExpression
controllers/Student/signup.controller.js:9:9
   const { first_name, email, number, password } = req.body;
 
   try {
-    if (await User.findOne({ email }))
+    if (true)
       return res.status(400).json({ msg: "User Already Exists!" });
 

[NoCoverage] StringLiteral
controllers/Student/signup.controller.js:10:42
 
   try {
     if (await User.findOne({ email }))
-      return res.status(400).json({ msg: "User Already Exists!" });
+      return res.status(400).json({ msg: "" });
 
     const hashPassword = await bcrypt.hash(password, 10);

[NoCoverage] StringLiteral
controllers/Student/signup.controller.js:19:13
       email: email,
       number: number,
       password: hashPassword,
-      role: "student",
+      role: "",
       studentProfile: {
         isApproved: false

[NoCoverage] ObjectLiteral
controllers/Student/signup.controller.js:20:23
       number: number,
       password: hashPassword,
       role: "student",
-      studentProfile: {
-        isApproved: false
-      }
+      studentProfile: {}
     });
     await newUser.save();

[NoCoverage] BooleanLiteral
controllers/Student/signup.controller.js:21:21
       password: hashPassword,
       role: "student",
       studentProfile: {
-        isApproved: false
+        isApproved: true
       }
     });

[NoCoverage] BlockStatement
controllers/Student/signup.controller.js:26:19
     });
     await newUser.save();
     return res.json({ msg: "User Created!" });
-  } catch (error) {
-    console.log("student.signup.controller.js => ", error);
-    return res.status(500).json({ msg: "Internal Server Error!" });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
controllers/Student/signup.controller.js:27:17
     await newUser.save();
     return res.json({ msg: "User Created!" });
   } catch (error) {
-    console.log("student.signup.controller.js => ", error);
+    console.log("", error);
     return res.status(500).json({ msg: "Internal Server Error!" });
   }
