[NoCoverage] LogicalOperator
controllers/Student/update-job-status.controller.js:10:9
     const job = await JobSchema.findById(req.params.jobId);
     const student = await User.findById(req.params.studentId)
 
-    if (!job || !student) res.json({ msg: "Student or Job Not Found!" })
+    if (!job && !student) res.json({ msg: "Student or Job Not Found!" })
 
     job.applicants.find(app => {

[NoCoverage] ConditionalExpression
controllers/Student/update-job-status.controller.js:10:9
     const job = await JobSchema.findById(req.params.jobId);
     const student = await User.findById(req.params.studentId)
 
-    if (!job || !student) res.json({ msg: "Student or Job Not Found!" })
+    if (false) res.json({ msg: "Student or Job Not Found!" })
 
     job.applicants.find(app => {

[NoCoverage] BlockStatement
controllers/Student/update-job-status.controller.js:12:32
 
     if (!job || !student) res.json({ msg: "Student or Job Not Found!" })
 
-    job.applicants.find(app => {
-      if (app.studentId == req.params.studentId) {
-        if (req.body.applicant.currentRound) app.currentRound = req.body.applicant.currentRound;
-        if (req.body.applicant.roundStatus) app.roundStatus = req.body.applicant.roundStatus;
-        if (req.body.applicant.selectionDate) app.selectionDate = req.body.applicant.selectionDate;
-        if (req.body.applicant.joiningDate) app.joiningDate = req.body.applicant.joiningDate;
-        if (req.body.applicant.offerLetter) app.offerLetter = req.body.applicant.offerLetter;
-        if (req.body.applicant.status) app.status = req.body.applicant.status;
-      }
-    });
+    job.applicants.find(app => {});
 
     student?.studentProfile?.appliedJobs?.find(app => {

[NoCoverage] ConditionalExpression
controllers/Student/update-job-status.controller.js:13:11
     if (!job || !student) res.json({ msg: "Student or Job Not Found!" })
 
     job.applicants.find(app => {
-      if (app.studentId == req.params.studentId) {
+      if (true) {
         if (req.body.applicant.currentRound) app.currentRound = req.body.applicant.currentRound;
         if (req.body.applicant.roundStatus) app.roundStatus = req.body.applicant.roundStatus;

[NoCoverage] BlockStatement
controllers/Student/update-job-status.controller.js:13:50
     if (!job || !student) res.json({ msg: "Student or Job Not Found!" })
 
     job.applicants.find(app => {
-      if (app.studentId == req.params.studentId) {
-        if (req.body.applicant.currentRound) app.currentRound = req.body.applicant.currentRound;
-        if (req.body.applicant.roundStatus) app.roundStatus = req.body.applicant.roundStatus;
-        if (req.body.applicant.selectionDate) app.selectionDate = req.body.applicant.selectionDate;
-        if (req.body.applicant.joiningDate) app.joiningDate = req.body.applicant.joiningDate;
-        if (req.body.applicant.offerLetter) app.offerLetter = req.body.applicant.offerLetter;
-        if (req.body.applicant.status) app.status = req.body.applicant.status;
-      }
+      if (app.studentId == req.params.studentId) {}
     });
 

[NoCoverage] ConditionalExpression
controllers/Student/update-job-status.controller.js:14:13
 
     job.applicants.find(app => {
       if (app.studentId == req.params.studentId) {
-        if (req.body.applicant.currentRound) app.currentRound = req.body.applicant.currentRound;
+        if (false) app.currentRound = req.body.applicant.currentRound;
         if (req.body.applicant.roundStatus) app.roundStatus = req.body.applicant.roundStatus;
         if (req.body.applicant.selectionDate) app.selectionDate = req.body.applicant.selectionDate;

[NoCoverage] ConditionalExpression
controllers/Student/update-job-status.controller.js:14:13
 
     job.applicants.find(app => {
       if (app.studentId == req.params.studentId) {
-        if (req.body.applicant.currentRound) app.currentRound = req.body.applicant.currentRound;
+        if (true) app.currentRound = req.body.applicant.currentRound;
         if (req.body.applicant.roundStatus) app.roundStatus = req.body.applicant.roundStatus;
         if (req.body.applicant.selectionDate) app.selectionDate = req.body.applicant.selectionDate;

[NoCoverage] ConditionalExpression
controllers/Student/update-job-status.controller.js:15:13
     job.applicants.find(app => {
       if (app.studentId == req.params.studentId) {
         if (req.body.applicant.currentRound) app.currentRound = req.body.applicant.currentRound;
-        if (req.body.applicant.roundStatus) app.roundStatus = req.body.applicant.roundStatus;
+        if (false) app.roundStatus = req.body.applicant.roundStatus;
         if (req.body.applicant.selectionDate) app.selectionDate = req.body.applicant.selectionDate;
         if (req.body.applicant.joiningDate) app.joiningDate = req.body.applicant.joiningDate;

[NoCoverage] ConditionalExpression
controllers/Student/update-job-status.controller.js:15:13
     job.applicants.find(app => {
       if (app.studentId == req.params.studentId) {
         if (req.body.applicant.currentRound) app.currentRound = req.body.applicant.currentRound;
-        if (req.body.applicant.roundStatus) app.roundStatus = req.body.applicant.roundStatus;
+        if (true) app.roundStatus = req.body.applicant.roundStatus;
         if (req.body.applicant.selectionDate) app.selectionDate = req.body.applicant.selectionDate;
         if (req.body.applicant.joiningDate) app.joiningDate = req.body.applicant.joiningDate;

[NoCoverage] ConditionalExpression
controllers/Student/update-job-status.controller.js:16:13
       if (app.studentId == req.params.studentId) {
         if (req.body.applicant.currentRound) app.currentRound = req.body.applicant.currentRound;
         if (req.body.applicant.roundStatus) app.roundStatus = req.body.applicant.roundStatus;
-        if (req.body.applicant.selectionDate) app.selectionDate = req.body.applicant.selectionDate;
+        if (false) app.selectionDate = req.body.applicant.selectionDate;
         if (req.body.applicant.joiningDate) app.joiningDate = req.body.applicant.joiningDate;
         if (req.body.applicant.offerLetter) app.offerLetter = req.body.applicant.offerLetter;

[NoCoverage] ConditionalExpression
controllers/Student/update-job-status.controller.js:16:13
       if (app.studentId == req.params.studentId) {
         if (req.body.applicant.currentRound) app.currentRound = req.body.applicant.currentRound;
         if (req.body.applicant.roundStatus) app.roundStatus = req.body.applicant.roundStatus;
-        if (req.body.applicant.selectionDate) app.selectionDate = req.body.applicant.selectionDate;
+        if (true) app.selectionDate = req.body.applicant.selectionDate;
         if (req.body.applicant.joiningDate) app.joiningDate = req.body.applicant.joiningDate;
         if (req.body.applicant.offerLetter) app.offerLetter = req.body.applicant.offerLetter;

[NoCoverage] ConditionalExpression
controllers/Student/update-job-status.controller.js:17:13
         if (req.body.applicant.currentRound) app.currentRound = req.body.applicant.currentRound;
         if (req.body.applicant.roundStatus) app.roundStatus = req.body.applicant.roundStatus;
         if (req.body.applicant.selectionDate) app.selectionDate = req.body.applicant.selectionDate;
-        if (req.body.applicant.joiningDate) app.joiningDate = req.body.applicant.joiningDate;
+        if (true) app.joiningDate = req.body.applicant.joiningDate;
         if (req.body.applicant.offerLetter) app.offerLetter = req.body.applicant.offerLetter;
         if (req.body.applicant.status) app.status = req.body.applicant.status;

[NoCoverage] ConditionalExpression
controllers/Student/update-job-status.controller.js:17:13
         if (req.body.applicant.currentRound) app.currentRound = req.body.applicant.currentRound;
         if (req.body.applicant.roundStatus) app.roundStatus = req.body.applicant.roundStatus;
         if (req.body.applicant.selectionDate) app.selectionDate = req.body.applicant.selectionDate;
-        if (req.body.applicant.joiningDate) app.joiningDate = req.body.applicant.joiningDate;
+        if (false) app.joiningDate = req.body.applicant.joiningDate;
         if (req.body.applicant.offerLetter) app.offerLetter = req.body.applicant.offerLetter;
         if (req.body.applicant.status) app.status = req.body.applicant.status;

[NoCoverage] ConditionalExpression
controllers/Student/update-job-status.controller.js:18:13
         if (req.body.applicant.roundStatus) app.roundStatus = req.body.applicant.roundStatus;
         if (req.body.applicant.selectionDate) app.selectionDate = req.body.applicant.selectionDate;
         if (req.body.applicant.joiningDate) app.joiningDate = req.body.applicant.joiningDate;
-        if (req.body.applicant.offerLetter) app.offerLetter = req.body.applicant.offerLetter;
+        if (true) app.offerLetter = req.body.applicant.offerLetter;
         if (req.body.applicant.status) app.status = req.body.applicant.status;
       }

[NoCoverage] ConditionalExpression
controllers/Student/update-job-status.controller.js:18:13
         if (req.body.applicant.roundStatus) app.roundStatus = req.body.applicant.roundStatus;
         if (req.body.applicant.selectionDate) app.selectionDate = req.body.applicant.selectionDate;
         if (req.body.applicant.joiningDate) app.joiningDate = req.body.applicant.joiningDate;
-        if (req.body.applicant.offerLetter) app.offerLetter = req.body.applicant.offerLetter;
+        if (false) app.offerLetter = req.body.applicant.offerLetter;
         if (req.body.applicant.status) app.status = req.body.applicant.status;
       }

[NoCoverage] ConditionalExpression
controllers/Student/update-job-status.controller.js:19:13
         if (req.body.applicant.selectionDate) app.selectionDate = req.body.applicant.selectionDate;
         if (req.body.applicant.joiningDate) app.joiningDate = req.body.applicant.joiningDate;
         if (req.body.applicant.offerLetter) app.offerLetter = req.body.applicant.offerLetter;
-        if (req.body.applicant.status) app.status = req.body.applicant.status;
+        if (true) app.status = req.body.applicant.status;
       }
     });

[NoCoverage] ConditionalExpression
controllers/Student/update-job-status.controller.js:19:13
         if (req.body.applicant.selectionDate) app.selectionDate = req.body.applicant.selectionDate;
         if (req.body.applicant.joiningDate) app.joiningDate = req.body.applicant.joiningDate;
         if (req.body.applicant.offerLetter) app.offerLetter = req.body.applicant.offerLetter;
-        if (req.body.applicant.status) app.status = req.body.applicant.status;
+        if (false) app.status = req.body.applicant.status;
       }
     });

[NoCoverage] OptionalChaining
controllers/Student/update-job-status.controller.js:23:5
       }
     });
 
-    student?.studentProfile?.appliedJobs?.find(app => {
+    student?.studentProfile.appliedJobs?.find(app => {
       if (app.jobId == req.params.jobId) {
         if (req.body.applicant.status) app.status = req.body.applicant.status;

[NoCoverage] OptionalChaining
controllers/Student/update-job-status.controller.js:23:5
       }
     });
 
-    student?.studentProfile?.appliedJobs?.find(app => {
+    student.studentProfile?.appliedJobs?.find(app => {
       if (app.jobId == req.params.jobId) {
         if (req.body.applicant.status) app.status = req.body.applicant.status;

[NoCoverage] BlockStatement
controllers/Student/update-job-status.controller.js:24:42
     });
 
     student?.studentProfile?.appliedJobs?.find(app => {
-      if (app.jobId == req.params.jobId) {
-        if (req.body.applicant.status) app.status = req.body.applicant.status;
-        if (req.body.applicant.package) app.package = req.body.applicant.package;
-      }
+      if (app.jobId == req.params.jobId) {}
     })
 

[NoCoverage] EqualityOperator
controllers/Student/update-job-status.controller.js:24:11
     });
 
     student?.studentProfile?.appliedJobs?.find(app => {
-      if (app.jobId == req.params.jobId) {
+      if (app.jobId != req.params.jobId) {
         if (req.body.applicant.status) app.status = req.body.applicant.status;
         if (req.body.applicant.package) app.package = req.body.applicant.package;

[NoCoverage] ConditionalExpression
controllers/Student/update-job-status.controller.js:25:13
 
     student?.studentProfile?.appliedJobs?.find(app => {
       if (app.jobId == req.params.jobId) {
-        if (req.body.applicant.status) app.status = req.body.applicant.status;
+        if (true) app.status = req.body.applicant.status;
         if (req.body.applicant.package) app.package = req.body.applicant.package;
       }

[NoCoverage] ConditionalExpression
controllers/Student/update-job-status.controller.js:25:13
 
     student?.studentProfile?.appliedJobs?.find(app => {
       if (app.jobId == req.params.jobId) {
-        if (req.body.applicant.status) app.status = req.body.applicant.status;
+        if (false) app.status = req.body.applicant.status;
         if (req.body.applicant.package) app.package = req.body.applicant.package;
       }

[NoCoverage] ConditionalExpression
controllers/Student/update-job-status.controller.js:26:13
     student?.studentProfile?.appliedJobs?.find(app => {
       if (app.jobId == req.params.jobId) {
         if (req.body.applicant.status) app.status = req.body.applicant.status;
-        if (req.body.applicant.package) app.package = req.body.applicant.package;
+        if (false) app.package = req.body.applicant.package;
       }
     })

[NoCoverage] ConditionalExpression
controllers/Student/update-job-status.controller.js:26:13
     student?.studentProfile?.appliedJobs?.find(app => {
       if (app.jobId == req.params.jobId) {
         if (req.body.applicant.status) app.status = req.body.applicant.status;
-        if (req.body.applicant.package) app.package = req.body.applicant.package;
+        if (true) app.package = req.body.applicant.package;
       }
     })

[NoCoverage] StringLiteral
controllers/Student/update-job-status.controller.js:32:28
 
     await student.save();
     await job.save();
-    return res.json({ msg: "Job Status Updated Successfully!" });
+    return res.json({ msg: "" });
   } catch (error) {
     console.log("update-job-status.controller.js => ", error);

[NoCoverage] ObjectLiteral
controllers/Student/update-job-status.controller.js:32:21
 
     await student.save();
     await job.save();
-    return res.json({ msg: "Job Status Updated Successfully!" });
+    return res.json({});
   } catch (error) {
     console.log("update-job-status.controller.js => ", error);

[NoCoverage] BlockStatement
controllers/Student/update-job-status.controller.js:33:19
     await student.save();
     await job.save();
     return res.json({ msg: "Job Status Updated Successfully!" });
-  } catch (error) {
-    console.log("update-job-status.controller.js => ", error);
-    return res.status(500).json({ msg: "Internal Server Error!" });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
controllers/Student/update-job-status.controller.js:34:17
     await job.save();
     return res.json({ msg: "Job Status Updated Successfully!" });
   } catch (error) {
-    console.log("update-job-status.controller.js => ", error);
+    console.log("", error);
     return res.status(500).json({ msg: "Internal Server Error!" });
   }

[NoCoverage] StringLiteral
controllers/Student/update-job-status.controller.js:35:40
     return res.json({ msg: "Job Status Updated Successfully!" });
   } catch (error) {
     console.log("update-job-status.controller.js => ", error);
-    return res.status(500).json({ msg: "Internal Server Error!" });
+    return res.status(500).json({ msg: "" });
   }
 }
