[NoCoverage] BlockStatement
controllers/SuperUser/user-management.controller.js:5:45
 const bcrypt = require("bcrypt");
 
 // get management user
-const managementUsers = async (req, res) => {
-  const managementUsers = await User.find({ role: "management_admin" });
-  res.json({ managementUsers });
-}
+const managementUsers = async (req, res) => {}
 
 const managementAddUsers = async (req, res) => {

[NoCoverage] BlockStatement
controllers/SuperUser/user-management.controller.js:10:48
   res.json({ managementUsers });
 }
 
-const managementAddUsers = async (req, res) => {
-  const email = req.body.email;
-
-  try {
-    if (await User.findOne({ email }))
-      return res.json({ msg: "User Already Exists!" });
-
-    const hashPassword = await bcrypt.hash(req.body.password, 10);
-
-    const newUser = new User({ first_name: req.body.first_name, email: req.body.email, number: req.body.number, password: hashPassword, role: "management_admin" });
-    await newUser.save();
-    return res.json({ msg: "User Created!" });
-  } catch (error) {
-    console.log("admin.user-management => ", error);
-    return res.json({ msg: "Internal Server Error!" });
-  }
-}
+const managementAddUsers = async (req, res) => {}
 
 const managementDeleteUsers = async (req, res) => {

[NoCoverage] BlockStatement
controllers/SuperUser/user-management.controller.js:13:7
 const managementAddUsers = async (req, res) => {
   const email = req.body.email;
 
-  try {
-    if (await User.findOne({ email }))
-      return res.json({ msg: "User Already Exists!" });
-
-    const hashPassword = await bcrypt.hash(req.body.password, 10);
-
-    const newUser = new User({ first_name: req.body.first_name, email: req.body.email, number: req.body.number, password: hashPassword, role: "management_admin" });
-    await newUser.save();
-    return res.json({ msg: "User Created!" });
-  } catch (error) {
+  try {} catch (error) {
     console.log("admin.user-management => ", error);
     return res.json({ msg: "Internal Server Error!" });

[NoCoverage] StringLiteral
controllers/SuperUser/user-management.controller.js:21:28
 
     const newUser = new User({ first_name: req.body.first_name, email: req.body.email, number: req.body.number, password: hashPassword, role: "management_admin" });
     await newUser.save();
-    return res.json({ msg: "User Created!" });
+    return res.json({ msg: "" });
   } catch (error) {
     console.log("admin.user-management => ", error);

[NoCoverage] ObjectLiteral
controllers/SuperUser/user-management.controller.js:21:21
 
     const newUser = new User({ first_name: req.body.first_name, email: req.body.email, number: req.body.number, password: hashPassword, role: "management_admin" });
     await newUser.save();
-    return res.json({ msg: "User Created!" });
+    return res.json({});
   } catch (error) {
     console.log("admin.user-management => ", error);

[NoCoverage] BlockStatement
controllers/SuperUser/user-management.controller.js:22:19
     const newUser = new User({ first_name: req.body.first_name, email: req.body.email, number: req.body.number, password: hashPassword, role: "management_admin" });
     await newUser.save();
     return res.json({ msg: "User Created!" });
-  } catch (error) {
-    console.log("admin.user-management => ", error);
-    return res.json({ msg: "Internal Server Error!" });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
controllers/SuperUser/user-management.controller.js:24:28
     return res.json({ msg: "User Created!" });
   } catch (error) {
     console.log("admin.user-management => ", error);
-    return res.json({ msg: "Internal Server Error!" });
+    return res.json({ msg: "" });
   }
 }

[NoCoverage] BlockStatement
controllers/SuperUser/user-management.controller.js:28:51
   }
 }
 
-const managementDeleteUsers = async (req, res) => {
-  // const user = await Users.find({email: req.body.email});
-  const ress = await User.deleteOne({ email: req.body.email });
-  if (ress.acknowledged) {
-    return res.json({ msg: "User Deleted Successfully!" });
-  } else {
-    return res.json({ msg: "Error While Deleting User!" });
-  }
-}
+const managementDeleteUsers = async (req, res) => {}
 
 

[NoCoverage] ConditionalExpression
controllers/SuperUser/user-management.controller.js:31:7
 const managementDeleteUsers = async (req, res) => {
   // const user = await Users.find({email: req.body.email});
   const ress = await User.deleteOne({ email: req.body.email });
-  if (ress.acknowledged) {
+  if (true) {
     return res.json({ msg: "User Deleted Successfully!" });
   } else {

[NoCoverage] ConditionalExpression
controllers/SuperUser/user-management.controller.js:31:7
 const managementDeleteUsers = async (req, res) => {
   // const user = await Users.find({email: req.body.email});
   const ress = await User.deleteOne({ email: req.body.email });
-  if (ress.acknowledged) {
+  if (false) {
     return res.json({ msg: "User Deleted Successfully!" });
   } else {
