[NoCoverage] BlockStatement
controllers/SuperUser/user-student.controller.js:6:42
 const bcrypt = require("bcrypt");
 
 
-const studentUsers = async (req, res) => {
-  const studentUsers = await User.find({ role: "student" });
-  return res.json({ studentUsers })
-}
+const studentUsers = async (req, res) => {}
 
 const studentAddUsers = async (req, res) => {

[NoCoverage] BlockStatement
controllers/SuperUser/user-student.controller.js:14:7
 const studentAddUsers = async (req, res) => {
   const email = req.body.email;
 
-  try {
-    if (await User.findOne({ email }))
-      return res.json({ msg: "User Already Exists!" });
-
-    const hashPassword = await bcrypt.hash(req.body.password, 10);
-
-    const newUser = new User({
-      first_name: req.body.first_name,
-      email: req.body.email,
-      number: req.body.number,
-      password: hashPassword,
-      role: "student",
-      studentProfile: {
-        isApproved: true
-      }
-    });
-
-    await newUser.save();
-    return res.json({ msg: "User Created!" });
-  } catch (error) {
+  try {} catch (error) {
     console.log("user-student.controller => ", error);
     return res.status(500).json({ msg: 'Server error' });

[NoCoverage] BooleanLiteral
controllers/SuperUser/user-student.controller.js:27:21
       password: hashPassword,
       role: "student",
       studentProfile: {
-        isApproved: true
+        isApproved: false
       }
     });

[NoCoverage] BlockStatement
controllers/SuperUser/user-student.controller.js:33:19
 
     await newUser.save();
     return res.json({ msg: "User Created!" });
-  } catch (error) {
-    console.log("user-student.controller => ", error);
-    return res.status(500).json({ msg: 'Server error' });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
controllers/SuperUser/user-student.controller.js:34:17
     await newUser.save();
     return res.json({ msg: "User Created!" });
   } catch (error) {
-    console.log("user-student.controller => ", error);
+    console.log("", error);
     return res.status(500).json({ msg: 'Server error' });
   }

[NoCoverage] ObjectLiteral
controllers/SuperUser/user-student.controller.js:35:33
     return res.json({ msg: "User Created!" });
   } catch (error) {
     console.log("user-student.controller => ", error);
-    return res.status(500).json({ msg: 'Server error' });
+    return res.status(500).json({});
   }
 }

[NoCoverage] BlockStatement
controllers/SuperUser/user-student.controller.js:39:48
   }
 }
 
-const studentDeleteUsers = async (req, res) => {
-  // const user = await Users.find({email: req.body.email});
-  try {
-    const user = await User.findOne({ email: req.body.email });
-    // console.log(user);
-    // delete user and releted data
-    await user.deleteOne();
-    return res.json({ msg: "User Deleted Successfully!" });
-  } catch (error) {
-    console.log("user-delete-student.controller => ", error)
-    return res.status(500).json({ msg: 'Server error' });
-  }
-}
+const studentDeleteUsers = async (req, res) => {}
 
 const studentApprove = async (req, res) => {

[NoCoverage] BlockStatement
controllers/SuperUser/user-student.controller.js:41:7
 
 const studentDeleteUsers = async (req, res) => {
   // const user = await Users.find({email: req.body.email});
-  try {
-    const user = await User.findOne({ email: req.body.email });
-    // console.log(user);
-    // delete user and releted data
-    await user.deleteOne();
-    return res.json({ msg: "User Deleted Successfully!" });
-  } catch (error) {
+  try {} catch (error) {
     console.log("user-delete-student.controller => ", error)
     return res.status(500).json({ msg: 'Server error' });

[NoCoverage] ObjectLiteral
controllers/SuperUser/user-student.controller.js:42:37
 const studentDeleteUsers = async (req, res) => {
   // const user = await Users.find({email: req.body.email});
   try {
-    const user = await User.findOne({ email: req.body.email });
+    const user = await User.findOne({});
     // console.log(user);
     // delete user and releted data

[NoCoverage] StringLiteral
controllers/SuperUser/user-student.controller.js:46:28
     // console.log(user);
     // delete user and releted data
     await user.deleteOne();
-    return res.json({ msg: "User Deleted Successfully!" });
+    return res.json({ msg: "" });
   } catch (error) {
     console.log("user-delete-student.controller => ", error)

[NoCoverage] BlockStatement
controllers/SuperUser/user-student.controller.js:47:19
     // delete user and releted data
     await user.deleteOne();
     return res.json({ msg: "User Deleted Successfully!" });
-  } catch (error) {
-    console.log("user-delete-student.controller => ", error)
-    return res.status(500).json({ msg: 'Server error' });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] ObjectLiteral
controllers/SuperUser/user-student.controller.js:49:33
     return res.json({ msg: "User Deleted Successfully!" });
   } catch (error) {
     console.log("user-delete-student.controller => ", error)
-    return res.status(500).json({ msg: 'Server error' });
+    return res.status(500).json({});
   }
 }

[NoCoverage] BlockStatement
controllers/SuperUser/user-student.controller.js:53:44
   }
 }
 
-const studentApprove = async (req, res) => {
-  try {
-    const user = await User.findOne({ email: req.body.email });
-    // console.log(req.body)
-    // console.log(user)
-
-    if (!user)
-      return res.status(404).json({ msg: 'Student not found' });
-
-    user.studentProfile.isApproved = true;
-    await user.save();
-    return res.json({ msg: "Student Successfully Approved!" });
-  } catch (error) {
-    console.error('Error approving student user:', error);
-    return res.status(500).json({ msg: 'Server error' });
-  }
-}
+const studentApprove = async (req, res) => {}
 
 

[NoCoverage] BlockStatement
controllers/SuperUser/user-student.controller.js:54:7
 }
 
 const studentApprove = async (req, res) => {
-  try {
-    const user = await User.findOne({ email: req.body.email });
-    // console.log(req.body)
-    // console.log(user)
-
-    if (!user)
-      return res.status(404).json({ msg: 'Student not found' });
-
-    user.studentProfile.isApproved = true;
-    await user.save();
-    return res.json({ msg: "Student Successfully Approved!" });
-  } catch (error) {
+  try {} catch (error) {
     console.error('Error approving student user:', error);
     return res.status(500).json({ msg: 'Server error' });

[NoCoverage] BooleanLiteral
controllers/SuperUser/user-student.controller.js:59:9
     // console.log(req.body)
     // console.log(user)
 
-    if (!user)
+    if (user)
       return res.status(404).json({ msg: 'Student not found' });
 

[NoCoverage] ConditionalExpression
controllers/SuperUser/user-student.controller.js:59:9
     // console.log(req.body)
     // console.log(user)
 
-    if (!user)
+    if (false)
       return res.status(404).json({ msg: 'Student not found' });
 

[NoCoverage] BooleanLiteral
controllers/SuperUser/user-student.controller.js:62:38
     if (!user)
       return res.status(404).json({ msg: 'Student not found' });
 
-    user.studentProfile.isApproved = true;
+    user.studentProfile.isApproved = false;
     await user.save();
     return res.json({ msg: "Student Successfully Approved!" });

[NoCoverage] BlockStatement
controllers/SuperUser/user-student.controller.js:65:19
     user.studentProfile.isApproved = true;
     await user.save();
     return res.json({ msg: "Student Successfully Approved!" });
-  } catch (error) {
-    console.error('Error approving student user:', error);
-    return res.status(500).json({ msg: 'Server error' });
-  }
+  } catch (error) {}
 }
 
