[NoCoverage] BlockStatement
controllers/SuperUser/user-tpo.controller.js:5:38
 const bcrypt = require("bcrypt");
 
 
-const tpoUsers = async (req, res) => {
-  const tpoUsers = await User.find({ role: "tpo_admin" });
-  res.json({ tpoUsers })
-}
+const tpoUsers = async (req, res) => {}
 
 const tpoAddUsers = async (req, res) => {

[NoCoverage] ObjectLiteral
controllers/SuperUser/user-tpo.controller.js:6:36
 
 
 const tpoUsers = async (req, res) => {
-  const tpoUsers = await User.find({ role: "tpo_admin" });
+  const tpoUsers = await User.find({});
   res.json({ tpoUsers })
 }

[NoCoverage] ObjectLiteral
controllers/SuperUser/user-tpo.controller.js:7:12
 
 const tpoUsers = async (req, res) => {
   const tpoUsers = await User.find({ role: "tpo_admin" });
-  res.json({ tpoUsers })
+  res.json({})
 }
 

[NoCoverage] BlockStatement
controllers/SuperUser/user-tpo.controller.js:10:41
   res.json({ tpoUsers })
 }
 
-const tpoAddUsers = async (req, res) => {
-  const email = req.body.email;
-
-  try {
-    if (await User.findOne({ email }))
-      return res.json({ msg: "User Already Exists!" });
-
-    const hashPassword = await bcrypt.hash(req.body.password, 10);
-
-    const newUser = new User({ first_name: req.body.first_name, email: req.body.email, number: req.body.number, password: hashPassword, role: "tpo_admin" });
-    await newUser.save();
-    return res.json({ msg: "User Created!" });
-  } catch (error) {
-    console.log("user-tpo.controller => ", error);
-    return res.json({ msg: "Internal Server Error!" });
-  }
-}
+const tpoAddUsers = async (req, res) => {}
 
 const tpoDeleteUsers = async (req, res) => {

[NoCoverage] BlockStatement
controllers/SuperUser/user-tpo.controller.js:13:7
 const tpoAddUsers = async (req, res) => {
   const email = req.body.email;
 
-  try {
-    if (await User.findOne({ email }))
-      return res.json({ msg: "User Already Exists!" });
-
-    const hashPassword = await bcrypt.hash(req.body.password, 10);
-
-    const newUser = new User({ first_name: req.body.first_name, email: req.body.email, number: req.body.number, password: hashPassword, role: "tpo_admin" });
-    await newUser.save();
-    return res.json({ msg: "User Created!" });
-  } catch (error) {
+  try {} catch (error) {
     console.log("user-tpo.controller => ", error);
     return res.json({ msg: "Internal Server Error!" });

[NoCoverage] ObjectLiteral
controllers/SuperUser/user-tpo.controller.js:19:30
 
     const hashPassword = await bcrypt.hash(req.body.password, 10);
 
-    const newUser = new User({ first_name: req.body.first_name, email: req.body.email, number: req.body.number, password: hashPassword, role: "tpo_admin" });
+    const newUser = new User({});
     await newUser.save();
     return res.json({ msg: "User Created!" });

[NoCoverage] BlockStatement
controllers/SuperUser/user-tpo.controller.js:22:19
     const newUser = new User({ first_name: req.body.first_name, email: req.body.email, number: req.body.number, password: hashPassword, role: "tpo_admin" });
     await newUser.save();
     return res.json({ msg: "User Created!" });
-  } catch (error) {
-    console.log("user-tpo.controller => ", error);
-    return res.json({ msg: "Internal Server Error!" });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
controllers/SuperUser/user-tpo.controller.js:24:28
     return res.json({ msg: "User Created!" });
   } catch (error) {
     console.log("user-tpo.controller => ", error);
-    return res.json({ msg: "Internal Server Error!" });
+    return res.json({ msg: "" });
   }
 }

[NoCoverage] ObjectLiteral
controllers/SuperUser/user-tpo.controller.js:24:21
     return res.json({ msg: "User Created!" });
   } catch (error) {
     console.log("user-tpo.controller => ", error);
-    return res.json({ msg: "Internal Server Error!" });
+    return res.json({});
   }
 }

[NoCoverage] BlockStatement
controllers/SuperUser/user-tpo.controller.js:28:44
   }
 }
 
-const tpoDeleteUsers = async (req, res) => {
-  // const user = await Users.find({email: req.body.email});
-  const ress = await User.deleteOne({ email: req.body.email });
-  if (ress.acknowledged) {
-    return res.json({ msg: "User Deleted Successfully!" });
-  } else {
-    return res.json({ msg: "Error While Deleting User!" });
-  }
-}
+const tpoDeleteUsers = async (req, res) => {}
 
 

[NoCoverage] BlockStatement
controllers/SuperUser/user-tpo.controller.js:31:26
 const tpoDeleteUsers = async (req, res) => {
   // const user = await Users.find({email: req.body.email});
   const ress = await User.deleteOne({ email: req.body.email });
-  if (ress.acknowledged) {
-    return res.json({ msg: "User Deleted Successfully!" });
-  } else {
+  if (ress.acknowledged) {} else {
     return res.json({ msg: "Error While Deleting User!" });
   }
