[NoCoverage] LogicalOperator
controllers/TPO/tpo.post-job.controller.js:16:9
 
     // console.log(newJob);
 
-    if (!jobTitle || !jobDescription || !eligibility || !company) {
+    if (!jobTitle && !jobDescription || !eligibility || !company) {
       return res.status(400).json({ msg: 'Job title, job description, eligibility and company name are required.' });
     }

[NoCoverage] ConditionalExpression
controllers/TPO/tpo.post-job.controller.js:16:9
 
     // console.log(newJob);
 
-    if (!jobTitle || !jobDescription || !eligibility || !company) {
+    if (false) {
       return res.status(400).json({ msg: 'Job title, job description, eligibility and company name are required.' });
     }

[NoCoverage] StringLiteral
controllers/TPO/tpo.post-job.controller.js:17:42
     // console.log(newJob);
 
     if (!jobTitle || !jobDescription || !eligibility || !company) {
-      return res.status(400).json({ msg: 'Job title, job description, eligibility and company name are required.' });
+      return res.status(400).json({ msg: "" });
     }
 

[NoCoverage] BlockStatement
controllers/TPO/tpo.post-job.controller.js:22:14
 
     const job = await JobSchema.findById(req.body._id);
 
-    if (job) {
-      await job.updateOne({
-        company,
-        jobTitle,
-        jobDescription,
-        eligibility,
-        salary,
-        howToApply,
-        applicationDeadline
-      });
-      res.status(201).json({ msg: 'Job Updated successfully' });
-    } else {
+    if (job) {} else {
       // Create a new job object
       const newJob = new JobSchema({

[NoCoverage] ConditionalExpression
controllers/TPO/tpo.post-job.controller.js:22:9
 
     const job = await JobSchema.findById(req.body._id);
 
-    if (job) {
+    if (false) {
       await job.updateOne({
         company,

[NoCoverage] ObjectLiteral
controllers/TPO/tpo.post-job.controller.js:32:28
         howToApply,
         applicationDeadline
       });
-      res.status(201).json({ msg: 'Job Updated successfully' });
+      res.status(201).json({});
     } else {
       // Create a new job object

[NoCoverage] BlockStatement
controllers/TPO/tpo.post-job.controller.js:33:12
         applicationDeadline
       });
       res.status(201).json({ msg: 'Job Updated successfully' });
-    } else {
-      // Create a new job object
-      const newJob = new JobSchema({
-        jobTitle,
-        jobDescription,
-        eligibility,
-        salary,
-        howToApply,
-        postedAt: new Date(),
-        applicationDeadline,
-        company
-      });
-      await newJob.save();
-      return res.status(201).json({ msg: 'Job posted successfully' });
-    }
+    } else {}
 
   } catch (error) {

[NoCoverage] StringLiteral
controllers/TPO/tpo.post-job.controller.js:46:42
         company
       });
       await newJob.save();
-      return res.status(201).json({ msg: 'Job posted successfully' });
+      return res.status(201).json({ msg: "" });
     }
 

[NoCoverage] BlockStatement
controllers/TPO/tpo.post-job.controller.js:49:19
       return res.status(201).json({ msg: 'Job posted successfully' });
     }
 
-  } catch (error) {
-    console.log("tpo.post-job.controller.js => ", error);
-    return res.status(500).json({ msg: 'Server error', error: error });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] ObjectLiteral
controllers/TPO/tpo.post-job.controller.js:51:33
 
   } catch (error) {
     console.log("tpo.post-job.controller.js => ", error);
-    return res.status(500).json({ msg: 'Server error', error: error });
+    return res.status(500).json({});
   }
 }

[NoCoverage] StringLiteral
controllers/TPO/tpo.post-job.controller.js:51:40
 
   } catch (error) {
     console.log("tpo.post-job.controller.js => ", error);
-    return res.status(500).json({ msg: 'Server error', error: error });
+    return res.status(500).json({ msg: "", error: error });
   }
 }
