[NoCoverage] BlockStatement
controllers/user/user.all-jobs.controller.js:5:37
 const JobSchema = require("../../models/job.model");
 
 
-const AllJobs = async (req, res) => {
-  try {
-    const jobs = await JobSchema.find();
-    return res.json({ data: jobs });
-  } catch (error) {
-    console.log("user.all-jobs.controller.js => ", error);
-    return res.status(500).json({ msg: 'Server Error' });
-  }
-}
+const AllJobs = async (req, res) => {}
 
 const DeleteJob = async (req, res) => {

[NoCoverage] BlockStatement
controllers/user/user.all-jobs.controller.js:6:7
 
 
 const AllJobs = async (req, res) => {
-  try {
-    const jobs = await JobSchema.find();
-    return res.json({ data: jobs });
-  } catch (error) {
+  try {} catch (error) {
     console.log("user.all-jobs.controller.js => ", error);
     return res.status(500).json({ msg: 'Server Error' });

[NoCoverage] ObjectLiteral
controllers/user/user.all-jobs.controller.js:8:21
 const AllJobs = async (req, res) => {
   try {
     const jobs = await JobSchema.find();
-    return res.json({ data: jobs });
+    return res.json({});
   } catch (error) {
     console.log("user.all-jobs.controller.js => ", error);

[NoCoverage] BlockStatement
controllers/user/user.all-jobs.controller.js:9:19
   try {
     const jobs = await JobSchema.find();
     return res.json({ data: jobs });
-  } catch (error) {
-    console.log("user.all-jobs.controller.js => ", error);
-    return res.status(500).json({ msg: 'Server Error' });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] ObjectLiteral
controllers/user/user.all-jobs.controller.js:11:33
     return res.json({ data: jobs });
   } catch (error) {
     console.log("user.all-jobs.controller.js => ", error);
-    return res.status(500).json({ msg: 'Server Error' });
+    return res.status(500).json({});
   }
 }

[NoCoverage] BlockStatement
controllers/user/user.all-jobs.controller.js:15:39
   }
 }
 
-const DeleteJob = async (req, res) => {
-  try {
-    if (req.body.jobId) {
-      // console.log(req.body.jobId)
-      const job = await JobSchema.findById(req.body.jobId);
-
-      // before this middleware pre will run to delete student's appliedJobs
-      await job.deleteOne();
-      return res.status(200).json({ msg: 'Job deleted successfully!' });
-    }
-  } catch (error) {
-    console.log("user.all-jobs.controller.js => ", error);
-    return res.status(500).json({ msg: 'Server Error' });
-  }
-}
+const DeleteJob = async (req, res) => {}
 
 

[NoCoverage] BlockStatement
controllers/user/user.all-jobs.controller.js:16:7
 }
 
 const DeleteJob = async (req, res) => {
-  try {
-    if (req.body.jobId) {
-      // console.log(req.body.jobId)
-      const job = await JobSchema.findById(req.body.jobId);
-
-      // before this middleware pre will run to delete student's appliedJobs
-      await job.deleteOne();
-      return res.status(200).json({ msg: 'Job deleted successfully!' });
-    }
-  } catch (error) {
+  try {} catch (error) {
     console.log("user.all-jobs.controller.js => ", error);
     return res.status(500).json({ msg: 'Server Error' });

[NoCoverage] ConditionalExpression
controllers/user/user.all-jobs.controller.js:17:9
 
 const DeleteJob = async (req, res) => {
   try {
-    if (req.body.jobId) {
+    if (false) {
       // console.log(req.body.jobId)
       const job = await JobSchema.findById(req.body.jobId);

[NoCoverage] ConditionalExpression
controllers/user/user.all-jobs.controller.js:17:9
 
 const DeleteJob = async (req, res) => {
   try {
-    if (req.body.jobId) {
+    if (true) {
       // console.log(req.body.jobId)
       const job = await JobSchema.findById(req.body.jobId);

[NoCoverage] ObjectLiteral
controllers/user/user.all-jobs.controller.js:23:35
 
       // before this middleware pre will run to delete student's appliedJobs
       await job.deleteOne();
-      return res.status(200).json({ msg: 'Job deleted successfully!' });
+      return res.status(200).json({});
     }
   } catch (error) {

[NoCoverage] StringLiteral
controllers/user/user.all-jobs.controller.js:23:42
 
       // before this middleware pre will run to delete student's appliedJobs
       await job.deleteOne();
-      return res.status(200).json({ msg: 'Job deleted successfully!' });
+      return res.status(200).json({ msg: "" });
     }
   } catch (error) {

[NoCoverage] BlockStatement
controllers/user/user.all-jobs.controller.js:25:19
       await job.deleteOne();
       return res.status(200).json({ msg: 'Job deleted successfully!' });
     }
-  } catch (error) {
-    console.log("user.all-jobs.controller.js => ", error);
-    return res.status(500).json({ msg: 'Server Error' });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
controllers/user/user.all-jobs.controller.js:32:37
 }
 
 
-const JobData = async (req, res) => {
-  try {
-    // pass if tpo is creating new post
-    if (req.params.jobId !== 'undefined') {
-      const job = await JobSchema.findById(req.params.jobId);
-      return res.status(200).json(job);
-    }
-  } catch (error) {
-    // checking if userId is exist or not
-    if (error.name === 'CastError' && error.kind === 'ObjectId') {
-      return res.status(404).json({ msg: 'job data not found' });
-    }
-    console.log("user.all-jobs.controller.js => ", error);
-    return res.status(500).json({ msg: 'Server Error' });
-  }
-}
+const JobData = async (req, res) => {}
 
 const JobWithApplicants = async (req, res) => {

[NoCoverage] BlockStatement
controllers/user/user.all-jobs.controller.js:33:7
 
 
 const JobData = async (req, res) => {
-  try {
-    // pass if tpo is creating new post
-    if (req.params.jobId !== 'undefined') {
-      const job = await JobSchema.findById(req.params.jobId);
-      return res.status(200).json(job);
-    }
-  } catch (error) {
+  try {} catch (error) {
     // checking if userId is exist or not
     if (error.name === 'CastError' && error.kind === 'ObjectId') {

[NoCoverage] ConditionalExpression
controllers/user/user.all-jobs.controller.js:35:9
 const JobData = async (req, res) => {
   try {
     // pass if tpo is creating new post
-    if (req.params.jobId !== 'undefined') {
+    if (false) {
       const job = await JobSchema.findById(req.params.jobId);
       return res.status(200).json(job);

[NoCoverage] EqualityOperator
controllers/user/user.all-jobs.controller.js:35:9
 const JobData = async (req, res) => {
   try {
     // pass if tpo is creating new post
-    if (req.params.jobId !== 'undefined') {
+    if (req.params.jobId === 'undefined') {
       const job = await JobSchema.findById(req.params.jobId);
       return res.status(200).json(job);

[NoCoverage] BlockStatement
controllers/user/user.all-jobs.controller.js:39:19
       const job = await JobSchema.findById(req.params.jobId);
       return res.status(200).json(job);
     }
-  } catch (error) {
-    // checking if userId is exist or not
-    if (error.name === 'CastError' && error.kind === 'ObjectId') {
-      return res.status(404).json({ msg: 'job data not found' });
-    }
-    console.log("user.all-jobs.controller.js => ", error);
-    return res.status(500).json({ msg: 'Server Error' });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] LogicalOperator
controllers/user/user.all-jobs.controller.js:41:9
     }
   } catch (error) {
     // checking if userId is exist or not
-    if (error.name === 'CastError' && error.kind === 'ObjectId') {
+    if (error.name === 'CastError' || error.kind === 'ObjectId') {
       return res.status(404).json({ msg: 'job data not found' });
     }

[NoCoverage] ConditionalExpression
controllers/user/user.all-jobs.controller.js:41:9
     }
   } catch (error) {
     // checking if userId is exist or not
-    if (error.name === 'CastError' && error.kind === 'ObjectId') {
+    if (false) {
       return res.status(404).json({ msg: 'job data not found' });
     }

[NoCoverage] StringLiteral
controllers/user/user.all-jobs.controller.js:44:17
     if (error.name === 'CastError' && error.kind === 'ObjectId') {
       return res.status(404).json({ msg: 'job data not found' });
     }
-    console.log("user.all-jobs.controller.js => ", error);
+    console.log("", error);
     return res.status(500).json({ msg: 'Server Error' });
   }

[NoCoverage] BlockStatement
controllers/user/user.all-jobs.controller.js:50:7
 }
 
 const JobWithApplicants = async (req, res) => {
-  try {
-    const job = await JobSchema.findById(req.params.jobId)
-      .populate({
-        path: 'applicants.studentId',
-        select: '_id first_name last_name email' // Select only name and email fields
-      });
-
-    if (!job) {
-      return res.status(404).json({ msg: 'Job not found!' });
-    }
-
-    // Transform the applicants data for your table
-    const applicantsList = job.applicants.map(applicant => ({
-      id: applicant.studentId._id,
-      name: applicant.studentId.first_name + " " + applicant.studentId.last_name,
-      email: applicant.studentId.email,
-      currentRound: applicant.currentRound,
-      status: applicant.status,
-      appliedAt: applicant.appliedAt,
-    }));
-
-    return res.status(200).json({ applicantsList });
-  } catch (error) {
+  try {} catch (error) {
     console.log("Error fetching job with applicants => ", error);
     return res.status(500).json({ msg: 'Server Error' });

[NoCoverage] ObjectLiteral
controllers/user/user.all-jobs.controller.js:52:17
 const JobWithApplicants = async (req, res) => {
   try {
     const job = await JobSchema.findById(req.params.jobId)
-      .populate({
-        path: 'applicants.studentId',
-        select: '_id first_name last_name email' // Select only name and email fields
-      });
+      .populate({});
 
     if (!job) {

[NoCoverage] StringLiteral
controllers/user/user.all-jobs.controller.js:54:17
     const job = await JobSchema.findById(req.params.jobId)
       .populate({
         path: 'applicants.studentId',
-        select: '_id first_name last_name email' // Select only name and email fields
+        select: "" // Select only name and email fields
       });
 

[NoCoverage] ConditionalExpression
controllers/user/user.all-jobs.controller.js:57:9
         select: '_id first_name last_name email' // Select only name and email fields
       });
 
-    if (!job) {
+    if (false) {
       return res.status(404).json({ msg: 'Job not found!' });
     }

[NoCoverage] BooleanLiteral
controllers/user/user.all-jobs.controller.js:57:9
         select: '_id first_name last_name email' // Select only name and email fields
       });
 
-    if (!job) {
+    if (job) {
       return res.status(404).json({ msg: 'Job not found!' });
     }

[NoCoverage] StringLiteral
controllers/user/user.all-jobs.controller.js:58:42
       });
 
     if (!job) {
-      return res.status(404).json({ msg: 'Job not found!' });
+      return res.status(404).json({ msg: "" });
     }
 

[NoCoverage] ArrowFunction
controllers/user/user.all-jobs.controller.js:62:47
     }
 
     // Transform the applicants data for your table
-    const applicantsList = job.applicants.map(applicant => ({
-      id: applicant.studentId._id,
-      name: applicant.studentId.first_name + " " + applicant.studentId.last_name,
-      email: applicant.studentId.email,
-      currentRound: applicant.currentRound,
-      status: applicant.status,
-      appliedAt: applicant.appliedAt,
-    }));
+    const applicantsList = job.applicants.map(() => undefined);
 
     return res.status(200).json({ applicantsList });

[NoCoverage] ObjectLiteral
controllers/user/user.all-jobs.controller.js:62:61
     }
 
     // Transform the applicants data for your table
-    const applicantsList = job.applicants.map(applicant => ({
-      id: applicant.studentId._id,
-      name: applicant.studentId.first_name + " " + applicant.studentId.last_name,
-      email: applicant.studentId.email,
-      currentRound: applicant.currentRound,
-      status: applicant.status,
-      appliedAt: applicant.appliedAt,
-    }));
+    const applicantsList = job.applicants.map(applicant => ({}));
 
     return res.status(200).json({ applicantsList });

[NoCoverage] ObjectLiteral
controllers/user/user.all-jobs.controller.js:71:33
       appliedAt: applicant.appliedAt,
     }));
 
-    return res.status(200).json({ applicantsList });
+    return res.status(200).json({});
   } catch (error) {
     console.log("Error fetching job with applicants => ", error);

[NoCoverage] BlockStatement
controllers/user/user.all-jobs.controller.js:72:19
     }));
 
     return res.status(200).json({ applicantsList });
-  } catch (error) {
-    console.log("Error fetching job with applicants => ", error);
-    return res.status(500).json({ msg: 'Server Error' });
-  }
+  } catch (error) {}
 };
 

[NoCoverage] StringLiteral
controllers/user/user.all-jobs.controller.js:73:17
 
     return res.status(200).json({ applicantsList });
   } catch (error) {
-    console.log("Error fetching job with applicants => ", error);
+    console.log("", error);
     return res.status(500).json({ msg: 'Server Error' });
   }

[NoCoverage] ObjectLiteral
controllers/user/user.all-jobs.controller.js:74:33
     return res.status(200).json({ applicantsList });
   } catch (error) {
     console.log("Error fetching job with applicants => ", error);
-    return res.status(500).json({ msg: 'Server Error' });
+    return res.status(500).json({});
   }
 };

[NoCoverage] BlockStatement
controllers/user/user.all-jobs.controller.js:80:7
 
 
 const StudentJobsApplied = async (req, res) => {
-  try {
-    // Find all jobs where the student has applied
-    const appliedJobs = await JobSchema.find({ 'applicants.studentId': req.params.studentId })
-      .populate('company', 'companyName') // Populates the company field to get companyName
-      .select('jobTitle _id salary applicationDeadline applicants company') // Select the required fields
-      .lean(); // Use lean to return plain JS objects, making it faster for read operations
-    // console.log(appliedJobs)
-    // Add the number of applicants for each job
-    const result = appliedJobs.map(job => {
-      const applicantDetails = job.applicants.find(applicant => applicant.studentId.toString() === req.params.studentId);
-      return {
-        jobTitle: job.jobTitle,
-        jobId: job._id,
-        salary: job.salary,
-        applicationDeadline: job.applicationDeadline,
-        companyName: job.company.companyName,
-        numberOfApplicants: job.applicants.length, // Count number of applicants
-        appliedAt: applicantDetails.appliedAt, // Fetch the appliedAt date for this student
-        status: applicantDetails.status // Fetch the status for this student's application
-      };
-    });
-
-    return res.status(200).json(result);
-  } catch (error) {
+  try {} catch (error) {
     console.error("Error fetching student applied jobs => ", error);
     return res.status(500).json({ msg: 'Server error' });

[NoCoverage] StringLiteral
controllers/user/user.all-jobs.controller.js:83:17
   try {
     // Find all jobs where the student has applied
     const appliedJobs = await JobSchema.find({ 'applicants.studentId': req.params.studentId })
-      .populate('company', 'companyName') // Populates the company field to get companyName
+      .populate("", 'companyName') // Populates the company field to get companyName
       .select('jobTitle _id salary applicationDeadline applicants company') // Select the required fields
       .lean(); // Use lean to return plain JS objects, making it faster for read operations

[NoCoverage] StringLiteral
controllers/user/user.all-jobs.controller.js:83:28
   try {
     // Find all jobs where the student has applied
     const appliedJobs = await JobSchema.find({ 'applicants.studentId': req.params.studentId })
-      .populate('company', 'companyName') // Populates the company field to get companyName
+      .populate('company', "") // Populates the company field to get companyName
       .select('jobTitle _id salary applicationDeadline applicants company') // Select the required fields
       .lean(); // Use lean to return plain JS objects, making it faster for read operations

[NoCoverage] BlockStatement
controllers/user/user.all-jobs.controller.js:88:43
       .lean(); // Use lean to return plain JS objects, making it faster for read operations
     // console.log(appliedJobs)
     // Add the number of applicants for each job
-    const result = appliedJobs.map(job => {
-      const applicantDetails = job.applicants.find(applicant => applicant.studentId.toString() === req.params.studentId);
-      return {
-        jobTitle: job.jobTitle,
-        jobId: job._id,
-        salary: job.salary,
-        applicationDeadline: job.applicationDeadline,
-        companyName: job.company.companyName,
-        numberOfApplicants: job.applicants.length, // Count number of applicants
-        appliedAt: applicantDetails.appliedAt, // Fetch the appliedAt date for this student
-        status: applicantDetails.status // Fetch the status for this student's application
-      };
-    });
+    const result = appliedJobs.map(job => {});
 
     return res.status(200).json(result);

[NoCoverage] EqualityOperator
controllers/user/user.all-jobs.controller.js:89:65
     // console.log(appliedJobs)
     // Add the number of applicants for each job
     const result = appliedJobs.map(job => {
-      const applicantDetails = job.applicants.find(applicant => applicant.studentId.toString() === req.params.studentId);
+      const applicantDetails = job.applicants.find(applicant => applicant.studentId.toString() !== req.params.studentId);
       return {
         jobTitle: job.jobTitle,

[NoCoverage] ConditionalExpression
controllers/user/user.all-jobs.controller.js:89:65
     // console.log(appliedJobs)
     // Add the number of applicants for each job
     const result = appliedJobs.map(job => {
-      const applicantDetails = job.applicants.find(applicant => applicant.studentId.toString() === req.params.studentId);
+      const applicantDetails = job.applicants.find(applicant => true);
       return {
         jobTitle: job.jobTitle,

[NoCoverage] BlockStatement
controllers/user/user.all-jobs.controller.js:103:19
     });
 
     return res.status(200).json(result);
-  } catch (error) {
-    console.error("Error fetching student applied jobs => ", error);
-    return res.status(500).json({ msg: 'Server error' });
-  }
+  } catch (error) {}
 };
 

[NoCoverage] ObjectLiteral
controllers/user/user.all-jobs.controller.js:105:33
     return res.status(200).json(result);
   } catch (error) {
     console.error("Error fetching student applied jobs => ", error);
-    return res.status(500).json({ msg: 'Server error' });
+    return res.status(500).json({});
   }
 };
