[NoCoverage] BlockStatement
controllers/user/user.all-users.controller.js:4:41
 const User = require("../../models/user.model");
 
 
-const AllUsersLen = async (req, res) => {
-  try {
-    const studentUsers = (await User.find({ role: "student" })).length;
-    const studentApprovalPendingUsers = (await User.find({ role: "student" })).filter(ele => !ele.studentProfile.isApproved).length;
-    const tpoUsers = (await User.find({ role: "tpo_admin" })).length;
-    const managementUsers = (await User.find({ role: "management_admin" })).length;
-    const superUsers = (await User.find({ role: "superuser" })).length;
-
-    // console.log(studentUsers.length)
-    return res.json({ studentUsers, studentApprovalPendingUsers, tpoUsers, managementUsers, superUsers });
-  } catch (error) {
-    console.log("user.route.js => ", error);
-    return res.json({ msg: "Internal Server Error!" });
-  }
-}
+const AllUsersLen = async (req, res) => {}
 
 

[NoCoverage] BlockStatement
controllers/user/user.all-users.controller.js:5:7
 
 
 const AllUsersLen = async (req, res) => {
-  try {
-    const studentUsers = (await User.find({ role: "student" })).length;
-    const studentApprovalPendingUsers = (await User.find({ role: "student" })).filter(ele => !ele.studentProfile.isApproved).length;
-    const tpoUsers = (await User.find({ role: "tpo_admin" })).length;
-    const managementUsers = (await User.find({ role: "management_admin" })).length;
-    const superUsers = (await User.find({ role: "superuser" })).length;
-
-    // console.log(studentUsers.length)
-    return res.json({ studentUsers, studentApprovalPendingUsers, tpoUsers, managementUsers, superUsers });
-  } catch (error) {
+  try {} catch (error) {
     console.log("user.route.js => ", error);
     return res.json({ msg: "Internal Server Error!" });

[NoCoverage] ArrowFunction
controllers/user/user.all-users.controller.js:7:87
 const AllUsersLen = async (req, res) => {
   try {
     const studentUsers = (await User.find({ role: "student" })).length;
-    const studentApprovalPendingUsers = (await User.find({ role: "student" })).filter(ele => !ele.studentProfile.isApproved).length;
+    const studentApprovalPendingUsers = (await User.find({ role: "student" })).filter(() => undefined).length;
     const tpoUsers = (await User.find({ role: "tpo_admin" })).length;
     const managementUsers = (await User.find({ role: "management_admin" })).length;

[NoCoverage] MethodExpression
controllers/user/user.all-users.controller.js:7:41
 const AllUsersLen = async (req, res) => {
   try {
     const studentUsers = (await User.find({ role: "student" })).length;
-    const studentApprovalPendingUsers = (await User.find({ role: "student" })).filter(ele => !ele.studentProfile.isApproved).length;
+    const studentApprovalPendingUsers = await User.find({
+  role: "student"
+}).length;
     const tpoUsers = (await User.find({ role: "tpo_admin" })).length;
     const managementUsers = (await User.find({ role: "management_admin" })).length;

[NoCoverage] ObjectLiteral
controllers/user/user.all-users.controller.js:10:41
     const studentApprovalPendingUsers = (await User.find({ role: "student" })).filter(ele => !ele.studentProfile.isApproved).length;
     const tpoUsers = (await User.find({ role: "tpo_admin" })).length;
     const managementUsers = (await User.find({ role: "management_admin" })).length;
-    const superUsers = (await User.find({ role: "superuser" })).length;
+    const superUsers = (await User.find({})).length;
 
     // console.log(studentUsers.length)

[NoCoverage] StringLiteral
controllers/user/user.all-users.controller.js:10:49
     const studentApprovalPendingUsers = (await User.find({ role: "student" })).filter(ele => !ele.studentProfile.isApproved).length;
     const tpoUsers = (await User.find({ role: "tpo_admin" })).length;
     const managementUsers = (await User.find({ role: "management_admin" })).length;
-    const superUsers = (await User.find({ role: "superuser" })).length;
+    const superUsers = (await User.find({ role: "" })).length;
 
     // console.log(studentUsers.length)

[NoCoverage] BlockStatement
controllers/user/user.all-users.controller.js:14:19
 
     // console.log(studentUsers.length)
     return res.json({ studentUsers, studentApprovalPendingUsers, tpoUsers, managementUsers, superUsers });
-  } catch (error) {
-    console.log("user.route.js => ", error);
-    return res.json({ msg: "Internal Server Error!" });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
controllers/user/user.all-users.controller.js:15:17
     // console.log(studentUsers.length)
     return res.json({ studentUsers, studentApprovalPendingUsers, tpoUsers, managementUsers, superUsers });
   } catch (error) {
-    console.log("user.route.js => ", error);
+    console.log("", error);
     return res.json({ msg: "Internal Server Error!" });
   }

[NoCoverage] StringLiteral
controllers/user/user.all-users.controller.js:16:28
     return res.json({ studentUsers, studentApprovalPendingUsers, tpoUsers, managementUsers, superUsers });
   } catch (error) {
     console.log("user.route.js => ", error);
-    return res.json({ msg: "Internal Server Error!" });
+    return res.json({ msg: "" });
   }
 }
