[NoCoverage] StringLiteral
controllers/user/user.detail.controller.js:4:9
 const UserDetail = async (req, res) => {
   // console.log(req.user)
   return res.json({
-    id: `${req.user.id}`,
+    id: ``,
     // common data
     first_name: `${req.user.first_name}`,

[NoCoverage] StringLiteral
controllers/user/user.detail.controller.js:7:18
     id: `${req.user.id}`,
     // common data
     first_name: `${req.user.first_name}`,
-    middle_name: `${req.user.middle_name}`,
+    middle_name: ``,
     last_name: `${req.user.last_name}`,
     email: `${req.user.email}`,

[NoCoverage] StringLiteral
controllers/user/user.detail.controller.js:12:14
     email: `${req.user.email}`,
     number: `${req.user.number}`,
     password: `${req.user.password}`,
-    profile: `${req.user.profile}`,
+    profile: ``,
     gender: `${req.user.gender}`,
     dateOfBirth: `${req.user.dateOfBirth}`,

[NoCoverage] StringLiteral
controllers/user/user.detail.controller.js:13:13
     number: `${req.user.number}`,
     password: `${req.user.password}`,
     profile: `${req.user.profile}`,
-    gender: `${req.user.gender}`,
+    gender: ``,
     dateOfBirth: `${req.user.dateOfBirth}`,
     createdAt: `${req.user.createdAt}`,

[NoCoverage] StringLiteral
controllers/user/user.detail.controller.js:22:11
       pincode: `${req.user.fullAddress.pincode}`,
     },
 
-    role: `${req.user.role}`,
+    role: ``,
     isProfileCompleted: `${req.user.isProfileCompleted}`,
 

[NoCoverage] StringLiteral
controllers/user/user.detail.controller.js:23:25
     },
 
     role: `${req.user.role}`,
-    isProfileCompleted: `${req.user.isProfileCompleted}`,
+    isProfileCompleted: ``,
 
     // student data

[NoCoverage] StringLiteral
controllers/user/user.detail.controller.js:27:19
 
     // student data
     studentProfile: {
-      rollNumber: `${req.user.studentProfile.rollNumber}`,
+      rollNumber: ``,
       uin: `${req.user.studentProfile.UIN}`,
       department: `${req.user.studentProfile.department}`,

[NoCoverage] StringLiteral
controllers/user/user.detail.controller.js:30:13
       rollNumber: `${req.user.studentProfile.rollNumber}`,
       uin: `${req.user.studentProfile.UIN}`,
       department: `${req.user.studentProfile.department}`,
-      year: `${req.user.studentProfile.year}`,
+      year: ``,
       addmissionYear: `${req.user.studentProfile.addmissionYear}`,
       gap: `${req.user.studentProfile.gap}`,

[NoCoverage] StringLiteral
controllers/user/user.detail.controller.js:32:12
       department: `${req.user.studentProfile.department}`,
       year: `${req.user.studentProfile.year}`,
       addmissionYear: `${req.user.studentProfile.addmissionYear}`,
-      gap: `${req.user.studentProfile.gap}`,
+      gap: ``,
       liveKT: `${req.user.studentProfile.liveKT}`,
       resume: `${req.user.studentProfile.resume}`,

[NoCoverage] StringLiteral
controllers/user/user.detail.controller.js:33:15
       year: `${req.user.studentProfile.year}`,
       addmissionYear: `${req.user.studentProfile.addmissionYear}`,
       gap: `${req.user.studentProfile.gap}`,
-      liveKT: `${req.user.studentProfile.liveKT}`,
+      liveKT: ``,
       resume: `${req.user.studentProfile.resume}`,
       SGPA: {

[NoCoverage] ObjectLiteral
controllers/user/user.detail.controller.js:35:13
       gap: `${req.user.studentProfile.gap}`,
       liveKT: `${req.user.studentProfile.liveKT}`,
       resume: `${req.user.studentProfile.resume}`,
-      SGPA: {
-        sem1: `${req.user.studentProfile.SGPA.sem1}`,
-        sem2: `${req.user.studentProfile.SGPA.sem2}`,
-        sem3: `${req.user.studentProfile.SGPA.sem3}`,
-        sem4: `${req.user.studentProfile.SGPA.sem4}`,
-        sem5: `${req.user.studentProfile.SGPA.sem5}`,
-        sem6: `${req.user.studentProfile.SGPA.sem6}`,
-        sem7: `${req.user.studentProfile.SGPA.sem7}`,
-        sem8: `${req.user.studentProfile.SGPA.sem8}`,
-      },
+      SGPA: {},
       pastQualification: {
         ssc: {

[NoCoverage] StringLiteral
controllers/user/user.detail.controller.js:38:15
       SGPA: {
         sem1: `${req.user.studentProfile.SGPA.sem1}`,
         sem2: `${req.user.studentProfile.SGPA.sem2}`,
-        sem3: `${req.user.studentProfile.SGPA.sem3}`,
+        sem3: ``,
         sem4: `${req.user.studentProfile.SGPA.sem4}`,
         sem5: `${req.user.studentProfile.SGPA.sem5}`,

[NoCoverage] StringLiteral
controllers/user/user.detail.controller.js:43:15
         sem5: `${req.user.studentProfile.SGPA.sem5}`,
         sem6: `${req.user.studentProfile.SGPA.sem6}`,
         sem7: `${req.user.studentProfile.SGPA.sem7}`,
-        sem8: `${req.user.studentProfile.SGPA.sem8}`,
+        sem8: ``,
       },
       pastQualification: {

[NoCoverage] ObjectLiteral
controllers/user/user.detail.controller.js:45:26
         sem7: `${req.user.studentProfile.SGPA.sem7}`,
         sem8: `${req.user.studentProfile.SGPA.sem8}`,
       },
-      pastQualification: {
-        ssc: {
-          board: `${req.user.studentProfile.pastQualification.ssc.board}`,
-          percentage: `${req.user.studentProfile.pastQualification.ssc.percentage}`,
-          year: `${req.user.studentProfile.pastQualification.ssc.year}`
-        },
-        hsc: {
-          board: `${req.user.studentProfile.pastQualification.hsc.board}`,
-          percentage: `${req.user.studentProfile.pastQualification.hsc.percentage}`,
-          year: `${req.user.studentProfile.pastQualification.hsc.year}`
-        },
-        diploma: {
-          board: `${req.user.studentProfile.pastQualification.diploma.board}`,
-          percentage: `${req.user.studentProfile.pastQualification.diploma.percentage}`,
-          year: `${req.user.studentProfile.pastQualification.diploma.year}`
-        },
-      },
+      pastQualification: {},
     }
 

[NoCoverage] ObjectLiteral
controllers/user/user.detail.controller.js:46:14
         sem8: `${req.user.studentProfile.SGPA.sem8}`,
       },
       pastQualification: {
-        ssc: {
-          board: `${req.user.studentProfile.pastQualification.ssc.board}`,
-          percentage: `${req.user.studentProfile.pastQualification.ssc.percentage}`,
-          year: `${req.user.studentProfile.pastQualification.ssc.year}`
-        },
+        ssc: {},
         hsc: {
           board: `${req.user.studentProfile.pastQualification.hsc.board}`,

[NoCoverage] ObjectLiteral
controllers/user/user.detail.controller.js:51:14
           percentage: `${req.user.studentProfile.pastQualification.ssc.percentage}`,
           year: `${req.user.studentProfile.pastQualification.ssc.year}`
         },
-        hsc: {
-          board: `${req.user.studentProfile.pastQualification.hsc.board}`,
-          percentage: `${req.user.studentProfile.pastQualification.hsc.percentage}`,
-          year: `${req.user.studentProfile.pastQualification.hsc.year}`
-        },
+        hsc: {},
         diploma: {
           board: `${req.user.studentProfile.pastQualification.diploma.board}`,

[NoCoverage] StringLiteral
controllers/user/user.detail.controller.js:53:23
         },
         hsc: {
           board: `${req.user.studentProfile.pastQualification.hsc.board}`,
-          percentage: `${req.user.studentProfile.pastQualification.hsc.percentage}`,
+          percentage: ``,
           year: `${req.user.studentProfile.pastQualification.hsc.year}`
         },
