[NoCoverage] BlockStatement
controllers/user/user.show-data.js:6:7
 const userData = async (req, res) => {
   const { userId } = req.params;
   // console.log(userId);
-  try {
-    // Fetch user details from the database
-    // console.log(userId)
-    const user = await User.findById(userId)
-      .populate({
-        path: 'studentProfile.appliedJobs.jobId',
-        populate: { path: 'company', select: 'companyName' } // Populates companyName from the Company model
-      });
-
-    // Check if user exists
-    if (!user)
-      return res.status(404).json({ msg: 'Student not found' });
-
-
-    // Return the user details
-    return res.json(user);
-  } catch (error) {
+  try {} catch (error) {
     // checking if userId is exist or not
     if (error.name === 'CastError' && error.kind === 'ObjectId') {

[NoCoverage] ObjectLiteral
controllers/user/user.show-data.js:12:19
     const user = await User.findById(userId)
       .populate({
         path: 'studentProfile.appliedJobs.jobId',
-        populate: { path: 'company', select: 'companyName' } // Populates companyName from the Company model
+        populate: {} // Populates companyName from the Company model
       });
 

[NoCoverage] BooleanLiteral
controllers/user/user.show-data.js:16:9
       });
 
     // Check if user exists
-    if (!user)
+    if (user)
       return res.status(404).json({ msg: 'Student not found' });
 

[NoCoverage] ConditionalExpression
controllers/user/user.show-data.js:16:9
       });
 
     // Check if user exists
-    if (!user)
+    if (true)
       return res.status(404).json({ msg: 'Student not found' });
 

[NoCoverage] ObjectLiteral
controllers/user/user.show-data.js:17:35
 
     // Check if user exists
     if (!user)
-      return res.status(404).json({ msg: 'Student not found' });
+      return res.status(404).json({});
 
 

[NoCoverage] BlockStatement
controllers/user/user.show-data.js:22:19
 
     // Return the user details
     return res.json(user);
-  } catch (error) {
-    // checking if userId is exist or not
-    if (error.name === 'CastError' && error.kind === 'ObjectId') {
-      return res.status(404).json({ msg: 'user not found' });
-    }
-    console.error('Error fetching user details:', error);
-    return res.status(500).json({ msg: 'Server error' });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] EqualityOperator
controllers/user/user.show-data.js:24:9
     return res.json(user);
   } catch (error) {
     // checking if userId is exist or not
-    if (error.name === 'CastError' && error.kind === 'ObjectId') {
+    if (error.name !== 'CastError' && error.kind === 'ObjectId') {
       return res.status(404).json({ msg: 'user not found' });
     }

[NoCoverage] StringLiteral
controllers/user/user.show-data.js:25:42
   } catch (error) {
     // checking if userId is exist or not
     if (error.name === 'CastError' && error.kind === 'ObjectId') {
-      return res.status(404).json({ msg: 'user not found' });
+      return res.status(404).json({ msg: "" });
     }
     console.error('Error fetching user details:', error);
