[NoCoverage] BooleanLiteral
controllers/user/user.update-photo.controller.js:6:9
 
 const UpdatePhoto = async (req, res) => {
   try {
-    if (!req.file) return res.status(400).json({ msg: "No file uploaded." });
+    if (req.file) return res.status(400).json({ msg: "No file uploaded." });
 
     const userId = req.body.userId;

[NoCoverage] ConditionalExpression
controllers/user/user.update-photo.controller.js:6:9
 
 const UpdatePhoto = async (req, res) => {
   try {
-    if (!req.file) return res.status(400).json({ msg: "No file uploaded." });
+    if (false) return res.status(400).json({ msg: "No file uploaded." });
 
     const userId = req.body.userId;

[NoCoverage] BooleanLiteral
controllers/user/user.update-photo.controller.js:11:9
     const userId = req.body.userId;
     const user = await User.findById(userId);
 
-    if (!user) return res.status(404).json({ msg: "User not found!" });
+    if (user) return res.status(404).json({ msg: "User not found!" });
 
     // If a previous profile picture exists, delete it from Cloudinary

[NoCoverage] ConditionalExpression
controllers/user/user.update-photo.controller.js:11:9
     const userId = req.body.userId;
     const user = await User.findById(userId);
 
-    if (!user) return res.status(404).json({ msg: "User not found!" });
+    if (true) return res.status(404).json({ msg: "User not found!" });
 
     // If a previous profile picture exists, delete it from Cloudinary

[NoCoverage] ConditionalExpression
controllers/user/user.update-photo.controller.js:14:9
     if (!user) return res.status(404).json({ msg: "User not found!" });
 
     // If a previous profile picture exists, delete it from Cloudinary
-    if (user.profile != "https://res.cloudinary.com/dgu6xwnzx/image/upload/v1743159225/defaultProfileImg_cmmurk.jpg") {
+    if (false) {
       const oldImagePublicId = user.profile.split("/").pop().split(".")[0]; // Extract public ID
       await cloudinary.uploader.destroy(`CPMS/Profile/${oldImagePublicId}`);

[NoCoverage] EqualityOperator
controllers/user/user.update-photo.controller.js:14:9
     if (!user) return res.status(404).json({ msg: "User not found!" });
 
     // If a previous profile picture exists, delete it from Cloudinary
-    if (user.profile != "https://res.cloudinary.com/dgu6xwnzx/image/upload/v1743159225/defaultProfileImg_cmmurk.jpg") {
+    if (user.profile == "https://res.cloudinary.com/dgu6xwnzx/image/upload/v1743159225/defaultProfileImg_cmmurk.jpg") {
       const oldImagePublicId = user.profile.split("/").pop().split(".")[0]; // Extract public ID
       await cloudinary.uploader.destroy(`CPMS/Profile/${oldImagePublicId}`);

[NoCoverage] StringLiteral
controllers/user/user.update-photo.controller.js:15:68
 
     // If a previous profile picture exists, delete it from Cloudinary
     if (user.profile != "https://res.cloudinary.com/dgu6xwnzx/image/upload/v1743159225/defaultProfileImg_cmmurk.jpg") {
-      const oldImagePublicId = user.profile.split("/").pop().split(".")[0]; // Extract public ID
+      const oldImagePublicId = user.profile.split("/").pop().split("")[0]; // Extract public ID
       await cloudinary.uploader.destroy(`CPMS/Profile/${oldImagePublicId}`);
     }

[NoCoverage] ObjectLiteral
controllers/user/user.update-photo.controller.js:31:33
     user.profile = cloudinaryResponse.secure_url;
     await user.save();
 
-    return res.status(201).json({ msg: "Profile Picture Updated Successfully!", url: cloudinaryResponse.secure_url });
+    return res.status(201).json({});
   } catch (error) {
     console.error("Error updating profile picture:", error);

[NoCoverage] BlockStatement
controllers/user/user.update-photo.controller.js:32:19
     await user.save();
 
     return res.status(201).json({ msg: "Profile Picture Updated Successfully!", url: cloudinaryResponse.secure_url });
-  } catch (error) {
-    console.error("Error updating profile picture:", error);
-    return res.status(500).json({ msg: "Server error", error });
-  }
+  } catch (error) {}
 };
 

[NoCoverage] StringLiteral
controllers/user/user.update-photo.controller.js:33:19
 
     return res.status(201).json({ msg: "Profile Picture Updated Successfully!", url: cloudinaryResponse.secure_url });
   } catch (error) {
-    console.error("Error updating profile picture:", error);
+    console.error("", error);
     return res.status(500).json({ msg: "Server error", error });
   }

[NoCoverage] ObjectLiteral
controllers/user/user.update-photo.controller.js:34:33
     return res.status(201).json({ msg: "Profile Picture Updated Successfully!", url: cloudinaryResponse.secure_url });
   } catch (error) {
     console.error("Error updating profile picture:", error);
-    return res.status(500).json({ msg: "Server error", error });
+    return res.status(500).json({});
   }
 };
