[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:8:38
   // console.log("hello ", req.body.studentProfile);
 
   try {
-    const user = await User.findById(req.body._id || req.body.id);
+    const user = await User.findById(true);
 
     if (!user) return res.status(400).json({ msg: "User Doesn't Exist!" });

[NoCoverage] LogicalOperator
controllers/user/user.update-profile.controller.js:8:38
   // console.log("hello ", req.body.studentProfile);
 
   try {
-    const user = await User.findById(req.body._id || req.body.id);
+    const user = await User.findById(req.body._id && req.body.id);
 
     if (!user) return res.status(400).json({ msg: "User Doesn't Exist!" });

[NoCoverage] BooleanLiteral
controllers/user/user.update-profile.controller.js:10:9
   try {
     const user = await User.findById(req.body._id || req.body.id);
 
-    if (!user) return res.status(400).json({ msg: "User Doesn't Exist!" });
+    if (user) return res.status(400).json({ msg: "User Doesn't Exist!" });
 
     // checking if email which is to update is already there or not 

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:10:9
   try {
     const user = await User.findById(req.body._id || req.body.id);
 
-    if (!user) return res.status(400).json({ msg: "User Doesn't Exist!" });
+    if (false) return res.status(400).json({ msg: "User Doesn't Exist!" });
 
     // checking if email which is to update is already there or not 

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:13:9
     if (!user) return res.status(400).json({ msg: "User Doesn't Exist!" });
 
     // checking if email which is to update is already there or not 
-    if (req.body.email !== user.email) {
+    if (true) {
       if (await User.findOne({ email: req.body.email }))
         return res.status(400).json({ msg: "Email is Already Exist, Please Enter Another Email!" });

[NoCoverage] EqualityOperator
controllers/user/user.update-profile.controller.js:13:9
     if (!user) return res.status(400).json({ msg: "User Doesn't Exist!" });
 
     // checking if email which is to update is already there or not 
-    if (req.body.email !== user.email) {
+    if (req.body.email === user.email) {
       if (await User.findOne({ email: req.body.email }))
         return res.status(400).json({ msg: "Email is Already Exist, Please Enter Another Email!" });

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:14:11
 
     // checking if email which is to update is already there or not 
     if (req.body.email !== user.email) {
-      if (await User.findOne({ email: req.body.email }))
+      if (true)
         return res.status(400).json({ msg: "Email is Already Exist, Please Enter Another Email!" });
       else

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:14:11
 
     // checking if email which is to update is already there or not 
     if (req.body.email !== user.email) {
-      if (await User.findOne({ email: req.body.email }))
+      if (false)
         return res.status(400).json({ msg: "Email is Already Exist, Please Enter Another Email!" });
       else

[NoCoverage] ObjectLiteral
controllers/user/user.update-profile.controller.js:15:37
     // checking if email which is to update is already there or not 
     if (req.body.email !== user.email) {
       if (await User.findOne({ email: req.body.email }))
-        return res.status(400).json({ msg: "Email is Already Exist, Please Enter Another Email!" });
+        return res.status(400).json({});
       else
         user.email = req.body.email;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:21:9
     }
 
 
-    if (req.body.studentProfile.UIN !== undefined) {
+    if (true) {
       if (await User.findOne({ 'studentProfile.UIN': req.body.studentProfile.UIN }) !== null)
         return res.status(400).json({ msg: "UIN is Already Exist, Please Enter Correct UIN!" });

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:21:9
     }
 
 
-    if (req.body.studentProfile.UIN !== undefined) {
+    if (false) {
       if (await User.findOne({ 'studentProfile.UIN': req.body.studentProfile.UIN }) !== null)
         return res.status(400).json({ msg: "UIN is Already Exist, Please Enter Correct UIN!" });

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:22:11
 
 
     if (req.body.studentProfile.UIN !== undefined) {
-      if (await User.findOne({ 'studentProfile.UIN': req.body.studentProfile.UIN }) !== null)
+      if (true)
         return res.status(400).json({ msg: "UIN is Already Exist, Please Enter Correct UIN!" });
     }

[NoCoverage] EqualityOperator
controllers/user/user.update-profile.controller.js:22:11
 
 
     if (req.body.studentProfile.UIN !== undefined) {
-      if (await User.findOne({ 'studentProfile.UIN': req.body.studentProfile.UIN }) !== null)
+      if ((await User.findOne({
+  'studentProfile.UIN': req.body.studentProfile.UIN
+})) === null)
         return res.status(400).json({ msg: "UIN is Already Exist, Please Enter Correct UIN!" });
     }

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:26:9
         return res.status(400).json({ msg: "UIN is Already Exist, Please Enter Correct UIN!" });
     }
 
-    if (req.body.first_name) user.first_name = req.body.first_name;
+    if (false) user.first_name = req.body.first_name;
     if (req.body.middle_name) user.middle_name = req.body.middle_name;
     if (req.body.last_name) user.last_name = req.body.last_name;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:26:9
         return res.status(400).json({ msg: "UIN is Already Exist, Please Enter Correct UIN!" });
     }
 
-    if (req.body.first_name) user.first_name = req.body.first_name;
+    if (true) user.first_name = req.body.first_name;
     if (req.body.middle_name) user.middle_name = req.body.middle_name;
     if (req.body.last_name) user.last_name = req.body.last_name;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:27:9
     }
 
     if (req.body.first_name) user.first_name = req.body.first_name;
-    if (req.body.middle_name) user.middle_name = req.body.middle_name;
+    if (false) user.middle_name = req.body.middle_name;
     if (req.body.last_name) user.last_name = req.body.last_name;
     if (req.body.number) user.number = req.body.number;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:27:9
     }
 
     if (req.body.first_name) user.first_name = req.body.first_name;
-    if (req.body.middle_name) user.middle_name = req.body.middle_name;
+    if (true) user.middle_name = req.body.middle_name;
     if (req.body.last_name) user.last_name = req.body.last_name;
     if (req.body.number) user.number = req.body.number;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:28:9
 
     if (req.body.first_name) user.first_name = req.body.first_name;
     if (req.body.middle_name) user.middle_name = req.body.middle_name;
-    if (req.body.last_name) user.last_name = req.body.last_name;
+    if (false) user.last_name = req.body.last_name;
     if (req.body.number) user.number = req.body.number;
     if (req.body.gender) user.gender = req.body.gender;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:28:9
 
     if (req.body.first_name) user.first_name = req.body.first_name;
     if (req.body.middle_name) user.middle_name = req.body.middle_name;
-    if (req.body.last_name) user.last_name = req.body.last_name;
+    if (true) user.last_name = req.body.last_name;
     if (req.body.number) user.number = req.body.number;
     if (req.body.gender) user.gender = req.body.gender;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:29:9
     if (req.body.first_name) user.first_name = req.body.first_name;
     if (req.body.middle_name) user.middle_name = req.body.middle_name;
     if (req.body.last_name) user.last_name = req.body.last_name;
-    if (req.body.number) user.number = req.body.number;
+    if (false) user.number = req.body.number;
     if (req.body.gender) user.gender = req.body.gender;
     if (req.body.dateOfBirth) user.dateOfBirth = req.body.dateOfBirth;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:29:9
     if (req.body.first_name) user.first_name = req.body.first_name;
     if (req.body.middle_name) user.middle_name = req.body.middle_name;
     if (req.body.last_name) user.last_name = req.body.last_name;
-    if (req.body.number) user.number = req.body.number;
+    if (true) user.number = req.body.number;
     if (req.body.gender) user.gender = req.body.gender;
     if (req.body.dateOfBirth) user.dateOfBirth = req.body.dateOfBirth;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:30:9
     if (req.body.middle_name) user.middle_name = req.body.middle_name;
     if (req.body.last_name) user.last_name = req.body.last_name;
     if (req.body.number) user.number = req.body.number;
-    if (req.body.gender) user.gender = req.body.gender;
+    if (true) user.gender = req.body.gender;
     if (req.body.dateOfBirth) user.dateOfBirth = req.body.dateOfBirth;
     if (req.body.profile) user.profile = req.body.profile;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:30:9
     if (req.body.middle_name) user.middle_name = req.body.middle_name;
     if (req.body.last_name) user.last_name = req.body.last_name;
     if (req.body.number) user.number = req.body.number;
-    if (req.body.gender) user.gender = req.body.gender;
+    if (false) user.gender = req.body.gender;
     if (req.body.dateOfBirth) user.dateOfBirth = req.body.dateOfBirth;
     if (req.body.profile) user.profile = req.body.profile;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:31:9
     if (req.body.last_name) user.last_name = req.body.last_name;
     if (req.body.number) user.number = req.body.number;
     if (req.body.gender) user.gender = req.body.gender;
-    if (req.body.dateOfBirth) user.dateOfBirth = req.body.dateOfBirth;
+    if (false) user.dateOfBirth = req.body.dateOfBirth;
     if (req.body.profile) user.profile = req.body.profile;
     if (req.body.fullAddress) {

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:31:9
     if (req.body.last_name) user.last_name = req.body.last_name;
     if (req.body.number) user.number = req.body.number;
     if (req.body.gender) user.gender = req.body.gender;
-    if (req.body.dateOfBirth) user.dateOfBirth = req.body.dateOfBirth;
+    if (true) user.dateOfBirth = req.body.dateOfBirth;
     if (req.body.profile) user.profile = req.body.profile;
     if (req.body.fullAddress) {

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:32:9
     if (req.body.number) user.number = req.body.number;
     if (req.body.gender) user.gender = req.body.gender;
     if (req.body.dateOfBirth) user.dateOfBirth = req.body.dateOfBirth;
-    if (req.body.profile) user.profile = req.body.profile;
+    if (false) user.profile = req.body.profile;
     if (req.body.fullAddress) {
       if (req.body.fullAddress.address) user.fullAddress.address = req.body.fullAddress.address;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:32:9
     if (req.body.number) user.number = req.body.number;
     if (req.body.gender) user.gender = req.body.gender;
     if (req.body.dateOfBirth) user.dateOfBirth = req.body.dateOfBirth;
-    if (req.body.profile) user.profile = req.body.profile;
+    if (true) user.profile = req.body.profile;
     if (req.body.fullAddress) {
       if (req.body.fullAddress.address) user.fullAddress.address = req.body.fullAddress.address;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:33:9
     if (req.body.gender) user.gender = req.body.gender;
     if (req.body.dateOfBirth) user.dateOfBirth = req.body.dateOfBirth;
     if (req.body.profile) user.profile = req.body.profile;
-    if (req.body.fullAddress) {
+    if (true) {
       if (req.body.fullAddress.address) user.fullAddress.address = req.body.fullAddress.address;
       if (req.body.fullAddress.pincode) user.fullAddress.pincode = req.body.fullAddress.pincode;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:33:9
     if (req.body.gender) user.gender = req.body.gender;
     if (req.body.dateOfBirth) user.dateOfBirth = req.body.dateOfBirth;
     if (req.body.profile) user.profile = req.body.profile;
-    if (req.body.fullAddress) {
+    if (false) {
       if (req.body.fullAddress.address) user.fullAddress.address = req.body.fullAddress.address;
       if (req.body.fullAddress.pincode) user.fullAddress.pincode = req.body.fullAddress.pincode;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:34:11
     if (req.body.dateOfBirth) user.dateOfBirth = req.body.dateOfBirth;
     if (req.body.profile) user.profile = req.body.profile;
     if (req.body.fullAddress) {
-      if (req.body.fullAddress.address) user.fullAddress.address = req.body.fullAddress.address;
+      if (false) user.fullAddress.address = req.body.fullAddress.address;
       if (req.body.fullAddress.pincode) user.fullAddress.pincode = req.body.fullAddress.pincode;
     }

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:34:11
     if (req.body.dateOfBirth) user.dateOfBirth = req.body.dateOfBirth;
     if (req.body.profile) user.profile = req.body.profile;
     if (req.body.fullAddress) {
-      if (req.body.fullAddress.address) user.fullAddress.address = req.body.fullAddress.address;
+      if (true) user.fullAddress.address = req.body.fullAddress.address;
       if (req.body.fullAddress.pincode) user.fullAddress.pincode = req.body.fullAddress.pincode;
     }

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:35:11
     if (req.body.profile) user.profile = req.body.profile;
     if (req.body.fullAddress) {
       if (req.body.fullAddress.address) user.fullAddress.address = req.body.fullAddress.address;
-      if (req.body.fullAddress.pincode) user.fullAddress.pincode = req.body.fullAddress.pincode;
+      if (false) user.fullAddress.pincode = req.body.fullAddress.pincode;
     }
 

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:35:11
     if (req.body.profile) user.profile = req.body.profile;
     if (req.body.fullAddress) {
       if (req.body.fullAddress.address) user.fullAddress.address = req.body.fullAddress.address;
-      if (req.body.fullAddress.pincode) user.fullAddress.pincode = req.body.fullAddress.pincode;
+      if (true) user.fullAddress.pincode = req.body.fullAddress.pincode;
     }
 

[NoCoverage] LogicalOperator
controllers/user/user.update-profile.controller.js:39:9
     }
 
     // Check for student-specific fields
-    if (user.role === "student" && req.body.studentProfile) {
+    if (user.role === "student" || req.body.studentProfile) {
       if (req.body.studentProfile.rollNumber) user.studentProfile.rollNumber = req.body.studentProfile.rollNumber;
       if (req.body.studentProfile.UIN) user.studentProfile.UIN = req.body.studentProfile.UIN;

[NoCoverage] EqualityOperator
controllers/user/user.update-profile.controller.js:39:9
     }
 
     // Check for student-specific fields
-    if (user.role === "student" && req.body.studentProfile) {
+    if (user.role !== "student" && req.body.studentProfile) {
       if (req.body.studentProfile.rollNumber) user.studentProfile.rollNumber = req.body.studentProfile.rollNumber;
       if (req.body.studentProfile.UIN) user.studentProfile.UIN = req.body.studentProfile.UIN;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:40:11
 
     // Check for student-specific fields
     if (user.role === "student" && req.body.studentProfile) {
-      if (req.body.studentProfile.rollNumber) user.studentProfile.rollNumber = req.body.studentProfile.rollNumber;
+      if (true) user.studentProfile.rollNumber = req.body.studentProfile.rollNumber;
       if (req.body.studentProfile.UIN) user.studentProfile.UIN = req.body.studentProfile.UIN;
       if (req.body.studentProfile.department) user.studentProfile.department = req.body.studentProfile.department;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:40:11
 
     // Check for student-specific fields
     if (user.role === "student" && req.body.studentProfile) {
-      if (req.body.studentProfile.rollNumber) user.studentProfile.rollNumber = req.body.studentProfile.rollNumber;
+      if (false) user.studentProfile.rollNumber = req.body.studentProfile.rollNumber;
       if (req.body.studentProfile.UIN) user.studentProfile.UIN = req.body.studentProfile.UIN;
       if (req.body.studentProfile.department) user.studentProfile.department = req.body.studentProfile.department;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:41:11
     // Check for student-specific fields
     if (user.role === "student" && req.body.studentProfile) {
       if (req.body.studentProfile.rollNumber) user.studentProfile.rollNumber = req.body.studentProfile.rollNumber;
-      if (req.body.studentProfile.UIN) user.studentProfile.UIN = req.body.studentProfile.UIN;
+      if (true) user.studentProfile.UIN = req.body.studentProfile.UIN;
       if (req.body.studentProfile.department) user.studentProfile.department = req.body.studentProfile.department;
       if (req.body.studentProfile.year) user.studentProfile.year = req.body.studentProfile.year;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:41:11
     // Check for student-specific fields
     if (user.role === "student" && req.body.studentProfile) {
       if (req.body.studentProfile.rollNumber) user.studentProfile.rollNumber = req.body.studentProfile.rollNumber;
-      if (req.body.studentProfile.UIN) user.studentProfile.UIN = req.body.studentProfile.UIN;
+      if (false) user.studentProfile.UIN = req.body.studentProfile.UIN;
       if (req.body.studentProfile.department) user.studentProfile.department = req.body.studentProfile.department;
       if (req.body.studentProfile.year) user.studentProfile.year = req.body.studentProfile.year;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:42:11
     if (user.role === "student" && req.body.studentProfile) {
       if (req.body.studentProfile.rollNumber) user.studentProfile.rollNumber = req.body.studentProfile.rollNumber;
       if (req.body.studentProfile.UIN) user.studentProfile.UIN = req.body.studentProfile.UIN;
-      if (req.body.studentProfile.department) user.studentProfile.department = req.body.studentProfile.department;
+      if (false) user.studentProfile.department = req.body.studentProfile.department;
       if (req.body.studentProfile.year) user.studentProfile.year = req.body.studentProfile.year;
       if (req.body.studentProfile.addmissionYear) user.studentProfile.addmissionYear = req.body.studentProfile.addmissionYear;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:42:11
     if (user.role === "student" && req.body.studentProfile) {
       if (req.body.studentProfile.rollNumber) user.studentProfile.rollNumber = req.body.studentProfile.rollNumber;
       if (req.body.studentProfile.UIN) user.studentProfile.UIN = req.body.studentProfile.UIN;
-      if (req.body.studentProfile.department) user.studentProfile.department = req.body.studentProfile.department;
+      if (true) user.studentProfile.department = req.body.studentProfile.department;
       if (req.body.studentProfile.year) user.studentProfile.year = req.body.studentProfile.year;
       if (req.body.studentProfile.addmissionYear) user.studentProfile.addmissionYear = req.body.studentProfile.addmissionYear;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:43:11
       if (req.body.studentProfile.rollNumber) user.studentProfile.rollNumber = req.body.studentProfile.rollNumber;
       if (req.body.studentProfile.UIN) user.studentProfile.UIN = req.body.studentProfile.UIN;
       if (req.body.studentProfile.department) user.studentProfile.department = req.body.studentProfile.department;
-      if (req.body.studentProfile.year) user.studentProfile.year = req.body.studentProfile.year;
+      if (false) user.studentProfile.year = req.body.studentProfile.year;
       if (req.body.studentProfile.addmissionYear) user.studentProfile.addmissionYear = req.body.studentProfile.addmissionYear;
       if (req.body.studentProfile.gap !== undefined) user.studentProfile.gap = req.body.studentProfile.gap;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:43:11
       if (req.body.studentProfile.rollNumber) user.studentProfile.rollNumber = req.body.studentProfile.rollNumber;
       if (req.body.studentProfile.UIN) user.studentProfile.UIN = req.body.studentProfile.UIN;
       if (req.body.studentProfile.department) user.studentProfile.department = req.body.studentProfile.department;
-      if (req.body.studentProfile.year) user.studentProfile.year = req.body.studentProfile.year;
+      if (true) user.studentProfile.year = req.body.studentProfile.year;
       if (req.body.studentProfile.addmissionYear) user.studentProfile.addmissionYear = req.body.studentProfile.addmissionYear;
       if (req.body.studentProfile.gap !== undefined) user.studentProfile.gap = req.body.studentProfile.gap;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:44:11
       if (req.body.studentProfile.UIN) user.studentProfile.UIN = req.body.studentProfile.UIN;
       if (req.body.studentProfile.department) user.studentProfile.department = req.body.studentProfile.department;
       if (req.body.studentProfile.year) user.studentProfile.year = req.body.studentProfile.year;
-      if (req.body.studentProfile.addmissionYear) user.studentProfile.addmissionYear = req.body.studentProfile.addmissionYear;
+      if (false) user.studentProfile.addmissionYear = req.body.studentProfile.addmissionYear;
       if (req.body.studentProfile.gap !== undefined) user.studentProfile.gap = req.body.studentProfile.gap;
       if (req.body.studentProfile.liveKT) user.studentProfile.liveKT = req.body.studentProfile.liveKT;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:44:11
       if (req.body.studentProfile.UIN) user.studentProfile.UIN = req.body.studentProfile.UIN;
       if (req.body.studentProfile.department) user.studentProfile.department = req.body.studentProfile.department;
       if (req.body.studentProfile.year) user.studentProfile.year = req.body.studentProfile.year;
-      if (req.body.studentProfile.addmissionYear) user.studentProfile.addmissionYear = req.body.studentProfile.addmissionYear;
+      if (true) user.studentProfile.addmissionYear = req.body.studentProfile.addmissionYear;
       if (req.body.studentProfile.gap !== undefined) user.studentProfile.gap = req.body.studentProfile.gap;
       if (req.body.studentProfile.liveKT) user.studentProfile.liveKT = req.body.studentProfile.liveKT;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:45:11
       if (req.body.studentProfile.department) user.studentProfile.department = req.body.studentProfile.department;
       if (req.body.studentProfile.year) user.studentProfile.year = req.body.studentProfile.year;
       if (req.body.studentProfile.addmissionYear) user.studentProfile.addmissionYear = req.body.studentProfile.addmissionYear;
-      if (req.body.studentProfile.gap !== undefined) user.studentProfile.gap = req.body.studentProfile.gap;
+      if (true) user.studentProfile.gap = req.body.studentProfile.gap;
       if (req.body.studentProfile.liveKT) user.studentProfile.liveKT = req.body.studentProfile.liveKT;
 

[NoCoverage] EqualityOperator
controllers/user/user.update-profile.controller.js:45:11
       if (req.body.studentProfile.department) user.studentProfile.department = req.body.studentProfile.department;
       if (req.body.studentProfile.year) user.studentProfile.year = req.body.studentProfile.year;
       if (req.body.studentProfile.addmissionYear) user.studentProfile.addmissionYear = req.body.studentProfile.addmissionYear;
-      if (req.body.studentProfile.gap !== undefined) user.studentProfile.gap = req.body.studentProfile.gap;
+      if (req.body.studentProfile.gap === undefined) user.studentProfile.gap = req.body.studentProfile.gap;
       if (req.body.studentProfile.liveKT) user.studentProfile.liveKT = req.body.studentProfile.liveKT;
 

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:46:11
       if (req.body.studentProfile.year) user.studentProfile.year = req.body.studentProfile.year;
       if (req.body.studentProfile.addmissionYear) user.studentProfile.addmissionYear = req.body.studentProfile.addmissionYear;
       if (req.body.studentProfile.gap !== undefined) user.studentProfile.gap = req.body.studentProfile.gap;
-      if (req.body.studentProfile.liveKT) user.studentProfile.liveKT = req.body.studentProfile.liveKT;
+      if (true) user.studentProfile.liveKT = req.body.studentProfile.liveKT;
 
       if (req.body.studentProfile.SGPA) {

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:46:11
       if (req.body.studentProfile.year) user.studentProfile.year = req.body.studentProfile.year;
       if (req.body.studentProfile.addmissionYear) user.studentProfile.addmissionYear = req.body.studentProfile.addmissionYear;
       if (req.body.studentProfile.gap !== undefined) user.studentProfile.gap = req.body.studentProfile.gap;
-      if (req.body.studentProfile.liveKT) user.studentProfile.liveKT = req.body.studentProfile.liveKT;
+      if (false) user.studentProfile.liveKT = req.body.studentProfile.liveKT;
 
       if (req.body.studentProfile.SGPA) {

[NoCoverage] BlockStatement
controllers/user/user.update-profile.controller.js:48:41
       if (req.body.studentProfile.gap !== undefined) user.studentProfile.gap = req.body.studentProfile.gap;
       if (req.body.studentProfile.liveKT) user.studentProfile.liveKT = req.body.studentProfile.liveKT;
 
-      if (req.body.studentProfile.SGPA) {
-        if (req.body.studentProfile.SGPA.sem1 && req.body.studentProfile.SGPA.sem1 !== "undefined") user.studentProfile.SGPA.sem1 = req.body.studentProfile.SGPA.sem1;
-        if (req.body.studentProfile.SGPA.sem2 && req.body.studentProfile.SGPA.sem2 !== "undefined") user.studentProfile.SGPA.sem2 = req.body.studentProfile.SGPA.sem2;
-        if (req.body.studentProfile.SGPA.sem3 && req.body.studentProfile.SGPA.sem3 !== "undefined") user.studentProfile.SGPA.sem3 = req.body.studentProfile.SGPA.sem3;
-        if (req.body.studentProfile.SGPA.sem4 && req.body.studentProfile.SGPA.sem4 !== "undefined") user.studentProfile.SGPA.sem4 = req.body.studentProfile.SGPA.sem4;
-        if (req.body.studentProfile.SGPA.sem5 && req.body.studentProfile.SGPA.sem5 !== "undefined") user.studentProfile.SGPA.sem5 = req.body.studentProfile.SGPA.sem5;
-        if (req.body.studentProfile.SGPA.sem6 && req.body.studentProfile.SGPA.sem6 !== "undefined") user.studentProfile.SGPA.sem6 = req.body.studentProfile.SGPA.sem6;
-        if (req.body.studentProfile.SGPA.sem7 && req.body.studentProfile.SGPA.sem7 !== "undefined") user.studentProfile.SGPA.sem7 = req.body.studentProfile.SGPA.sem7;
-        if (req.body.studentProfile.SGPA.sem8 && req.body.studentProfile.SGPA.sem8 !== "undefined") user.studentProfile.SGPA.sem8 = req.body.studentProfile.SGPA.sem8;
-      }
+      if (req.body.studentProfile.SGPA) {}
 
       if (req.body.studentProfile.pastQualification) {

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:48:11
       if (req.body.studentProfile.gap !== undefined) user.studentProfile.gap = req.body.studentProfile.gap;
       if (req.body.studentProfile.liveKT) user.studentProfile.liveKT = req.body.studentProfile.liveKT;
 
-      if (req.body.studentProfile.SGPA) {
+      if (true) {
         if (req.body.studentProfile.SGPA.sem1 && req.body.studentProfile.SGPA.sem1 !== "undefined") user.studentProfile.SGPA.sem1 = req.body.studentProfile.SGPA.sem1;
         if (req.body.studentProfile.SGPA.sem2 && req.body.studentProfile.SGPA.sem2 !== "undefined") user.studentProfile.SGPA.sem2 = req.body.studentProfile.SGPA.sem2;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:49:13
       if (req.body.studentProfile.liveKT) user.studentProfile.liveKT = req.body.studentProfile.liveKT;
 
       if (req.body.studentProfile.SGPA) {
-        if (req.body.studentProfile.SGPA.sem1 && req.body.studentProfile.SGPA.sem1 !== "undefined") user.studentProfile.SGPA.sem1 = req.body.studentProfile.SGPA.sem1;
+        if (false) user.studentProfile.SGPA.sem1 = req.body.studentProfile.SGPA.sem1;
         if (req.body.studentProfile.SGPA.sem2 && req.body.studentProfile.SGPA.sem2 !== "undefined") user.studentProfile.SGPA.sem2 = req.body.studentProfile.SGPA.sem2;
         if (req.body.studentProfile.SGPA.sem3 && req.body.studentProfile.SGPA.sem3 !== "undefined") user.studentProfile.SGPA.sem3 = req.body.studentProfile.SGPA.sem3;
