[NoCoverage] LogicalOperator
controllers/user/user.update-profile.controller.js:49:13
       if (req.body.studentProfile.liveKT) user.studentProfile.liveKT = req.body.studentProfile.liveKT;
 
       if (req.body.studentProfile.SGPA) {
-        if (req.body.studentProfile.SGPA.sem1 && req.body.studentProfile.SGPA.sem1 !== "undefined") user.studentProfile.SGPA.sem1 = req.body.studentProfile.SGPA.sem1;
+        if (req.body.studentProfile.SGPA.sem1 || req.body.studentProfile.SGPA.sem1 !== "undefined") user.studentProfile.SGPA.sem1 = req.body.studentProfile.SGPA.sem1;
         if (req.body.studentProfile.SGPA.sem2 && req.body.studentProfile.SGPA.sem2 !== "undefined") user.studentProfile.SGPA.sem2 = req.body.studentProfile.SGPA.sem2;
         if (req.body.studentProfile.SGPA.sem3 && req.body.studentProfile.SGPA.sem3 !== "undefined") user.studentProfile.SGPA.sem3 = req.body.studentProfile.SGPA.sem3;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:50:13
 
       if (req.body.studentProfile.SGPA) {
         if (req.body.studentProfile.SGPA.sem1 && req.body.studentProfile.SGPA.sem1 !== "undefined") user.studentProfile.SGPA.sem1 = req.body.studentProfile.SGPA.sem1;
-        if (req.body.studentProfile.SGPA.sem2 && req.body.studentProfile.SGPA.sem2 !== "undefined") user.studentProfile.SGPA.sem2 = req.body.studentProfile.SGPA.sem2;
+        if (false) user.studentProfile.SGPA.sem2 = req.body.studentProfile.SGPA.sem2;
         if (req.body.studentProfile.SGPA.sem3 && req.body.studentProfile.SGPA.sem3 !== "undefined") user.studentProfile.SGPA.sem3 = req.body.studentProfile.SGPA.sem3;
         if (req.body.studentProfile.SGPA.sem4 && req.body.studentProfile.SGPA.sem4 !== "undefined") user.studentProfile.SGPA.sem4 = req.body.studentProfile.SGPA.sem4;

[NoCoverage] EqualityOperator
controllers/user/user.update-profile.controller.js:50:50
 
       if (req.body.studentProfile.SGPA) {
         if (req.body.studentProfile.SGPA.sem1 && req.body.studentProfile.SGPA.sem1 !== "undefined") user.studentProfile.SGPA.sem1 = req.body.studentProfile.SGPA.sem1;
-        if (req.body.studentProfile.SGPA.sem2 && req.body.studentProfile.SGPA.sem2 !== "undefined") user.studentProfile.SGPA.sem2 = req.body.studentProfile.SGPA.sem2;
+        if (req.body.studentProfile.SGPA.sem2 && req.body.studentProfile.SGPA.sem2 === "undefined") user.studentProfile.SGPA.sem2 = req.body.studentProfile.SGPA.sem2;
         if (req.body.studentProfile.SGPA.sem3 && req.body.studentProfile.SGPA.sem3 !== "undefined") user.studentProfile.SGPA.sem3 = req.body.studentProfile.SGPA.sem3;
         if (req.body.studentProfile.SGPA.sem4 && req.body.studentProfile.SGPA.sem4 !== "undefined") user.studentProfile.SGPA.sem4 = req.body.studentProfile.SGPA.sem4;

[NoCoverage] LogicalOperator
controllers/user/user.update-profile.controller.js:51:13
       if (req.body.studentProfile.SGPA) {
         if (req.body.studentProfile.SGPA.sem1 && req.body.studentProfile.SGPA.sem1 !== "undefined") user.studentProfile.SGPA.sem1 = req.body.studentProfile.SGPA.sem1;
         if (req.body.studentProfile.SGPA.sem2 && req.body.studentProfile.SGPA.sem2 !== "undefined") user.studentProfile.SGPA.sem2 = req.body.studentProfile.SGPA.sem2;
-        if (req.body.studentProfile.SGPA.sem3 && req.body.studentProfile.SGPA.sem3 !== "undefined") user.studentProfile.SGPA.sem3 = req.body.studentProfile.SGPA.sem3;
+        if (req.body.studentProfile.SGPA.sem3 || req.body.studentProfile.SGPA.sem3 !== "undefined") user.studentProfile.SGPA.sem3 = req.body.studentProfile.SGPA.sem3;
         if (req.body.studentProfile.SGPA.sem4 && req.body.studentProfile.SGPA.sem4 !== "undefined") user.studentProfile.SGPA.sem4 = req.body.studentProfile.SGPA.sem4;
         if (req.body.studentProfile.SGPA.sem5 && req.body.studentProfile.SGPA.sem5 !== "undefined") user.studentProfile.SGPA.sem5 = req.body.studentProfile.SGPA.sem5;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:51:13
       if (req.body.studentProfile.SGPA) {
         if (req.body.studentProfile.SGPA.sem1 && req.body.studentProfile.SGPA.sem1 !== "undefined") user.studentProfile.SGPA.sem1 = req.body.studentProfile.SGPA.sem1;
         if (req.body.studentProfile.SGPA.sem2 && req.body.studentProfile.SGPA.sem2 !== "undefined") user.studentProfile.SGPA.sem2 = req.body.studentProfile.SGPA.sem2;
-        if (req.body.studentProfile.SGPA.sem3 && req.body.studentProfile.SGPA.sem3 !== "undefined") user.studentProfile.SGPA.sem3 = req.body.studentProfile.SGPA.sem3;
+        if (true) user.studentProfile.SGPA.sem3 = req.body.studentProfile.SGPA.sem3;
         if (req.body.studentProfile.SGPA.sem4 && req.body.studentProfile.SGPA.sem4 !== "undefined") user.studentProfile.SGPA.sem4 = req.body.studentProfile.SGPA.sem4;
         if (req.body.studentProfile.SGPA.sem5 && req.body.studentProfile.SGPA.sem5 !== "undefined") user.studentProfile.SGPA.sem5 = req.body.studentProfile.SGPA.sem5;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:52:13
         if (req.body.studentProfile.SGPA.sem1 && req.body.studentProfile.SGPA.sem1 !== "undefined") user.studentProfile.SGPA.sem1 = req.body.studentProfile.SGPA.sem1;
         if (req.body.studentProfile.SGPA.sem2 && req.body.studentProfile.SGPA.sem2 !== "undefined") user.studentProfile.SGPA.sem2 = req.body.studentProfile.SGPA.sem2;
         if (req.body.studentProfile.SGPA.sem3 && req.body.studentProfile.SGPA.sem3 !== "undefined") user.studentProfile.SGPA.sem3 = req.body.studentProfile.SGPA.sem3;
-        if (req.body.studentProfile.SGPA.sem4 && req.body.studentProfile.SGPA.sem4 !== "undefined") user.studentProfile.SGPA.sem4 = req.body.studentProfile.SGPA.sem4;
+        if (false) user.studentProfile.SGPA.sem4 = req.body.studentProfile.SGPA.sem4;
         if (req.body.studentProfile.SGPA.sem5 && req.body.studentProfile.SGPA.sem5 !== "undefined") user.studentProfile.SGPA.sem5 = req.body.studentProfile.SGPA.sem5;
         if (req.body.studentProfile.SGPA.sem6 && req.body.studentProfile.SGPA.sem6 !== "undefined") user.studentProfile.SGPA.sem6 = req.body.studentProfile.SGPA.sem6;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:52:13
         if (req.body.studentProfile.SGPA.sem1 && req.body.studentProfile.SGPA.sem1 !== "undefined") user.studentProfile.SGPA.sem1 = req.body.studentProfile.SGPA.sem1;
         if (req.body.studentProfile.SGPA.sem2 && req.body.studentProfile.SGPA.sem2 !== "undefined") user.studentProfile.SGPA.sem2 = req.body.studentProfile.SGPA.sem2;
         if (req.body.studentProfile.SGPA.sem3 && req.body.studentProfile.SGPA.sem3 !== "undefined") user.studentProfile.SGPA.sem3 = req.body.studentProfile.SGPA.sem3;
-        if (req.body.studentProfile.SGPA.sem4 && req.body.studentProfile.SGPA.sem4 !== "undefined") user.studentProfile.SGPA.sem4 = req.body.studentProfile.SGPA.sem4;
+        if (true) user.studentProfile.SGPA.sem4 = req.body.studentProfile.SGPA.sem4;
         if (req.body.studentProfile.SGPA.sem5 && req.body.studentProfile.SGPA.sem5 !== "undefined") user.studentProfile.SGPA.sem5 = req.body.studentProfile.SGPA.sem5;
         if (req.body.studentProfile.SGPA.sem6 && req.body.studentProfile.SGPA.sem6 !== "undefined") user.studentProfile.SGPA.sem6 = req.body.studentProfile.SGPA.sem6;

[NoCoverage] LogicalOperator
controllers/user/user.update-profile.controller.js:53:13
         if (req.body.studentProfile.SGPA.sem2 && req.body.studentProfile.SGPA.sem2 !== "undefined") user.studentProfile.SGPA.sem2 = req.body.studentProfile.SGPA.sem2;
         if (req.body.studentProfile.SGPA.sem3 && req.body.studentProfile.SGPA.sem3 !== "undefined") user.studentProfile.SGPA.sem3 = req.body.studentProfile.SGPA.sem3;
         if (req.body.studentProfile.SGPA.sem4 && req.body.studentProfile.SGPA.sem4 !== "undefined") user.studentProfile.SGPA.sem4 = req.body.studentProfile.SGPA.sem4;
-        if (req.body.studentProfile.SGPA.sem5 && req.body.studentProfile.SGPA.sem5 !== "undefined") user.studentProfile.SGPA.sem5 = req.body.studentProfile.SGPA.sem5;
+        if (req.body.studentProfile.SGPA.sem5 || req.body.studentProfile.SGPA.sem5 !== "undefined") user.studentProfile.SGPA.sem5 = req.body.studentProfile.SGPA.sem5;
         if (req.body.studentProfile.SGPA.sem6 && req.body.studentProfile.SGPA.sem6 !== "undefined") user.studentProfile.SGPA.sem6 = req.body.studentProfile.SGPA.sem6;
         if (req.body.studentProfile.SGPA.sem7 && req.body.studentProfile.SGPA.sem7 !== "undefined") user.studentProfile.SGPA.sem7 = req.body.studentProfile.SGPA.sem7;

[NoCoverage] EqualityOperator
controllers/user/user.update-profile.controller.js:53:50
         if (req.body.studentProfile.SGPA.sem2 && req.body.studentProfile.SGPA.sem2 !== "undefined") user.studentProfile.SGPA.sem2 = req.body.studentProfile.SGPA.sem2;
         if (req.body.studentProfile.SGPA.sem3 && req.body.studentProfile.SGPA.sem3 !== "undefined") user.studentProfile.SGPA.sem3 = req.body.studentProfile.SGPA.sem3;
         if (req.body.studentProfile.SGPA.sem4 && req.body.studentProfile.SGPA.sem4 !== "undefined") user.studentProfile.SGPA.sem4 = req.body.studentProfile.SGPA.sem4;
-        if (req.body.studentProfile.SGPA.sem5 && req.body.studentProfile.SGPA.sem5 !== "undefined") user.studentProfile.SGPA.sem5 = req.body.studentProfile.SGPA.sem5;
+        if (req.body.studentProfile.SGPA.sem5 && req.body.studentProfile.SGPA.sem5 === "undefined") user.studentProfile.SGPA.sem5 = req.body.studentProfile.SGPA.sem5;
         if (req.body.studentProfile.SGPA.sem6 && req.body.studentProfile.SGPA.sem6 !== "undefined") user.studentProfile.SGPA.sem6 = req.body.studentProfile.SGPA.sem6;
         if (req.body.studentProfile.SGPA.sem7 && req.body.studentProfile.SGPA.sem7 !== "undefined") user.studentProfile.SGPA.sem7 = req.body.studentProfile.SGPA.sem7;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:54:13
         if (req.body.studentProfile.SGPA.sem3 && req.body.studentProfile.SGPA.sem3 !== "undefined") user.studentProfile.SGPA.sem3 = req.body.studentProfile.SGPA.sem3;
         if (req.body.studentProfile.SGPA.sem4 && req.body.studentProfile.SGPA.sem4 !== "undefined") user.studentProfile.SGPA.sem4 = req.body.studentProfile.SGPA.sem4;
         if (req.body.studentProfile.SGPA.sem5 && req.body.studentProfile.SGPA.sem5 !== "undefined") user.studentProfile.SGPA.sem5 = req.body.studentProfile.SGPA.sem5;
-        if (req.body.studentProfile.SGPA.sem6 && req.body.studentProfile.SGPA.sem6 !== "undefined") user.studentProfile.SGPA.sem6 = req.body.studentProfile.SGPA.sem6;
+        if (true) user.studentProfile.SGPA.sem6 = req.body.studentProfile.SGPA.sem6;
         if (req.body.studentProfile.SGPA.sem7 && req.body.studentProfile.SGPA.sem7 !== "undefined") user.studentProfile.SGPA.sem7 = req.body.studentProfile.SGPA.sem7;
         if (req.body.studentProfile.SGPA.sem8 && req.body.studentProfile.SGPA.sem8 !== "undefined") user.studentProfile.SGPA.sem8 = req.body.studentProfile.SGPA.sem8;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:54:50
         if (req.body.studentProfile.SGPA.sem3 && req.body.studentProfile.SGPA.sem3 !== "undefined") user.studentProfile.SGPA.sem3 = req.body.studentProfile.SGPA.sem3;
         if (req.body.studentProfile.SGPA.sem4 && req.body.studentProfile.SGPA.sem4 !== "undefined") user.studentProfile.SGPA.sem4 = req.body.studentProfile.SGPA.sem4;
         if (req.body.studentProfile.SGPA.sem5 && req.body.studentProfile.SGPA.sem5 !== "undefined") user.studentProfile.SGPA.sem5 = req.body.studentProfile.SGPA.sem5;
-        if (req.body.studentProfile.SGPA.sem6 && req.body.studentProfile.SGPA.sem6 !== "undefined") user.studentProfile.SGPA.sem6 = req.body.studentProfile.SGPA.sem6;
+        if (req.body.studentProfile.SGPA.sem6 && true) user.studentProfile.SGPA.sem6 = req.body.studentProfile.SGPA.sem6;
         if (req.body.studentProfile.SGPA.sem7 && req.body.studentProfile.SGPA.sem7 !== "undefined") user.studentProfile.SGPA.sem7 = req.body.studentProfile.SGPA.sem7;
         if (req.body.studentProfile.SGPA.sem8 && req.body.studentProfile.SGPA.sem8 !== "undefined") user.studentProfile.SGPA.sem8 = req.body.studentProfile.SGPA.sem8;

[NoCoverage] EqualityOperator
controllers/user/user.update-profile.controller.js:55:50
         if (req.body.studentProfile.SGPA.sem4 && req.body.studentProfile.SGPA.sem4 !== "undefined") user.studentProfile.SGPA.sem4 = req.body.studentProfile.SGPA.sem4;
         if (req.body.studentProfile.SGPA.sem5 && req.body.studentProfile.SGPA.sem5 !== "undefined") user.studentProfile.SGPA.sem5 = req.body.studentProfile.SGPA.sem5;
         if (req.body.studentProfile.SGPA.sem6 && req.body.studentProfile.SGPA.sem6 !== "undefined") user.studentProfile.SGPA.sem6 = req.body.studentProfile.SGPA.sem6;
-        if (req.body.studentProfile.SGPA.sem7 && req.body.studentProfile.SGPA.sem7 !== "undefined") user.studentProfile.SGPA.sem7 = req.body.studentProfile.SGPA.sem7;
+        if (req.body.studentProfile.SGPA.sem7 && req.body.studentProfile.SGPA.sem7 === "undefined") user.studentProfile.SGPA.sem7 = req.body.studentProfile.SGPA.sem7;
         if (req.body.studentProfile.SGPA.sem8 && req.body.studentProfile.SGPA.sem8 !== "undefined") user.studentProfile.SGPA.sem8 = req.body.studentProfile.SGPA.sem8;
       }

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:55:13
         if (req.body.studentProfile.SGPA.sem4 && req.body.studentProfile.SGPA.sem4 !== "undefined") user.studentProfile.SGPA.sem4 = req.body.studentProfile.SGPA.sem4;
         if (req.body.studentProfile.SGPA.sem5 && req.body.studentProfile.SGPA.sem5 !== "undefined") user.studentProfile.SGPA.sem5 = req.body.studentProfile.SGPA.sem5;
         if (req.body.studentProfile.SGPA.sem6 && req.body.studentProfile.SGPA.sem6 !== "undefined") user.studentProfile.SGPA.sem6 = req.body.studentProfile.SGPA.sem6;
-        if (req.body.studentProfile.SGPA.sem7 && req.body.studentProfile.SGPA.sem7 !== "undefined") user.studentProfile.SGPA.sem7 = req.body.studentProfile.SGPA.sem7;
+        if (false) user.studentProfile.SGPA.sem7 = req.body.studentProfile.SGPA.sem7;
         if (req.body.studentProfile.SGPA.sem8 && req.body.studentProfile.SGPA.sem8 !== "undefined") user.studentProfile.SGPA.sem8 = req.body.studentProfile.SGPA.sem8;
       }

[NoCoverage] EqualityOperator
controllers/user/user.update-profile.controller.js:56:50
         if (req.body.studentProfile.SGPA.sem5 && req.body.studentProfile.SGPA.sem5 !== "undefined") user.studentProfile.SGPA.sem5 = req.body.studentProfile.SGPA.sem5;
         if (req.body.studentProfile.SGPA.sem6 && req.body.studentProfile.SGPA.sem6 !== "undefined") user.studentProfile.SGPA.sem6 = req.body.studentProfile.SGPA.sem6;
         if (req.body.studentProfile.SGPA.sem7 && req.body.studentProfile.SGPA.sem7 !== "undefined") user.studentProfile.SGPA.sem7 = req.body.studentProfile.SGPA.sem7;
-        if (req.body.studentProfile.SGPA.sem8 && req.body.studentProfile.SGPA.sem8 !== "undefined") user.studentProfile.SGPA.sem8 = req.body.studentProfile.SGPA.sem8;
+        if (req.body.studentProfile.SGPA.sem8 && req.body.studentProfile.SGPA.sem8 === "undefined") user.studentProfile.SGPA.sem8 = req.body.studentProfile.SGPA.sem8;
       }
 

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:56:13
         if (req.body.studentProfile.SGPA.sem5 && req.body.studentProfile.SGPA.sem5 !== "undefined") user.studentProfile.SGPA.sem5 = req.body.studentProfile.SGPA.sem5;
         if (req.body.studentProfile.SGPA.sem6 && req.body.studentProfile.SGPA.sem6 !== "undefined") user.studentProfile.SGPA.sem6 = req.body.studentProfile.SGPA.sem6;
         if (req.body.studentProfile.SGPA.sem7 && req.body.studentProfile.SGPA.sem7 !== "undefined") user.studentProfile.SGPA.sem7 = req.body.studentProfile.SGPA.sem7;
-        if (req.body.studentProfile.SGPA.sem8 && req.body.studentProfile.SGPA.sem8 !== "undefined") user.studentProfile.SGPA.sem8 = req.body.studentProfile.SGPA.sem8;
+        if (false) user.studentProfile.SGPA.sem8 = req.body.studentProfile.SGPA.sem8;
       }
 

[NoCoverage] BlockStatement
controllers/user/user.update-profile.controller.js:59:54
         if (req.body.studentProfile.SGPA.sem8 && req.body.studentProfile.SGPA.sem8 !== "undefined") user.studentProfile.SGPA.sem8 = req.body.studentProfile.SGPA.sem8;
       }
 
-      if (req.body.studentProfile.pastQualification) {
-        if (req.body.studentProfile.pastQualification.ssc) {
-          if (req.body.studentProfile.pastQualification.ssc.board) user.studentProfile.pastQualification.ssc.board = req.body.studentProfile.pastQualification.ssc.board;
-          if (req.body.studentProfile.pastQualification.ssc.year) user.studentProfile.pastQualification.ssc.year = req.body.studentProfile.pastQualification.ssc.year;
-          if (req.body.studentProfile.pastQualification.ssc.percentage) user.studentProfile.pastQualification.ssc.percentage = req.body.studentProfile.pastQualification.ssc.percentage;
-        }
-
-        if (req.body.studentProfile.pastQualification.hsc && req.body.studentProfile.pastQualification.hsc.board !== "undefined") {
-          user.studentProfile.pastQualification.hsc.board = req.body.studentProfile.pastQualification.hsc.board;
-          user.studentProfile.pastQualification.hsc.year = req.body.studentProfile.pastQualification.hsc.year;
-          user.studentProfile.pastQualification.hsc.percentage = req.body.studentProfile.pastQualification.hsc.percentage;
-        }
-
-        if (req.body.studentProfile.pastQualification.diploma && req.body.studentProfile.pastQualification.diploma.board !== "undefined") {
-          user.studentProfile.pastQualification.diploma.department = req.body.studentProfile.pastQualification.diploma.board;
-          user.studentProfile.pastQualification.diploma.year = req.body.studentProfile.pastQualification.diploma.year;
-          user.studentProfile.pastQualification.diploma.percentage = req.body.studentProfile.pastQualification.diploma.percentage;
-        }
-      }
+      if (req.body.studentProfile.pastQualification) {}
     }
 

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:59:11
         if (req.body.studentProfile.SGPA.sem8 && req.body.studentProfile.SGPA.sem8 !== "undefined") user.studentProfile.SGPA.sem8 = req.body.studentProfile.SGPA.sem8;
       }
 
-      if (req.body.studentProfile.pastQualification) {
+      if (false) {
         if (req.body.studentProfile.pastQualification.ssc) {
           if (req.body.studentProfile.pastQualification.ssc.board) user.studentProfile.pastQualification.ssc.board = req.body.studentProfile.pastQualification.ssc.board;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:60:13
       }
 
       if (req.body.studentProfile.pastQualification) {
-        if (req.body.studentProfile.pastQualification.ssc) {
+        if (false) {
           if (req.body.studentProfile.pastQualification.ssc.board) user.studentProfile.pastQualification.ssc.board = req.body.studentProfile.pastQualification.ssc.board;
           if (req.body.studentProfile.pastQualification.ssc.year) user.studentProfile.pastQualification.ssc.year = req.body.studentProfile.pastQualification.ssc.year;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:60:13
       }
 
       if (req.body.studentProfile.pastQualification) {
-        if (req.body.studentProfile.pastQualification.ssc) {
+        if (true) {
           if (req.body.studentProfile.pastQualification.ssc.board) user.studentProfile.pastQualification.ssc.board = req.body.studentProfile.pastQualification.ssc.board;
           if (req.body.studentProfile.pastQualification.ssc.year) user.studentProfile.pastQualification.ssc.year = req.body.studentProfile.pastQualification.ssc.year;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:61:15
 
       if (req.body.studentProfile.pastQualification) {
         if (req.body.studentProfile.pastQualification.ssc) {
-          if (req.body.studentProfile.pastQualification.ssc.board) user.studentProfile.pastQualification.ssc.board = req.body.studentProfile.pastQualification.ssc.board;
+          if (false) user.studentProfile.pastQualification.ssc.board = req.body.studentProfile.pastQualification.ssc.board;
           if (req.body.studentProfile.pastQualification.ssc.year) user.studentProfile.pastQualification.ssc.year = req.body.studentProfile.pastQualification.ssc.year;
           if (req.body.studentProfile.pastQualification.ssc.percentage) user.studentProfile.pastQualification.ssc.percentage = req.body.studentProfile.pastQualification.ssc.percentage;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:61:15
 
       if (req.body.studentProfile.pastQualification) {
         if (req.body.studentProfile.pastQualification.ssc) {
-          if (req.body.studentProfile.pastQualification.ssc.board) user.studentProfile.pastQualification.ssc.board = req.body.studentProfile.pastQualification.ssc.board;
+          if (true) user.studentProfile.pastQualification.ssc.board = req.body.studentProfile.pastQualification.ssc.board;
           if (req.body.studentProfile.pastQualification.ssc.year) user.studentProfile.pastQualification.ssc.year = req.body.studentProfile.pastQualification.ssc.year;
           if (req.body.studentProfile.pastQualification.ssc.percentage) user.studentProfile.pastQualification.ssc.percentage = req.body.studentProfile.pastQualification.ssc.percentage;

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:62:15
       if (req.body.studentProfile.pastQualification) {
         if (req.body.studentProfile.pastQualification.ssc) {
           if (req.body.studentProfile.pastQualification.ssc.board) user.studentProfile.pastQualification.ssc.board = req.body.studentProfile.pastQualification.ssc.board;
-          if (req.body.studentProfile.pastQualification.ssc.year) user.studentProfile.pastQualification.ssc.year = req.body.studentProfile.pastQualification.ssc.year;
+          if (true) user.studentProfile.pastQualification.ssc.year = req.body.studentProfile.pastQualification.ssc.year;
           if (req.body.studentProfile.pastQualification.ssc.percentage) user.studentProfile.pastQualification.ssc.percentage = req.body.studentProfile.pastQualification.ssc.percentage;
         }

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:62:15
       if (req.body.studentProfile.pastQualification) {
         if (req.body.studentProfile.pastQualification.ssc) {
           if (req.body.studentProfile.pastQualification.ssc.board) user.studentProfile.pastQualification.ssc.board = req.body.studentProfile.pastQualification.ssc.board;
-          if (req.body.studentProfile.pastQualification.ssc.year) user.studentProfile.pastQualification.ssc.year = req.body.studentProfile.pastQualification.ssc.year;
+          if (false) user.studentProfile.pastQualification.ssc.year = req.body.studentProfile.pastQualification.ssc.year;
           if (req.body.studentProfile.pastQualification.ssc.percentage) user.studentProfile.pastQualification.ssc.percentage = req.body.studentProfile.pastQualification.ssc.percentage;
         }

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:63:15
         if (req.body.studentProfile.pastQualification.ssc) {
           if (req.body.studentProfile.pastQualification.ssc.board) user.studentProfile.pastQualification.ssc.board = req.body.studentProfile.pastQualification.ssc.board;
           if (req.body.studentProfile.pastQualification.ssc.year) user.studentProfile.pastQualification.ssc.year = req.body.studentProfile.pastQualification.ssc.year;
-          if (req.body.studentProfile.pastQualification.ssc.percentage) user.studentProfile.pastQualification.ssc.percentage = req.body.studentProfile.pastQualification.ssc.percentage;
+          if (true) user.studentProfile.pastQualification.ssc.percentage = req.body.studentProfile.pastQualification.ssc.percentage;
         }
 

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:63:15
         if (req.body.studentProfile.pastQualification.ssc) {
           if (req.body.studentProfile.pastQualification.ssc.board) user.studentProfile.pastQualification.ssc.board = req.body.studentProfile.pastQualification.ssc.board;
           if (req.body.studentProfile.pastQualification.ssc.year) user.studentProfile.pastQualification.ssc.year = req.body.studentProfile.pastQualification.ssc.year;
-          if (req.body.studentProfile.pastQualification.ssc.percentage) user.studentProfile.pastQualification.ssc.percentage = req.body.studentProfile.pastQualification.ssc.percentage;
+          if (false) user.studentProfile.pastQualification.ssc.percentage = req.body.studentProfile.pastQualification.ssc.percentage;
         }
 

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:66:62
           if (req.body.studentProfile.pastQualification.ssc.percentage) user.studentProfile.pastQualification.ssc.percentage = req.body.studentProfile.pastQualification.ssc.percentage;
         }
 
-        if (req.body.studentProfile.pastQualification.hsc && req.body.studentProfile.pastQualification.hsc.board !== "undefined") {
+        if (req.body.studentProfile.pastQualification.hsc && true) {
           user.studentProfile.pastQualification.hsc.board = req.body.studentProfile.pastQualification.hsc.board;
           user.studentProfile.pastQualification.hsc.year = req.body.studentProfile.pastQualification.hsc.year;

[NoCoverage] LogicalOperator
controllers/user/user.update-profile.controller.js:66:13
           if (req.body.studentProfile.pastQualification.ssc.percentage) user.studentProfile.pastQualification.ssc.percentage = req.body.studentProfile.pastQualification.ssc.percentage;
         }
 
-        if (req.body.studentProfile.pastQualification.hsc && req.body.studentProfile.pastQualification.hsc.board !== "undefined") {
+        if (req.body.studentProfile.pastQualification.hsc || req.body.studentProfile.pastQualification.hsc.board !== "undefined") {
           user.studentProfile.pastQualification.hsc.board = req.body.studentProfile.pastQualification.hsc.board;
           user.studentProfile.pastQualification.hsc.year = req.body.studentProfile.pastQualification.hsc.year;

[NoCoverage] BlockStatement
controllers/user/user.update-profile.controller.js:72:139
           user.studentProfile.pastQualification.hsc.percentage = req.body.studentProfile.pastQualification.hsc.percentage;
         }
 
-        if (req.body.studentProfile.pastQualification.diploma && req.body.studentProfile.pastQualification.diploma.board !== "undefined") {
-          user.studentProfile.pastQualification.diploma.department = req.body.studentProfile.pastQualification.diploma.board;
-          user.studentProfile.pastQualification.diploma.year = req.body.studentProfile.pastQualification.diploma.year;
-          user.studentProfile.pastQualification.diploma.percentage = req.body.studentProfile.pastQualification.diploma.percentage;
-        }
+        if (req.body.studentProfile.pastQualification.diploma && req.body.studentProfile.pastQualification.diploma.board !== "undefined") {}
       }
     }

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:72:13
           user.studentProfile.pastQualification.hsc.percentage = req.body.studentProfile.pastQualification.hsc.percentage;
         }
 
-        if (req.body.studentProfile.pastQualification.diploma && req.body.studentProfile.pastQualification.diploma.board !== "undefined") {
+        if (true) {
           user.studentProfile.pastQualification.diploma.department = req.body.studentProfile.pastQualification.diploma.board;
           user.studentProfile.pastQualification.diploma.year = req.body.studentProfile.pastQualification.diploma.year;

[NoCoverage] EqualityOperator
controllers/user/user.update-profile.controller.js:81:9
     }
 
     // check if request came from user except superuser
-    if (req.body.role !== 'superuser') user.isProfileCompleted = true;
+    if (req.body.role === 'superuser') user.isProfileCompleted = true;
 
 

[NoCoverage] ConditionalExpression
controllers/user/user.update-profile.controller.js:81:9
     }
 
     // check if request came from user except superuser
-    if (req.body.role !== 'superuser') user.isProfileCompleted = true;
+    if (false) user.isProfileCompleted = true;
 
 

[NoCoverage] ObjectLiteral
controllers/user/user.update-profile.controller.js:87:21
     // Save the updated user data
     await user.save();
 
-    return res.json({ msg: "Data Updated Successfully!" });
+    return res.json({});
   } catch (error) {
     console.log("user.update-profile.controller ==> ", error)

[NoCoverage] BlockStatement
controllers/user/user.update-profile.controller.js:88:19
     await user.save();
 
     return res.json({ msg: "Data Updated Successfully!" });
-  } catch (error) {
-    console.log("user.update-profile.controller ==> ", error)
-    return res.json({ msg: "Internal Server Error!" });
-  }
+  } catch (error) {}
 }
 
