[Survived] ObjectLiteral
models/company.model.js:5:34
 const Schema = mongoose.Schema;
 const JobSchema = require('./job.model');
 
-const companySchema = new Schema({
-  companyName: { type: String, required: true },
-  companyDescription: { type: String },
-  companyWebsite: { type: String },
-  companyLocation: { type: String, trim: true },
-  companyDifficulty: { type: String, enum: ['Easy', 'Moderate', 'Hard'] }
-});
+const companySchema = new Schema({});
 
 

[Survived] BooleanLiteral
models/company.model.js:6:42
 const JobSchema = require('./job.model');
 
 const companySchema = new Schema({
-  companyName: { type: String, required: true },
+  companyName: { type: String, required: false },
   companyDescription: { type: String },
   companyWebsite: { type: String },

[Survived] ObjectLiteral
models/company.model.js:8:19
 const companySchema = new Schema({
   companyName: { type: String, required: true },
   companyDescription: { type: String },
-  companyWebsite: { type: String },
+  companyWebsite: {},
   companyLocation: { type: String, trim: true },
   companyDifficulty: { type: String, enum: ['Easy', 'Moderate', 'Hard'] }

[Survived] BooleanLiteral
models/company.model.js:9:42
   companyName: { type: String, required: true },
   companyDescription: { type: String },
   companyWebsite: { type: String },
-  companyLocation: { type: String, trim: true },
+  companyLocation: { type: String, trim: false },
   companyDifficulty: { type: String, enum: ['Easy', 'Moderate', 'Hard'] }
 });

[Survived] ArrayDeclaration
models/company.model.js:10:44
   companyDescription: { type: String },
   companyWebsite: { type: String },
   companyLocation: { type: String, trim: true },
-  companyDifficulty: { type: String, enum: ['Easy', 'Moderate', 'Hard'] }
+  companyDifficulty: { type: String, enum: [] }
 });
 

[Survived] BooleanLiteral
models/company.model.js:15:44
 
 
 // Pre middleware to delete jobs when the company is deleted
-companySchema.pre('deleteOne', { document: true, query: false }, async function (next) {
+companySchema.pre('deleteOne', { document: false, query: false }, async function (next) {
   try {
     const companyId = this._id; // Get the current company's ID

[NoCoverage] BlockStatement
models/company.model.js:15:88
 
 
 // Pre middleware to delete jobs when the company is deleted
-companySchema.pre('deleteOne', { document: true, query: false }, async function (next) {
-  try {
-    const companyId = this._id; // Get the current company's ID
-
-    // Dynamically load the Job model to avoid circular dependency
-    const Job = mongoose.model('Job');
-
-    // Delete all jobs associated with this company
-    await Job.deleteMany({ company: companyId });
-
-    next(); // Proceed with the company deletion
-  } catch (error) {
-    next(error); // Pass any errors to the next middleware
-  }
-});
+companySchema.pre('deleteOne', { document: true, query: false }, async function (next) {});
 
 

[NoCoverage] BlockStatement
models/company.model.js:16:7
 
 // Pre middleware to delete jobs when the company is deleted
 companySchema.pre('deleteOne', { document: true, query: false }, async function (next) {
-  try {
-    const companyId = this._id; // Get the current company's ID
-
-    // Dynamically load the Job model to avoid circular dependency
-    const Job = mongoose.model('Job');
-
-    // Delete all jobs associated with this company
-    await Job.deleteMany({ company: companyId });
-
-    next(); // Proceed with the company deletion
-  } catch (error) {
+  try {} catch (error) {
     next(error); // Pass any errors to the next middleware
   }

[NoCoverage] ObjectLiteral
models/company.model.js:23:26
     const Job = mongoose.model('Job');
 
     // Delete all jobs associated with this company
-    await Job.deleteMany({ company: companyId });
+    await Job.deleteMany({});
 
     next(); // Proceed with the company deletion

[NoCoverage] BlockStatement
models/company.model.js:26:19
     await Job.deleteMany({ company: companyId });
 
     next(); // Proceed with the company deletion
-  } catch (error) {
-    next(error); // Pass any errors to the next middleware
-  }
+  } catch (error) {}
 });
 
