[Survived] BooleanLiteral
models/job.model.js:5:39
 const Schema = mongoose.Schema;
 
 const jobSchema = new mongoose.Schema({
-  jobTitle: { type: String, required: true },
+  jobTitle: { type: String, required: false },
   jobDescription: { type: String, required: true },
   eligibility: { type: String },

[Survived] BooleanLiteral
models/job.model.js:6:45
 
 const jobSchema = new mongoose.Schema({
   jobTitle: { type: String, required: true },
-  jobDescription: { type: String, required: true },
+  jobDescription: { type: String, required: false },
   eligibility: { type: String },
   salary: { type: Number },

[Survived] ObjectLiteral
models/job.model.js:10:13
   eligibility: { type: String },
   salary: { type: Number },
   howToApply: { type: String },
-  postedAt: { type: Date, default: Date.now },
+  postedAt: {},
   applicationDeadline: { type: Date },
   // company details

[Survived] ObjectLiteral
models/job.model.js:11:24
   salary: { type: Number },
   howToApply: { type: String },
   postedAt: { type: Date, default: Date.now },
-  applicationDeadline: { type: Date },
+  applicationDeadline: {},
   // company details
   company: { type: Schema.Types.ObjectId, ref: 'Company', required: true },

[Survived] BooleanLiteral
models/job.model.js:13:69
   postedAt: { type: Date, default: Date.now },
   applicationDeadline: { type: Date },
   // company details
-  company: { type: Schema.Types.ObjectId, ref: 'Company', required: true },
+  company: { type: Schema.Types.ObjectId, ref: 'Company', required: false },
   // applicants details
   applicants: [

[Survived] ObjectLiteral
models/job.model.js:13:12
   postedAt: { type: Date, default: Date.now },
   applicationDeadline: { type: Date },
   // company details
-  company: { type: Schema.Types.ObjectId, ref: 'Company', required: true },
+  company: {},
   // applicants details
   applicants: [

[Survived] ObjectLiteral
models/job.model.js:16:5
   company: { type: Schema.Types.ObjectId, ref: 'Company', required: true },
   // applicants details
   applicants: [
-    {
-      studentId: { type: Schema.Types.ObjectId, ref: 'Users' },
-      currentRound: {
-        type: String,
-        enum: ['Aptitude Test', 'Technical Interview', 'HR Interview', 'Group Discussion']
-      },
-      roundStatus: { type: String, enum: ['pending', 'passed', 'failed'] },
-      selectionDate: { type: Date },
-      joiningDate: { type: Date },
-      offerLetter: { type: String },
-      status: { type: String, enum: ['applied', 'interview', 'hired', 'rejected'], default: 'applied' },
-      appliedAt: { type: Date, default: Date.now }
-    }
+    {}
   ]
 });

[Survived] ObjectLiteral
models/job.model.js:17:18
   // applicants details
   applicants: [
     {
-      studentId: { type: Schema.Types.ObjectId, ref: 'Users' },
+      studentId: {},
       currentRound: {
         type: String,

[Survived] StringLiteral
models/job.model.js:20:72
       studentId: { type: Schema.Types.ObjectId, ref: 'Users' },
       currentRound: {
         type: String,
-        enum: ['Aptitude Test', 'Technical Interview', 'HR Interview', 'Group Discussion']
+        enum: ['Aptitude Test', 'Technical Interview', 'HR Interview', ""]
       },
       roundStatus: { type: String, enum: ['pending', 'passed', 'failed'] },

[Survived] StringLiteral
models/job.model.js:20:56
       studentId: { type: Schema.Types.ObjectId, ref: 'Users' },
       currentRound: {
         type: String,
-        enum: ['Aptitude Test', 'Technical Interview', 'HR Interview', 'Group Discussion']
+        enum: ['Aptitude Test', 'Technical Interview', "", 'Group Discussion']
       },
       roundStatus: { type: String, enum: ['pending', 'passed', 'failed'] },

[Survived] StringLiteral
models/job.model.js:22:64
         type: String,
         enum: ['Aptitude Test', 'Technical Interview', 'HR Interview', 'Group Discussion']
       },
-      roundStatus: { type: String, enum: ['pending', 'passed', 'failed'] },
+      roundStatus: { type: String, enum: ['pending', 'passed', ""] },
       selectionDate: { type: Date },
       joiningDate: { type: Date },

[Survived] ObjectLiteral
models/job.model.js:23:22
         enum: ['Aptitude Test', 'Technical Interview', 'HR Interview', 'Group Discussion']
       },
       roundStatus: { type: String, enum: ['pending', 'passed', 'failed'] },
-      selectionDate: { type: Date },
+      selectionDate: {},
       joiningDate: { type: Date },
       offerLetter: { type: String },

[Survived] ObjectLiteral
models/job.model.js:26:15
       selectionDate: { type: Date },
       joiningDate: { type: Date },
       offerLetter: { type: String },
-      status: { type: String, enum: ['applied', 'interview', 'hired', 'rejected'], default: 'applied' },
+      status: {},
       appliedAt: { type: Date, default: Date.now }
     }

[Survived] StringLiteral
models/job.model.js:26:49
       selectionDate: { type: Date },
       joiningDate: { type: Date },
       offerLetter: { type: String },
-      status: { type: String, enum: ['applied', 'interview', 'hired', 'rejected'], default: 'applied' },
+      status: { type: String, enum: ['applied', "", 'hired', 'rejected'], default: 'applied' },
       appliedAt: { type: Date, default: Date.now }
     }

[Survived] ObjectLiteral
models/job.model.js:27:18
       joiningDate: { type: Date },
       offerLetter: { type: String },
       status: { type: String, enum: ['applied', 'interview', 'hired', 'rejected'], default: 'applied' },
-      appliedAt: { type: Date, default: Date.now }
+      appliedAt: {}
     }
   ]

[NoCoverage] BlockStatement
models/job.model.js:34:84
 
 
 // Middleware to delete the jobId from user's appliedJobs array before deleting the job
-jobSchema.pre('deleteOne', { document: true, query: false }, async function (next) {
-  try {
-    const jobId = this._id; // Get the current job's ID
-
-    const User = mongoose.model('Users');
-
-    // Remove the jobId from all users' appliedJobs array
-    await User.updateMany(
-      { 'studentProfile.appliedJobs.jobId': jobId }, // Find users who applied to this job
-      { $pull: { 'studentProfile.appliedJobs': { jobId: jobId } } } // Remove the jobId from appliedJobs array
-    );
-
-    next(); // Proceed with the job deletion
-  } catch (error) {
-    next(error); // Pass any errors to the next middleware
-  }
-});
+jobSchema.pre('deleteOne', { document: true, query: false }, async function (next) {});
 
 

[Survived] BooleanLiteral
models/job.model.js:34:53
 
 
 // Middleware to delete the jobId from user's appliedJobs array before deleting the job
-jobSchema.pre('deleteOne', { document: true, query: false }, async function (next) {
+jobSchema.pre('deleteOne', { document: true, query: true }, async function (next) {
   try {
     const jobId = this._id; // Get the current job's ID

[NoCoverage] BlockStatement
models/job.model.js:35:7
 
 // Middleware to delete the jobId from user's appliedJobs array before deleting the job
 jobSchema.pre('deleteOne', { document: true, query: false }, async function (next) {
-  try {
-    const jobId = this._id; // Get the current job's ID
-
-    const User = mongoose.model('Users');
-
-    // Remove the jobId from all users' appliedJobs array
-    await User.updateMany(
-      { 'studentProfile.appliedJobs.jobId': jobId }, // Find users who applied to this job
-      { $pull: { 'studentProfile.appliedJobs': { jobId: jobId } } } // Remove the jobId from appliedJobs array
-    );
-
-    next(); // Proceed with the job deletion
-  } catch (error) {
+  try {} catch (error) {
     next(error); // Pass any errors to the next middleware
   }

[NoCoverage] ObjectLiteral
models/job.model.js:43:7
     // Remove the jobId from all users' appliedJobs array
     await User.updateMany(
       { 'studentProfile.appliedJobs.jobId': jobId }, // Find users who applied to this job
-      { $pull: { 'studentProfile.appliedJobs': { jobId: jobId } } } // Remove the jobId from appliedJobs array
+      {} // Remove the jobId from appliedJobs array
     );
 

[NoCoverage] BlockStatement
models/job.model.js:47:19
     );
 
     next(); // Proceed with the job deletion
-  } catch (error) {
-    next(error); // Pass any errors to the next middleware
-  }
+  } catch (error) {}
 });
 
