[Survived] BooleanLiteral
models/user.model.js:4:37
 const mongoose = require('mongoose');
 
 const UserSchema = new mongoose.Schema({
-  first_name: { type: String, trim: true },
+  first_name: { type: String, trim: false },
   middle_name: { type: String, trim: true },
   last_name: { type: String, trim: true },

[Survived] BooleanLiteral
models/user.model.js:5:38
 
 const UserSchema = new mongoose.Schema({
   first_name: { type: String, trim: true },
-  middle_name: { type: String, trim: true },
+  middle_name: { type: String, trim: false },
   last_name: { type: String, trim: true },
   gender: { type: String, enum: ['Male', 'Female', 'Other'] },

[Survived] BooleanLiteral
models/user.model.js:6:36
 const UserSchema = new mongoose.Schema({
   first_name: { type: String, trim: true },
   middle_name: { type: String, trim: true },
-  last_name: { type: String, trim: true },
+  last_name: { type: String, trim: false },
   gender: { type: String, enum: ['Male', 'Female', 'Other'] },
   email: {

[Survived] StringLiteral
models/user.model.js:7:42
   first_name: { type: String, trim: true },
   middle_name: { type: String, trim: true },
   last_name: { type: String, trim: true },
-  gender: { type: String, enum: ['Male', 'Female', 'Other'] },
+  gender: { type: String, enum: ['Male', "", 'Other'] },
   email: {
     type: String,

[Survived] StringLiteral
models/user.model.js:7:34
   first_name: { type: String, trim: true },
   middle_name: { type: String, trim: true },
   last_name: { type: String, trim: true },
-  gender: { type: String, enum: ['Male', 'Female', 'Other'] },
+  gender: { type: String, enum: ["", 'Female', 'Other'] },
   email: {
     type: String,

[Survived] BooleanLiteral
models/user.model.js:12:11
     type: String,
     required: true,
     unique: true,
-    trim: true
+    trim: false
   },
   number: { type: Number, },

[Survived] ObjectLiteral
models/user.model.js:14:11
     unique: true,
     trim: true
   },
-  number: { type: Number, },
+  number: {},
   password: { type: String, required: true },
   role: { type: String, enum: ['student', 'tpo_admin', 'management_admin', 'superuser'], required: true },

[Survived] BooleanLiteral
models/user.model.js:15:39
     trim: true
   },
   number: { type: Number, },
-  password: { type: String, required: true },
+  password: { type: String, required: false },
   role: { type: String, enum: ['student', 'tpo_admin', 'management_admin', 'superuser'], required: true },
   profile: {

[Survived] BooleanLiteral
models/user.model.js:16:100
   },
   number: { type: Number, },
   password: { type: String, required: true },
-  role: { type: String, enum: ['student', 'tpo_admin', 'management_admin', 'superuser'], required: true },
+  role: { type: String, enum: ['student', 'tpo_admin', 'management_admin', 'superuser'], required: false },
   profile: {
     type: String,

[Survived] ObjectLiteral
models/user.model.js:16:9
   },
   number: { type: Number, },
   password: { type: String, required: true },
-  role: { type: String, enum: ['student', 'tpo_admin', 'management_admin', 'superuser'], required: true },
+  role: {},
   profile: {
     type: String,

[Survived] ObjectLiteral
models/user.model.js:25:16
     address: { type: String },
     pincode: { type: Number }
   },
-  dateOfBirth: { type: Date, },
+  dateOfBirth: {},
   createdAt: { type: Date, default: new Date() },
   token: { type: String },

[Survived] ObjectLiteral
models/user.model.js:27:10
   },
   dateOfBirth: { type: Date, },
   createdAt: { type: Date, default: new Date() },
-  token: { type: String },
+  token: {},
   isProfileCompleted: { type: Boolean, default: false },
   // Student specific fields

[Survived] BooleanLiteral
models/user.model.js:28:49
   dateOfBirth: { type: Date, },
   createdAt: { type: Date, default: new Date() },
   token: { type: String },
-  isProfileCompleted: { type: Boolean, default: false },
+  isProfileCompleted: { type: Boolean, default: true },
   // Student specific fields
   studentProfile: {

[Survived] ObjectLiteral
models/user.model.js:31:17
   isProfileCompleted: { type: Boolean, default: false },
   // Student specific fields
   studentProfile: {
-    isApproved: { type: Boolean },
+    isApproved: {},
     rollNumber: { type: Number },
     resume: { type: String, },

[Survived] BooleanLiteral
models/user.model.js:34:60
     isApproved: { type: Boolean },
     rollNumber: { type: Number },
     resume: { type: String, },
-    UIN: { type: String, unique: true, sparse: true, trim: true },
+    UIN: { type: String, unique: true, sparse: true, trim: false },
     department: { type: String, enum: ['Computer', 'Civil', 'ECS', 'AIDS', 'Mechanical'] },
     year: { type: Number, enum: [1, 2, 3, 4] },

[Survived] BooleanLiteral
models/user.model.js:34:34
     isApproved: { type: Boolean },
     rollNumber: { type: Number },
     resume: { type: String, },
-    UIN: { type: String, unique: true, sparse: true, trim: true },
+    UIN: { type: String, unique: false, sparse: true, trim: true },
     department: { type: String, enum: ['Computer', 'Civil', 'ECS', 'AIDS', 'Mechanical'] },
     year: { type: Number, enum: [1, 2, 3, 4] },

[Survived] StringLiteral
models/user.model.js:35:61
     rollNumber: { type: Number },
     resume: { type: String, },
     UIN: { type: String, unique: true, sparse: true, trim: true },
-    department: { type: String, enum: ['Computer', 'Civil', 'ECS', 'AIDS', 'Mechanical'] },
+    department: { type: String, enum: ['Computer', 'Civil', "", 'AIDS', 'Mechanical'] },
     year: { type: Number, enum: [1, 2, 3, 4] },
     addmissionYear: { type: Number },

[Survived] ObjectLiteral
models/user.model.js:36:11
     resume: { type: String, },
     UIN: { type: String, unique: true, sparse: true, trim: true },
     department: { type: String, enum: ['Computer', 'Civil', 'ECS', 'AIDS', 'Mechanical'] },
-    year: { type: Number, enum: [1, 2, 3, 4] },
+    year: {},
     addmissionYear: { type: Number },
     gap: { type: Boolean, default: false },

[Survived] BooleanLiteral
models/user.model.js:38:36
     department: { type: String, enum: ['Computer', 'Civil', 'ECS', 'AIDS', 'Mechanical'] },
     year: { type: Number, enum: [1, 2, 3, 4] },
     addmissionYear: { type: Number },
-    gap: { type: Boolean, default: false },
+    gap: { type: Boolean, default: true },
     liveKT: { type: Number, default: 0 },
     SGPA: {

[Survived] ObjectLiteral
models/user.model.js:41:13
     gap: { type: Boolean, default: false },
     liveKT: { type: Number, default: 0 },
     SGPA: {
-      sem1: { type: Number },
+      sem1: {},
       sem2: { type: Number },
       sem3: { type: Number },

[Survived] ObjectLiteral
models/user.model.js:46:13
       sem3: { type: Number },
       sem4: { type: Number },
       sem5: { type: Number },
-      sem6: { type: Number },
+      sem6: {},
       sem7: { type: Number },
       sem8: { type: Number }

[Survived] ObjectLiteral
models/user.model.js:50:24
       sem7: { type: Number },
       sem8: { type: Number }
     },
-    pastQualification: {
-      ssc: {
-        board: { type: String },
-        percentage: { type: Number },
-        year: { type: Number }
-      },
-      hsc: {
-        board: { type: String },
-        percentage: { type: Number },
-        year: { type: Number }
-      },
-      diploma: {
-        department: { type: String },
-        percentage: { type: Number },
-        year: { type: Number }
-      },
-    },
+    pastQualification: {},
     appliedJobs: [
       {

[Survived] ObjectLiteral
models/user.model.js:51:12
       sem8: { type: Number }
     },
     pastQualification: {
-      ssc: {
-        board: { type: String },
-        percentage: { type: Number },
-        year: { type: Number }
-      },
+      ssc: {},
       hsc: {
         board: { type: String },

[Survived] ObjectLiteral
models/user.model.js:52:16
     },
     pastQualification: {
       ssc: {
-        board: { type: String },
+        board: {},
         percentage: { type: Number },
         year: { type: Number }

[Survived] ObjectLiteral
models/user.model.js:54:15
       ssc: {
         board: { type: String },
         percentage: { type: Number },
-        year: { type: Number }
+        year: {}
       },
       hsc: {

[Survived] ObjectLiteral
models/user.model.js:56:12
         percentage: { type: Number },
         year: { type: Number }
       },
-      hsc: {
-        board: { type: String },
-        percentage: { type: Number },
-        year: { type: Number }
-      },
+      hsc: {},
       diploma: {
         department: { type: String },

[Survived] ArrayDeclaration
models/user.model.js:67:18
         year: { type: Number }
       },
     },
-    appliedJobs: [
-      {
-        // Reference to job posting
-        jobId: { type: mongoose.Schema.Types.ObjectId, ref: 'Job' },
-        // Track application status
-        status: { type: String, enum: ['applied', 'interview', 'hired', 'rejected'], default: 'applied' },
-        package: { type: Number },
-        appliedAt: { type: Date, default: Date.now }
-      }
-    ],
+    appliedJobs: [],
     internships: [
       {

[Survived] ObjectLiteral
models/user.model.js:72:17
         // Reference to job posting
         jobId: { type: mongoose.Schema.Types.ObjectId, ref: 'Job' },
         // Track application status
-        status: { type: String, enum: ['applied', 'interview', 'hired', 'rejected'], default: 'applied' },
+        status: {},
         package: { type: Number },
         appliedAt: { type: Date, default: Date.now }

[Survived] StringLiteral
models/user.model.js:72:73
         // Reference to job posting
         jobId: { type: mongoose.Schema.Types.ObjectId, ref: 'Job' },
         // Track application status
-        status: { type: String, enum: ['applied', 'interview', 'hired', 'rejected'], default: 'applied' },
+        status: { type: String, enum: ['applied', 'interview', 'hired', ""], default: 'applied' },
         package: { type: Number },
         appliedAt: { type: Date, default: Date.now }

[Survived] ObjectLiteral
models/user.model.js:73:18
         jobId: { type: mongoose.Schema.Types.ObjectId, ref: 'Job' },
         // Track application status
         status: { type: String, enum: ['applied', 'interview', 'hired', 'rejected'], default: 'applied' },
-        package: { type: Number },
+        package: {},
         appliedAt: { type: Date, default: Date.now }
       }

[Survived] ObjectLiteral
models/user.model.js:74:20
         // Track application status
         status: { type: String, enum: ['applied', 'interview', 'hired', 'rejected'], default: 'applied' },
         package: { type: Number },
-        appliedAt: { type: Date, default: Date.now }
+        appliedAt: {}
       }
     ],

[Survived] ObjectLiteral
models/user.model.js:78:7
       }
     ],
     internships: [
-      {
-        type: { type: String, enum: ['Full Time', "Part Time", "On-Site", "Work From Home", "Other"] },
-        companyName: { type: String },
-        companyAddress: { type: String },
-        companyWebsite: { type: String },
-        internshipDuration: { type: Number },
-        startDate: { type: Date },
-        endDate: { type: Date },
-        monthlyStipend: { type: Number },
-        description: { type: String },
-      }
+      {}
     ],
   },

[Survived] StringLiteral
models/user.model.js:79:38
     ],
     internships: [
       {
-        type: { type: String, enum: ['Full Time', "Part Time", "On-Site", "Work From Home", "Other"] },
+        type: { type: String, enum: ["", "Part Time", "On-Site", "Work From Home", "Other"] },
         companyName: { type: String },
         companyAddress: { type: String },

[Survived] ObjectLiteral
models/user.model.js:83:29
         companyName: { type: String },
         companyAddress: { type: String },
         companyWebsite: { type: String },
-        internshipDuration: { type: Number },
+        internshipDuration: {},
         startDate: { type: Date },
         endDate: { type: Date },

[Survived] ObjectLiteral
models/user.model.js:84:20
         companyAddress: { type: String },
         companyWebsite: { type: String },
         internshipDuration: { type: Number },
-        startDate: { type: Date },
+        startDate: {},
         endDate: { type: Date },
         monthlyStipend: { type: Number },

[Survived] BooleanLiteral
models/user.model.js:94:49
 
   // TPO Admin specific fields
   // more for tpo
-  tpoProfile: { position: { type: String, trim: true }, },
+  tpoProfile: { position: { type: String, trim: false }, },
 
   // Management Admin specific fields

[Survived] ObjectLiteral
models/user.model.js:94:27
 
   // TPO Admin specific fields
   // more for tpo
-  tpoProfile: { position: { type: String, trim: true }, },
+  tpoProfile: { position: {}, },
 
   // Management Admin specific fields

[Survived] BooleanLiteral
models/user.model.js:98:56
 
   // Management Admin specific fields
   // more for management
-  managementProfile: { position: { type: String, trim: true }, }
+  managementProfile: { position: { type: String, trim: false }, }
 
 });

[NoCoverage] BlockStatement
models/user.model.js:104:85
 
 
 // Middleware to delete job applicants before deleting the user
-UserSchema.pre('deleteOne', { document: true, query: false }, async function (next) {
-  try {
-    const userId = this._id; // Get the current user's ID
-
-    const Notice = mongoose.model('Notice');
-    const Job = mongoose.model('Job');
-
-    // Remove the studentId from any jobs where the user is listed as an applicant
-    await Job.updateMany(
-      { 'applicants.studentId': userId }, // Find jobs with the user as an applicant
-      { $pull: { applicants: { studentId: userId } } } // Remove the user from the applicants array
-    );
-
-    await Notice.updateMany(
-      { "sender": userId }, // Find jobs with the user as an applicant
-      { $pull: { sender: userId } } // Remove the user from the applicants array
-    );
-
-    next(); // Proceed with the user deletion
-  } catch (error) {
-    next(error); // Pass any errors to the next middleware
-  }
-});
+UserSchema.pre('deleteOne', { document: true, query: false }, async function (next) {});
 
 

[Survived] BooleanLiteral
models/user.model.js:104:41
 
 
 // Middleware to delete job applicants before deleting the user
-UserSchema.pre('deleteOne', { document: true, query: false }, async function (next) {
+UserSchema.pre('deleteOne', { document: false, query: false }, async function (next) {
   try {
     const userId = this._id; // Get the current user's ID

[NoCoverage] BlockStatement
models/user.model.js:105:7
 
 // Middleware to delete job applicants before deleting the user
 UserSchema.pre('deleteOne', { document: true, query: false }, async function (next) {
-  try {
-    const userId = this._id; // Get the current user's ID
-
-    const Notice = mongoose.model('Notice');
-    const Job = mongoose.model('Job');
-
-    // Remove the studentId from any jobs where the user is listed as an applicant
-    await Job.updateMany(
-      { 'applicants.studentId': userId }, // Find jobs with the user as an applicant
-      { $pull: { applicants: { studentId: userId } } } // Remove the user from the applicants array
-    );
-
-    await Notice.updateMany(
-      { "sender": userId }, // Find jobs with the user as an applicant
-      { $pull: { sender: userId } } // Remove the user from the applicants array
-    );
-
-    next(); // Proceed with the user deletion
-  } catch (error) {
+  try {} catch (error) {
     next(error); // Pass any errors to the next middleware
   }

[NoCoverage] ObjectLiteral
models/user.model.js:114:16
     // Remove the studentId from any jobs where the user is listed as an applicant
     await Job.updateMany(
       { 'applicants.studentId': userId }, // Find jobs with the user as an applicant
-      { $pull: { applicants: { studentId: userId } } } // Remove the user from the applicants array
+      { $pull: {} } // Remove the user from the applicants array
     );
 

[NoCoverage] ObjectLiteral
models/user.model.js:114:30
     // Remove the studentId from any jobs where the user is listed as an applicant
     await Job.updateMany(
       { 'applicants.studentId': userId }, // Find jobs with the user as an applicant
-      { $pull: { applicants: { studentId: userId } } } // Remove the user from the applicants array
+      { $pull: { applicants: {} } } // Remove the user from the applicants array
     );
 

[NoCoverage] BlockStatement
models/user.model.js:123:19
     );
 
     next(); // Proceed with the user deletion
-  } catch (error) {
-    next(error); // Pass any errors to the next middleware
-  }
+  } catch (error) {}
 });
 
