[Survived] StringLiteral
app.js:12:56
 
 // public folders
 app.use('/profileImgs', express.static(path.join(__dirname, 'public/profileImgs')));
-app.use('/resume', express.static(path.join(__dirname, 'public/resumes')));
+app.use('/resume', express.static(path.join(__dirname, "")));
 app.use('/offerLetter', express.static(path.join(__dirname, 'public/offerLetter')));
 

[Survived] StringLiteral
app.js:13:9
 // public folders
 app.use('/profileImgs', express.static(path.join(__dirname, 'public/profileImgs')));
 app.use('/resume', express.static(path.join(__dirname, 'public/resumes')));
-app.use('/offerLetter', express.static(path.join(__dirname, 'public/offerLetter')));
+app.use("", express.static(path.join(__dirname, 'public/offerLetter')));
 
 // database import 
