[Survived] BooleanLiteral
models/notice.model.js:4:75
 const mongoose = require('mongoose');
 
 const NoticeSchema = new mongoose.Schema({
-  sender: { type: mongoose.Schema.Types.ObjectId, ref: 'Users', required: true },
+  sender: { type: mongoose.Schema.Types.ObjectId, ref: 'Users', required: false },
   sender_role: { type: String, enum: ['student', 'tpo_admin', 'management_admin'], required: true },
   receiver_role: { type: String, enum: ['student', 'tpo_admin', 'management_admin'], required: true },

[Survived] ObjectLiteral
models/notice.model.js:4:11
 const mongoose = require('mongoose');
 
 const NoticeSchema = new mongoose.Schema({
-  sender: { type: mongoose.Schema.Types.ObjectId, ref: 'Users', required: true },
+  sender: {},
   sender_role: { type: String, enum: ['student', 'tpo_admin', 'management_admin'], required: true },
   receiver_role: { type: String, enum: ['student', 'tpo_admin', 'management_admin'], required: true },

[Survived] BooleanLiteral
models/notice.model.js:5:94
 
 const NoticeSchema = new mongoose.Schema({
   sender: { type: mongoose.Schema.Types.ObjectId, ref: 'Users', required: true },
-  sender_role: { type: String, enum: ['student', 'tpo_admin', 'management_admin'], required: true },
+  sender_role: { type: String, enum: ['student', 'tpo_admin', 'management_admin'], required: false },
   receiver_role: { type: String, enum: ['student', 'tpo_admin', 'management_admin'], required: true },
   title: { type: String },

[Survived] StringLiteral
models/notice.model.js:5:50
 
 const NoticeSchema = new mongoose.Schema({
   sender: { type: mongoose.Schema.Types.ObjectId, ref: 'Users', required: true },
-  sender_role: { type: String, enum: ['student', 'tpo_admin', 'management_admin'], required: true },
+  sender_role: { type: String, enum: ['student', "", 'management_admin'], required: true },
   receiver_role: { type: String, enum: ['student', 'tpo_admin', 'management_admin'], required: true },
   title: { type: String },

[Survived] BooleanLiteral
models/notice.model.js:6:96
 const NoticeSchema = new mongoose.Schema({
   sender: { type: mongoose.Schema.Types.ObjectId, ref: 'Users', required: true },
   sender_role: { type: String, enum: ['student', 'tpo_admin', 'management_admin'], required: true },
-  receiver_role: { type: String, enum: ['student', 'tpo_admin', 'management_admin'], required: true },
+  receiver_role: { type: String, enum: ['student', 'tpo_admin', 'management_admin'], required: false },
   title: { type: String },
   message: { type: String, required: true },

[Survived] ObjectLiteral
models/notice.model.js:6:18
 const NoticeSchema = new mongoose.Schema({
   sender: { type: mongoose.Schema.Types.ObjectId, ref: 'Users', required: true },
   sender_role: { type: String, enum: ['student', 'tpo_admin', 'management_admin'], required: true },
-  receiver_role: { type: String, enum: ['student', 'tpo_admin', 'management_admin'], required: true },
+  receiver_role: {},
   title: { type: String },
   message: { type: String, required: true },

[Survived] ObjectLiteral
models/notice.model.js:7:10
   sender: { type: mongoose.Schema.Types.ObjectId, ref: 'Users', required: true },
   sender_role: { type: String, enum: ['student', 'tpo_admin', 'management_admin'], required: true },
   receiver_role: { type: String, enum: ['student', 'tpo_admin', 'management_admin'], required: true },
-  title: { type: String },
+  title: {},
   message: { type: String, required: true },
   createdAt: { type: Date, default: Date.now }

[Survived] BooleanLiteral
models/notice.model.js:8:38
   sender_role: { type: String, enum: ['student', 'tpo_admin', 'management_admin'], required: true },
   receiver_role: { type: String, enum: ['student', 'tpo_admin', 'management_admin'], required: true },
   title: { type: String },
-  message: { type: String, required: true },
+  message: { type: String, required: false },
   createdAt: { type: Date, default: Date.now }
 });

[Survived] ObjectLiteral
models/notice.model.js:9:14
   receiver_role: { type: String, enum: ['student', 'tpo_admin', 'management_admin'], required: true },
   title: { type: String },
   message: { type: String, required: true },
-  createdAt: { type: Date, default: Date.now }
+  createdAt: {}
 });
 
