[Survived] StringLiteral
routes/management.route.js:26:12
 
 router.post('/login', Login);
 
-router.get('/tpo-users', authenticateToken, UsersTPO);
+router.get("", authenticateToken, UsersTPO);
 
 router.post('/deletetpo', authenticateToken, DeleteTPO);

[Survived] StringLiteral
routes/management.route.js:31:13
 router.post('/deletetpo', authenticateToken, DeleteTPO);
 
 // add management, tpo and student
-router.post('/addtpo', authenticateToken, AddTPO);
+router.post("", authenticateToken, AddTPO);
 router.post('/add-management', authenticateToken, AddManagement);
 router.post('/add-student', authenticateToken, AddStudent);

[Survived] StringLiteral
routes/management.route.js:33:13
 // add management, tpo and student
 router.post('/addtpo', authenticateToken, AddTPO);
 router.post('/add-management', authenticateToken, AddManagement);
-router.post('/add-student', authenticateToken, AddStudent);
+router.post("", authenticateToken, AddStudent);
 
 // notices all route here 

[Survived] StringLiteral
routes/management.route.js:40:12
 
 router.get('/get-all-notices', authenticateToken, GetAllNotice);
 
-router.get('/get-notice', authenticateToken, GetNotice);
+router.get("", authenticateToken, GetNotice);
 
 router.post('/delete-notice', authenticateToken, DeleteNotice);

[Survived] StringLiteral
routes/management.route.js:42:13
 
 router.get('/get-notice', authenticateToken, GetNotice);
 
-router.post('/delete-notice', authenticateToken, DeleteNotice);
+router.post("", authenticateToken, DeleteNotice);
 
 
