[Survived] StringLiteral
routes/student.route.js:36:13
 
 
 // Route to upload resume
-router.post('/upload-resume', upload.single('resume'), UploadResume);
+router.post("", upload.single('resume'), UploadResume);
 
 // Route to upload offer letter

[Survived] StringLiteral
routes/student.route.js:36:45
 
 
 // Route to upload resume
-router.post('/upload-resume', upload.single('resume'), UploadResume);
+router.post('/upload-resume', upload.single(""), UploadResume);
 
 // Route to upload offer letter

[Survived] StringLiteral
routes/student.route.js:41:13
 // Route to upload offer letter
 router.post('/upload-offer-letter', upload.single('offerLetter'), UploadOfferLetter);
 // Route to delete offer letter
-router.post('/delete-offer-letter/:jobId/:studentId', authenticateToken, DeleteOfferLetter);
+router.post("", authenticateToken, DeleteOfferLetter);
 
 // apply to job

[Survived] StringLiteral
routes/student.route.js:44:12
 router.post('/delete-offer-letter/:jobId/:studentId', authenticateToken, DeleteOfferLetter);
 
 // apply to job
-router.put('/job/:jobId/:studentId', AppliedToJob);
+router.put("", AppliedToJob);
 
 // check applied or not to job

[Killed] StringLiteral
routes/student.route.js:65:12
 // student arrays
 router.get('/all-students-data-year-and-branch', authenticateToken, StudentDataYearBranchWise)
 // student who is on interview or hired
-router.get('/notify-interview-hired', authenticateToken, NotifyStudentStatus)
+router.get("", authenticateToken, NotifyStudentStatus)
 
 module.exports = router;
killedBy: Integration Test — API Endpoints should get all students (if route exists)
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: 401
Received array: [200, 404]
