[Survived] StringLiteral
routes/superuser.route.js:22:12
 router.post('/login', Login);
 
 // management routes
-router.get('/management-users', authenticateToken, managementUsers);
+router.get("", authenticateToken, managementUsers);
 router.post('/management-add-user', authenticateToken, managementAddUsers);
 router.post('/management-delete-user', authenticateToken, managementDeleteUsers);

[Survived] StringLiteral
routes/superuser.route.js:34:13
 // student routes
 router.get('/student-users', authenticateToken, studentUsers);
 router.post('/student-add-user', authenticateToken, studentAddUsers);
-router.post('/student-delete-user', authenticateToken, studentDeleteUsers);
+router.post("", authenticateToken, studentDeleteUsers);
 // approve student
 router.post('/student-approve', authenticateToken, studentApprove);
