[Survived] StringLiteral
routes/tpo.route.js:24:12
 router.post('/post-job', authenticateToken, PostJob);
 
 // all jobs 
-router.get('/jobs',authenticateToken, AllJobs);
+router.get("",authenticateToken, AllJobs);
 
 // delete job 

[Survived] StringLiteral
routes/tpo.route.js:36:12
 router.get('/job/applicants/:jobId', authenticateToken, JobWithApplicants)
 
 // student jobs applied 
-router.get('/myjob/:studentId', authenticateToken, StudentJobsApplied)
+router.get("", authenticateToken, StudentJobsApplied)
 
 
